{
  "movies": [
    {
      "title": "Castle in the Sky",
      "url": "https://ghibli.fandom.com/wiki/Castle_in_the_Sky",
      "release_year": 1986,
      "director": "Hayao Miyazaki",
      "duration": "124 minutes",
      "description": "Castle in the Sky Kanji 天空の城ラピュタ Rōmaji Tenkū no Shiro Rapyuta Directed by Hayao Miyazaki Produced by Yasuyoshi Tokuma (Executive) Isao Takahata Written by Hayao Miyazaki Starring Mayumi Tanaka Keiko Yokozawa Kotoe Hatsui Minori Terada Music by Joe Hisaishi Cinematography Hirokata Takahashi Art Directed by Toshio Nozaki Nizô Yamamoto Editing by Takeshi Seyama Yoshihiro Kasahara Studio Studio Ghibli Production Tokuma Shoten Distributed by Toei Company Release date(s) August 2, 1986 Running time 124 minutes Budget ¥500 million ($3.3 million) Box office $15,542,039 Streaming Platform(s) Max Castle in the Sky (天空の城ラピュタ , Tenkū no Shiro Rapyuta ; also known as Laputa: Castle in the Sky ) is the 2 nd film written and directed by Hayao Miyazaki and produced by Tokuma Shoten . It is the first film",
      "synopsis": "Late one night, the civilian airship Saturn travels swiftly through the clouds. Amongst the passengers aboard are Sheeta , the owner of a strange blue stone necklace , and Colonel Muska , the government's secret agent who has abducted her and seized her necklace. Without warning, a squadron of air pirates, led by Dola , attack the airship in search of Sheeta and her necklace. During the ensuing chaos caused by the intrusion, Sheeta manages to knock Muska unconscious and retrieve her necklace. The pirates then break into her room; she attempts to hide by climbing outside and clinging to the exterior of the aircraft. However, she loses her grip and plummets into the dark sky below. As the unconscious Sheeta hurtles toward the ground, the stone on her necklace emits a mysterious light, slowing her descent significantly. From the small mining town of Slag Ravine , which just so happens to be directly underneath her, a young orphan miner named Pazu sees a distant light falling from the sky. He runs toward the light to investigate, only to find that its source is indeed the stone that Sheeta is still wearing, whom Pazu reaches out to catch. To his amazement, she feels weightless until her stone deactivates. Pazu tries to tell his boss, Mr. Duffi , of her sudden appearance, but is unable to amidst the bustle of the mining work. The miners have had no luck lately finding any coal or tin and have to start over as all the mines to the east have nothing either.  Once the mine is shut down for the night, he carries Sheeta back to his house. The next morning, Sheeta awakens to the sound of Pazu playing his trumpet on the roof. After introducing each other, Pazu asks to see her stone. Believing that her necklace is the reason for her surviving the fall, he tries to levitate himself with it, only to crash through the roof of the old blast furnace that his house is built with. After making sure he is unhurt from the mishap, Sheeta notices a photograph of Laputa, otherwise believed ",
      "poster_url": "https://static.wikia.nocookie.net/studio-ghibli/images/c/c1/Castle_in_the_Sky.jpg/revision/latest/scale-to-width-down/268?cb=20210608122415",
      "genres": [
        "Adventure",
        "Fantasy",
        "Romance"
      ],
      "characters": [
        {
          "name": "Pazu",
          "url": "https://ghibli.fandom.com/wiki/Pazu",
          "description": "Pazu Species Human Age 13 years Gender Male First Appearance Castle in the Sky Role Main character Voice actor (Japanese) Mayumi Tanaka Voice actor (English) Barbara Goodson Voice actor (Disney) James Van Der Beek",
          "appears_in": [
            "Castle in the Sky"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/8/8b/Pazu.jpg/revision/latest/scale-to-width-down/268?cb=20210214205023",
          "age": "13 years",
          "gender": "Male"
        },
        {
          "name": "Sheeta",
          "url": "https://ghibli.fandom.com/wiki/Sheeta",
          "description": "Sheeta Japanese name シータ ( Shīta ) Species Human Age 13 years Gender Female Personality Shy Taciturn Kind Curious Intelligent Wise Kind-hearted Polite Innocent First Appearance Castle in the Sky Role Main character Voice actor (Japanese) Keiko Yokozawa Shiori Fujita (child) Voice actor (English) Lara Cody Voice actor (Disney) Anna Paquin Debi Derryberry (young)",
          "appears_in": [
            "Castle in the Sky"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/b/bb/Sheeta_3.png/revision/latest/scale-to-width-down/268?cb=20221030023634",
          "age": "13 years",
          "gender": "Female"
        },
        {
          "name": "Dola",
          "url": "https://ghibli.fandom.com/wiki/Dola",
          "description": "Captain Dola Japanese name ドーラ ( Dōra ) Species Human Age 54 years Gender Female First Appearance Castle in the Sky Role Supporting character Voice actor (Japanese) Kotoe Hatsui Voice actor (English) Rachel Vanowen Voice actor (Disney) Cloris Leachman",
          "appears_in": [
            "Castle in the Sky"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/b/b3/Dola.png/revision/latest/scale-to-width-down/268?cb=20180910230438",
          "age": "54 years",
          "gender": "Female"
        },
        {
          "name": "Charles",
          "url": "https://ghibli.fandom.com/wiki/Charles",
          "description": "Charles Japanese name シャルル ( Sharuru ) Species Human Age 30 years Gender Male First Appearance Castle in the Sky Role Supporting character Voice actor (Japanese) Takuzō Kamiyama Voice actor (English) Barry Stigler Voice actor (Disney) Michael McShane",
          "appears_in": [
            "Castle in the Sky"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/f/f0/Charlie.jpg/revision/latest?cb=20181030030917",
          "age": "30 years",
          "gender": "Male"
        },
        {
          "name": "Louis",
          "url": "https://ghibli.fandom.com/wiki/Louis",
          "description": "Louis Japanese name ルイ ( Rui ) Species Human Age 25 years Gender Male First Appearance Castle in the Sky Role Supporting character Voice actor (Japanese) Yoshito Yasuhara Voice actor (English) Dave Mallow Voice actor (Disney) Mandy Patinkin",
          "appears_in": [
            "Castle in the Sky"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/2/28/Charlies.jpg/revision/latest/scale-to-width-down/268?cb=20181031025246",
          "age": "25 years",
          "gender": "Male"
        },
        {
          "name": "Henri",
          "url": "https://ghibli.fandom.com/wiki/Henri",
          "description": "Henri Species Human Age 20 years Gender Male First Appearance Castle in the Sky Voice actor (Japanese) Sukekiyo Kameyama Voice actor (English) Eddie Frierson (as Ernest Fessler) Voice actor (Disney) Andy Dick",
          "appears_in": [
            "Castle in the Sky"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/1/15/Henri.jpg/revision/latest/scale-to-width-down/268?cb=20181024031333",
          "age": "20 years",
          "gender": "Male"
        },
        {
          "name": "Motro",
          "url": "https://ghibli.fandom.com/wiki/Motro",
          "description": "Hara Motro (ハラ・モトロ, Hara Motoro ) is a character from Castle in the Sky . He is Dola's husband and works on board the airship Tiger Moth as its engineer.",
          "appears_in": [
            "Castle in the Sky"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/5/55/Castle_in_the_Sky_Motro.webp/revision/latest?cb=20250712130835",
          "age": "54 years",
          "gender": "Male"
        },
        {
          "name": "Muska",
          "url": "https://ghibli.fandom.com/wiki/Muska",
          "description": "Romska Palo Ul Laputa Species Human Age 32 years Gender Male First Appearance Castle in the Sky Voice actor (Japanese) Minori Terada Voice actor (English) Jeff Winkless Voice actor (Disney) Mark Hamill",
          "appears_in": [
            "Castle in the Sky"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/d/d5/Muska.jpg/revision/latest/scale-to-width-down/268?cb=20210516132909",
          "age": "32 years",
          "gender": "Male"
        },
        {
          "name": "General Muoro",
          "url": "https://ghibli.fandom.com/wiki/Muoro",
          "description": "General Muoro is the secondary villain in Castle in the Sky . Muoro is a general in the army and is Colonel Muska 's subordinate.",
          "appears_in": [
            "Castle in the Sky"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/1/12/Muoro.jpg/revision/latest/scale-to-width-down/268?cb=20210516135925",
          "age": "34 years (deceased)",
          "gender": "Male"
        },
        {
          "name": "Uncle Pom",
          "url": "https://ghibli.fandom.com/wiki/Uncle_Pom",
          "description": "Uncle Pom is a stocky, elderly man with wild, white hair and a bushy mustache and beard. He wears a cap, a worn and patched coat and a knapsack. Uncle Pom also carries lots of supplies for life in the mine, such as a bedroll, canteen, and lantern.",
          "appears_in": [
            "Castle in the Sky"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/d/de/Uncle_Pom.png/revision/latest/scale-to-width-down/268?cb=20180809131657",
          "age": "86 years",
          "gender": "Male"
        }
      ]
    },
    {
      "title": "Earwig and the Witch",
      "url": "https://ghibli.fandom.com/wiki/Earwig_and_the_Witch",
      "release_year": 2020,
      "director": "Goro Miyazaki",
      "duration": "82 minutes",
      "description": "Earwig and the Witch Kanji アーヤと魔女 Rōmaji Āya to Majo Directed by Goro Miyazaki Produced by Toshio Suzuki Screenplay by Keiko Niwa Emi Gunji Based on Earwig and the Witch by Diana Wynne Jones Starring Shinobu Terajima Etsushi Toyokawa Gaku Hamada Kokoro Hirasawa Sherina Munaf Music by Satoshi Takebe Studio Studio Ghibli Production NHK NHK Enterprises Distributed by NHK Toho Release date(s) December 30, 2020 (NHK General TV) August 27, 2021 (Theater) Running time 82 minutes Streaming Platform(s) Max Earwig and the Witch (アーヤと魔女 , Āya to Majo ), also titled Āya and the Witch , is a 3DCG animated film directed by Goro Miyazaki and written by Keiko Niwa and Emi Gunji. A co-production between Studio Ghibli , NHK and NHK Enterprises , the film originally aired on television on December 30, 2020, ",
      "synopsis": "A woman with thick, curly red hair is tailed by a yellow car with mechanical pinchers on the highway. She flees by motorcycle with a baby swaddled to her chest with a blanket. The baby peacefully chews on a tape titled \"Earwig\" in pen. The woman has magical capabilities, using a lock of her hair and turning it into worms to obscure the car's vision as she successfully gets away to St Morwald's Home for Children. The woman tells Earwig, the toddler, that she has to stay at St Morwald's now before leaving her on the doorstep. Earwig's cries bring two women to retrieve her from outside, also picking up the blanket with a note attached to it. The note says \"Got 12 other witches all chasing me. I'll be back for her when I've shook them off. It may take years. Her name is Earwig.\" The younger woman, Thelma, reading the note aloud ponders what the child's mother had done to anger the other witches in her coven. The elderly woman, holding Earwig, finds the idea of witches to be \"rubbish\" and dislikes the name Earwig. She is also Matron of the Home. She renames Earwig to Erica Wigg. Years later the children of the home rush outside dressed as sheet ghosts. Erica sneaks off with a friend with a key to the bell tower. Her friend, a boy named Custard , is reluctant to join her sneaking into the building, but joins her as he is too afraid to wait outside. She taunts him with scary stories on the way to the roof, where they look at everything for miles. They spot a ship in the water, marveling at it and wishing they could be on it. Custard then asks if Erica has ever wanted a family or to be somewhere other than the Home. Erica shrugs it off and says not at all. She then adds that no one would want to choose her unless they were unusual. She finds a normal family to be worse, where at the Home, everyone does what she wants. She even goes on to recite the words told to her as a baby when initially dropped off at the home, that there is plenty of sunshine from the large windows and",
      "poster_url": "https://static.wikia.nocookie.net/studio-ghibli/images/a/ac/Earwig_and_the_Witch.jpg/revision/latest/scale-to-width-down/268?cb=20220409222655",
      "genres": [
        "Adventure",
        "Fantasy",
        "Romance"
      ],
      "characters": [
        {
          "name": "Earwig/Aya/Erica",
          "url": "https://ghibli.fandom.com/wiki/Earwig",
          "description": "Earwig , also referred to as Aya Tseru (アーヤ・ツール, Āya Tsūru ) or Erica depending on translation, is the titular main protagonist of Earwig and the Witch .",
          "appears_in": [
            "Earwig and the Witch"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/d/df/Earwig.jpg/revision/latest/scale-to-width-down/268?cb=20220427170000",
          "age": "10 years",
          "gender": "Female"
        },
        {
          "name": "Bella Yaga",
          "url": "https://ghibli.fandom.com/wiki/Bella_Yaga",
          "description": "Bella Yaga (ベラ・ヤーガ, Bera Yāga ) is the main antagonist of the film Earwig and the Witch . She is the Earwig 's adoptive mother.",
          "appears_in": [
            "Earwig and the Witch"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/d/dd/Aya_3.jpg/revision/latest/scale-to-width-down/268?cb=20210319034747",
          "age": "32 years",
          "gender": "female"
        },
        {
          "name": "Mandrake",
          "url": "https://ghibli.fandom.com/wiki/Mandrake",
          "description": "Mandrake (マンドレーク, Mandorēku ) is a character in the film Earwig and the Witch . He is a former band member who lives with Bella Yaga who adopt Earwig .",
          "appears_in": [
            "Earwig and the Witch"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/9/99/Mandrake.jpeg/revision/latest/scale-to-width-down/268?cb=20210812212831",
          "age": "34 years",
          "gender": "Male"
        },
        {
          "name": "Earwig's Mother",
          "url": "https://ghibli.fandom.com/wiki/Earwig%27s_Mother",
          "description": "Earwig's mother is the overarching protagonist of the film Earwig and the Witch .",
          "appears_in": [
            "Earwig and the Witch"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/f/f0/Aya_1.jpeg/revision/latest/scale-to-width-down/268?cb=20210319034705",
          "age": "33 years",
          "gender": "Female"
        },
        {
          "name": "Thomas",
          "url": "https://ghibli.fandom.com/wiki/Thomas",
          "description": "Thomas (トーマス, Tōmasu ) is Bella Yaga 's cat in the film Earwig and the Witch .",
          "appears_in": [
            "Earwig and the Witch"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/f/f2/Thomas.jpg/revision/latest/scale-to-width-down/267?cb=20221107195948",
          "age": "9 years",
          "gender": "Male"
        },
        {
          "name": "Custard",
          "url": "https://ghibli.fandom.com/wiki/Custard",
          "description": "Custard (カスタード, Kasutādo ) is Earwig's best friend at the orphanage in the film Earwig and the Witch .",
          "appears_in": [
            "Earwig and the Witch"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/7/7c/Custard.webp/revision/latest?cb=20230420112840",
          "age": "11 years",
          "gender": "Male"
        },
        {
          "name": "Matron",
          "url": "https://ghibli.fandom.com/wiki/Matron",
          "description": "Matron is the head of the St. Morwald's Home for Children in the film Earwig and the Witch .",
          "appears_in": [
            "Earwig and the Witch"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/1/1d/Matron.webp/revision/latest?cb=20230420113758",
          "age": "41 years",
          "gender": "Female"
        },
        {
          "name": "Thelma",
          "url": "https://ghibli.fandom.com/wiki/Thelma",
          "description": "Thelma lives at the St. Morwald's Home for Children as one of the main caretakers in the film Earwig and the Witch .",
          "appears_in": [
            "Earwig and the Witch"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/e/eb/Thelma.webp/revision/latest?cb=20230420113129",
          "gender": "Female"
        }
      ]
    },
    {
      "title": "From Up on Poppy Hill",
      "url": "https://ghibli.fandom.com/wiki/From_Up_on_Poppy_Hill",
      "release_year": 2011,
      "director": "Goro Miyazaki",
      "duration": "92 minutes [ 1 ]",
      "description": "From Up on Poppy Hill Kanji コクリコ坂から Rōmaji Kokuriko-zaka Kara Directed by Goro Miyazaki Produced by Toshio Suzuki Screenplay by Hayao Miyazaki Keiko Niwa Based on Kokuriko-zaka kara by Chizuru Takahashi Tetsurō Sayama Narrated by Sarah Bolger (English) Starring Masami Nagasawasignal Junichi Okada Keiko Takeshita Yuriko Ishida Jun Fubuki Takashi Naito Shunsuke Kazama Nao Omori Teruyuki Kagawa Music by Satoshi Takebe Cinematography Atsushi Okui Editing by Takeshi Seyama Studio Studio Ghibli Production Nippon Television Network Dentsu Hakuhodo DYMP Walt Disney Japan Mitsubishi Toho Distributed by Toho Release date(s) July 17, 2011 (Japan) Running time 92 minutes [ 1 ] Budget ¥2.17 billion ($22 million) [ 2 ] Box office $61.46 million (Worldwide) [ 3 ] [ 4 ] ¥4.46 billion (Japan) [ 5 ] Streami",
      "synopsis": "The story is set in Japan in 1963 taking place in the seaport town of Yokohama. In preparation for the 1964 Summer Olympics to be held in Tokyo , people are destroying remnants of the past because they believe only in the magnificence of the new. A 16-year-old girl, Umi Matsuzaki , lives in her grandmother's boarding house called \"Coquelicot Manor\", which is located on the hill overlooking the harbour of the Port of Yohohama .  Umi's father has passed away and her mother is in America studying so she helps clean and cook for the boarders and look after her sister and brother.  In the town of Yohohama rather than telling the season based on the flowers that are blooming, they can tell what time of year it is by what boats are passing through the harbor.  Each morning, she raises a set of signal flags with the message of \"I pray for safe voyages\". A 17-year-old boy, Shun Kazama , always sees this flag from the sea as he rides a tugboat to school and responds to them, but Umi doesn't know that.  Several of the boarders include Miss Sahurah, Miki a doctor and Sashiko an artist.  After breakfast, Umi does some final cleaning before heading off to school. At Konan Academy , Umi and Shun's high school, Umi's friends show her a poem that was written in the school newspaper about her raising flags which means someone is getting Umi's messages.  Meanwhile a dispute is being raised about the fate of old school's club house called The Latin Quarter . While the school administration as well as most students wants to demolish the old and dilapidated building, a group of students including Shun struggle to preserve it.  In an act of protest during lunch Shun jumps off the roof and into the water, when Umi rushes to help him, she realizes this was just for attention as pictures are taken and lets him fall into the water again.  After arriving home, Umi goes to see her grandmother who tells her how much she appreciates her hardwork even though they have a maid.  She also tells Umi s",
      "poster_url": "https://static.wikia.nocookie.net/studio-ghibli/images/d/dd/From_Up_On_Poppy_Hill.jpg/revision/latest/scale-to-width-down/268?cb=20220212051026",
      "genres": [
        "Adventure",
        "Fantasy",
        "Romance"
      ],
      "characters": []
    },
    {
      "title": "Grave of the Fireflies",
      "url": "https://ghibli.fandom.com/wiki/Grave_of_the_Fireflies",
      "release_year": 1988,
      "director": "Isao Takahata",
      "duration": "89 minutes",
      "description": "Grave of the Fireflies JP US Kanji 火垂るの墓 Rōmaji Hotaru no Haka Directed by Isao Takahata Produced by Takanobu Sato Toru Hara Screenplay by Isao Takahata Based on Grave of the Fireflies by Akiyuki Nosaka Starring Tsutomu Tatsumi Ayano Shiraishi Yoshiko Shinohara Akemi Yamaguchi Music by Michio Mamiya Cinematography Nobuo Koyama Editing by Takeshi Seyama Studio Studio Ghibli Production Shinchosha Publishing Distributed by Toho Release date(s) April 16, 1988 Running time 89 minutes Box office ¥590 million ($5 million) Streaming Platform(s) Max Grave of the Fireflies (火垂るの墓, Hotaru no Haka ) is the 3rd feature-length animated film written and directed by Isao Takahata , produced by Studio Ghibli in association with Shinchosha Publishing and distributed by Toho . It premiered in Japan on April ",
      "synopsis": "The movie begins in modern-day Sannomiya Station, Kōbe, Hyōgo Prefecture, but then quickly flashes back to the past. Seita lies on the platform in rags and is dying from starvation. An onlooker remarks at how dirty he looked while another says, \"The American troops will be arriving soon. It would be an embarrassment if they find such a guy here at the station.\" Later that night, a janitor comes and digs through his things; finding a candy tin that contains Setsuko's ashes. He throws it out, and from there springs the spirits of Setsuko , Seita and a group of fireflies. The implication is that their spirits now haunt the station and that they will now provide the narrative throughout the story. As Seita begins to recount his past trauma, things flash back to the end of World War II, during the Kōbe fire bombings by American B-29 bombers. Setsuko and Seita, the two siblings and protagonists, are left to secure their house and their belongings in order to allow their mother , who suffers from a heart condition, to precede them to the bomb shelter. The young boy carries Setsuko on his back, and runs through the streets where people jostle each other in panic; he finally flees towards the sea. Once in safety, and after having let pass the black rain of the bombs that pours on his town, he undertakes to return towards the charred ruins with his little sister. A man announces through a megaphone the gathering at school for the inhabitants of his neighborhood. Learning that his mother has been injured, he leaves Setsuko with a family friend and goes in search of his mother. Their mother had been fatally injured in the air raid and is taken to a makeshift hospital which is actually a school, where she dies from burn wounds. Setsuko cries bitterly, while Seita tries to entertain her, hiding his own distress. She is cremated with several other corpses, and Seita collects a few meager bones in a small box. Having nowhere else to live, Setsuko and Seita go to live with their aun",
      "poster_url": "https://static.wikia.nocookie.net/studio-ghibli/images/3/34/GotF_Japan_Poster.png/revision/latest/scale-to-width-down/268?cb=20240610014122",
      "genres": [
        "Adventure",
        "Fantasy",
        "Romance"
      ],
      "characters": [
        {
          "name": "Seita",
          "url": "https://ghibli.fandom.com/wiki/Seita_Yokokawa",
          "description": "Seita Yokokawa Species Human (Spirit) Age 14 years Gender Male First Appearance Grave of the Fireflies Role Main character Voice actor (Japanese) Tsutomu Tatsumi Voice actor (CPM) J. Robert Spencer Voice actor (Sentai) Adam Gibbs Voice actor (Netflix) Lucas Jaye",
          "appears_in": [
            "Grave of the Fireflies"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/2/21/Seita_Yokokawa.jpg/revision/latest/scale-to-width-down/268?cb=20210215103515",
          "age": "14 years",
          "gender": "Male"
        },
        {
          "name": "Setsuko",
          "url": "https://ghibli.fandom.com/wiki/Setsuko_Yokokawa",
          "description": "Setsuko Yokokawa Species Human (Spirit) Age 4 years (death of deceased) Gender Female First Appearance Grave of the Fireflies Voice actor (Japanese) Ayano Shirashi Voice actor (CPM) Rhoda Chrosite Voice actor (Sentai) Emily Neves Voice actor (Netflix) Luna Hamilton",
          "appears_in": [
            "Grave of the Fireflies"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/a/a8/Setsuko_Yokokawa.jpg/revision/latest/scale-to-width-down/268?cb=20210215103612",
          "age": "4 years (death of deceased)",
          "gender": "Female"
        },
        {
          "name": "Seita's aunt",
          "url": "https://ghibli.fandom.com/wiki/Seita%27s_aunt",
          "description": "Aunt Yokokawa Species Human Gender Female First Appearance Grave of the Fireflies Role Supporting character Voice actor (Japanese) Akemi Yamaguchi Voice actor (CPM) Amy Jones Voice actor (Sentai) Marcy Bannor Voice actor (Netflix) Ren Hanami",
          "appears_in": [
            "Grave of the Fireflies"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/1/1b/Seita_Aunt.jpg/revision/latest/scale-to-width-down/267?cb=20110701062623",
          "gender": "Female"
        },
        {
          "name": "Farmer",
          "url": "https://ghibli.fandom.com/wiki/Farmer_(Grave_of_the_Fireflies)",
          "description": "Farmer (Grave of the Fireflies) Species Human Gender Male First Appearance Grave of the Fireflies Voice actor (CPM) Dan Green",
          "appears_in": [
            "Grave of the Fireflies"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/3/3d/Farmer.png/revision/latest/scale-to-width-down/268?cb=20220128103118",
          "gender": "Male"
        }
      ]
    },
    {
      "title": "Howl's Moving Castle",
      "url": "https://ghibli.fandom.com/wiki/Howl%27s_Moving_Castle",
      "release_year": 2004,
      "director": "Hayao Miyazaki",
      "duration": "119 minutes",
      "description": "Howl's Moving Castle JP US Kanji ハウルの動く城 Rōmaji Hauru no Ugoku Shiro Directed by Hayao Miyazaki Produced by Toshio Suzuki Screenplay by Hayao Miyazaki Based on Howl's Moving Castle by Diana Wynne Jones Starring Chieko Baisho Takuya Kimura Akihiro Miwa Music by Joe Hisaishi Cinematography Atsushi Okui Editing by Takeshi Seyama Studio Studio Ghibli Production Tokuma Shoten Nippon Television Network Dentsu Walt Disney Japan/Buena Vista Home Entertainment Mitsubishi Toho Distributed by Toho Release date(s) September 5, 2004 (Venice) November 20, 2004 (Japan) Running time 119 minutes Budget ¥2.4 billion USD$24 million Box office ¥23.2 billion USD$235.1 million (worldwide) Howl's Moving Castle (ハウルの動く城 , Howl no Ugoku Shiro ) is the 14th animated fantasy film directed by Hayao Miyazaki , produce",
      "synopsis": "Sophie , a needlewoman who works at her family's hat shop , is a responsible-yet-plain 18-year-old girl who goes to Cesari's café to visit her sister Lettie when she encounters by chance a mysterious wizard named Howl . This encounter arouses the evil Witch of the Waste , who later enters the hat shop and transforms Sophie into a 90-year-old woman. As the curse prevents her from telling anyone of her condition, Sophie decides to leave her home of Market Chipping and seek out a cure out in the waste . Along the way, Sophie meets upon the hill the scarecrow Turnip Head . She passes the mysterious moving castle and enters it. At this point, she meets the enchanted fire demon named Calcifer , who powers the castle and recognizes that Sophie has been cursed. Calcifer offers to break the curse in exchange for Sophie's help in breaking the spell he's under, which keeps Calcifer bound to the house. She also meets Howl's young apprentice Markl . When Howl appears, Sophie announces that she is the castle's new cleaning lady, hired by Calcifer because he was sick of how dirty the castle was. Meanwhile, in Sophie's home country of Ingary , the beginning of a war has sparked against another neighboring town - following the disappearance of the other realm's Crown Prince . Slowly the war begins to creep into Sophie's country itself. Howl receives summons from the King , who orders his various assumed identities to fight in the war. However, Howl cowers in his bedroom and comes up with an idea to send Sophie to pose as his mother, announcing that he would be useless. At the palace in the capital of Kingsbury , Sophie runs into an asthmatic dog, Heen , who she thinks is Howl undercover. She also meets the Witch of the Waste , who rides on a palanquin carried by two blob men . Magical wards disintegrate the Witch's henchmen and she is forced to travel by foot. They begin to race up the stairs. Once they are inside the castle, Heen and Suliman's servant Kosho lead Sophie to the green",
      "poster_url": "https://static.wikia.nocookie.net/studio-ghibli/images/c/cd/Howl_Japan_Poster.png/revision/latest/scale-to-width-down/268?cb=20240612233116",
      "genres": [
        "Adventure",
        "Fantasy",
        "Romance"
      ],
      "characters": [
        {
          "name": "Howl",
          "url": "https://ghibli.fandom.com/wiki/Howl",
          "description": "Howl Jenkins Pendragon Japanese name ハウル ( Hauru ) Species Wizard Age Unknown (film) 27 years (original novel) Gender Male First Appearance Howl's Moving Castle Role Deuteragonist Voice actor (Japanese) Takuya Kimura Voice actor (English) Christian Bale",
          "appears_in": [
            "Howl's Moving Castle"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/f/fe/Howl_Jenkins_Pendragon.jpg/revision/latest/scale-to-width-down/268?cb=20200423183516",
          "age": "Unknown (film) 27 years (original novel)",
          "gender": "Male"
        },
        {
          "name": "Sophie Hatter",
          "url": "https://ghibli.fandom.com/wiki/Sophie",
          "description": "Sophie Hatter Young Elder Bob cut Starlight Japanese name ソフィー・ハッター ( Sofī Hattā ) Species Human Age 18 years (only prologue and after being cured of her curse) 90 years (after she get cursed by Witch of the Waste ) Gender Female First Appearance Howl's Moving Castle Role Main protagonist Voice actor (Japanese) Chieko Baisho Voice actor (Disney) Emily Mortimer (young) Jean Simmons (old)",
          "appears_in": [
            "Howl's Moving Castle"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/f/f4/Sophie_short_hair.jpg/revision/latest/scale-to-width-down/268?cb=20210708010401",
          "age": "18 years (only prologue and after being cured of her curse) 90 years (after she get cursed by Witch of the Waste )",
          "gender": "Female"
        },
        {
          "name": "Witch of the Waste",
          "url": "https://ghibli.fandom.com/wiki/Witch_of_the_Waste",
          "description": "Witch of the Waste Species Witch/Human Age 273 years Gender Female First Appearance Howl's Moving Castle Role Secondary villain (formerly) Supporting character Voice actor (Japanese) Akihiro Miwa Voice actor (Disney) Lauren Bacall",
          "appears_in": [
            "Howl's Moving Castle"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/3/3f/The_Witch.jpg/revision/latest?cb=20170829232306",
          "age": "273 years",
          "gender": "Female"
        },
        {
          "name": "Calcifer",
          "url": "https://ghibli.fandom.com/wiki/Calcifer",
          "description": "Calcifer Japanese name カルシファー ( Karushifā ) Species Demon (originally Star Children ) Gender Male First Appearance Howl's Moving Castle Role Supporting character Voice actor (Japanese) Tatsuya Gashuin Voice actor (Disney) Billy Crystal",
          "appears_in": [
            "Howl's Moving Castle"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/2/2a/Calcifer.png/revision/latest/scale-to-width-down/268?cb=20110705204516",
          "gender": "Male"
        },
        {
          "name": "Markl",
          "url": "https://ghibli.fandom.com/wiki/Markl",
          "description": "Markl Japanese name マルクル ( markl ) Species Human (Wizard) Age 10 years Gender Male First Appearance Howl's Moving Castle Role Supporting character Voice actor (Japanese) Ryūnosuke Kamiki Voice actor (Disney) Josh Hutcherson",
          "appears_in": [
            "Howl's Moving Castle"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/5/5d/Markl.jpg/revision/latest/scale-to-width-down/268?cb=20210707005535",
          "age": "10 years",
          "gender": "Male"
        },
        {
          "name": "Turnip Head",
          "url": "https://ghibli.fandom.com/wiki/Turnip_Head",
          "description": "Turnip Head, (かかしのカブ , Kakashi no Kabu , lit. \"Scarecrow Turnip\" ), credited in the film as Turnip and known in the original novels as Prince Justin , is a character in the film, Howl's Moving Castle . He follows Sophie after she rescues him on her way to the wasteland .",
          "appears_in": [
            "Howl's Moving Castle"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/e/e7/Turnip-Head-In-Howls-Moving-Castle.jpg/revision/latest/scale-to-width-down/268?cb=20210707050624",
          "age": "20 years - 30 years",
          "gender": "Male"
        },
        {
          "name": "Suliman",
          "url": "https://ghibli.fandom.com/wiki/Suliman",
          "description": "Madame Suliman (サリマン , Sariman ) is a main villain the film, Howl's Moving Castle . She is the court-appointed sorceress and mastermind behind the King . Saddened by her former talented disciple Howl for leaving her, she keeps a close watch over him as a potential archenemy. She has a loyal henchdog named Heen . She is voiced by Haruko Katō in the Japanese version and Blythe Danner in the Disney dub.",
          "appears_in": [
            "Howl's Moving Castle"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/6/64/Madame_Suliman.png/revision/latest/scale-to-width-down/268?cb=20181015234604",
          "age": "70 years - 80 years",
          "gender": "Female"
        },
        {
          "name": "Heen",
          "url": "https://ghibli.fandom.com/wiki/Heen",
          "description": "Heen (ヒン, Hin ) is a character in Howl's Moving Castle . He is an \"errand dog\" of Suliman and was created solely for the film adaptation. He is voiced by Daijirō Harada, who has said Heen's gasping noise sounds like a person with asthma.",
          "appears_in": [
            "Howl's Moving Castle"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/a/a7/Heen.png/revision/latest/scale-to-width-down/268?cb=20110704002033",
          "gender": "Male"
        }
      ]
    },
    {
      "title": "Kiki's Delivery Service",
      "url": "https://ghibli.fandom.com/wiki/Kiki%27s_Delivery_Service",
      "release_year": 1989,
      "director": "Hayao Miyazaki",
      "duration": "102 minutes",
      "description": "Kiki's Delivery Service JP US Kanji 魔女の宅急便 Rōmaji Majo No Takkyūbin Directed by Hayao Miyazaki Produced by Hideo Ogata Yasuji Urushido Toru Hara Hayao Miyazaki Yasuyoshi Tokuma Mikihiko Tsuzuki Screenplay by Hayao Miyazaki Based on \"Kiki's Delivery Service\" by Eiko Kadono Music by Joe Hisaishi Cinematography Shigeo Sugimura Editing by Takeshi Seyama Studio Studio Ghibli Production Tokuma Shoten Yamato Transport Nippon Television Network Distributed by Toei Company Release date(s) July 29, 1989 Running time 102 minutes Budget ¥800 million (estimated) (US$6.9 million) Box office ¥2.2 billion (estimated) (US$18 million) Streaming Platform(s) Max Kiki's Delivery Service ( 魔女の宅急便 , Majo no Takkyūbin , lit. \"Witch's Delivery Service\") is the 5th animated fantasy film written, directed and produc",
      "synopsis": "One blustery day, thirteen-year-old trainee witch Kiki lay idle on a field listening to her dad's radio, when she hears an announcement that the evening would be clear with a beautiful full moon. She rushes home and informs her mother, Kokiri (who is working on a potion), that she plans to leave home that very evening instead of the following month as she had originally planned. As Kiki rushes to her room to pack, Kokiri informs her client Dora of the age-old tradition that 13-year-old witches had to leave home for a year on the night of a full moon to pursue their skill through training.  Kokiri is worried about Kiki leaving tonight because she didn't get a chance to learn about her mother's skill making potions and Kiki barely knows how to fly which is one skill every witch trainee needs to know how to do by the time they are thirteen.  Ms. Dora assures Kokiri that everyone has their own interest and Kiki could find a skill that is new.  As Kiki packs her belongings upstairs, her companion, a talking black cat named Jiji points out they were supposed to wait till next month as they planned and she tells him that if she meets a boy or something else occurs, she would have to extend her stay and not leave at all. Her father, Okino , arrives home and learns of Kiki's plans to depart that night, which cancels their previously planned camping trip that weekend. He begins calling relatives to inform them Kiki is leaving and soon, Kokiri fits Kiki with her purple witch's uniform. That evening, her family and friends gather to send Kiki off. Kokiri gives Kiki her broom, at first Kiki is reluctant to take it as it is too big and she worked on her own broom but her mother assures her this broom guided her to this town and it will guide Kiki.  She leaves home with Jiji and her parents and family wishes her well. While having trouble at first with her flying, Kiki heads on her way. Along the way, she encounters a fortune-telling witch who tells her of the challenges she may f",
      "poster_url": "https://static.wikia.nocookie.net/studio-ghibli/images/a/a4/Kiki%27s_JP_Poster.png/revision/latest/scale-to-width-down/268?cb=20240704152630",
      "genres": [
        "Adventure",
        "Fantasy",
        "Romance"
      ],
      "characters": [
        {
          "name": "Kiki",
          "url": "https://ghibli.fandom.com/wiki/Kiki",
          "description": "Kiki Japanese name キキ ( Kiki ) Species Human (Witch) Age 13 years Gender Female Personality Adventurer Adorable Kind Curious Cute Dramatic Intelligent Kind-hearted Childish Very Friendly Polite Innocent Sweet Upbeat First Appearance Kiki's Delivery Service Role Main character Voice actor (Japanese) Minami Takayama Voice actor (Streamline) Lisa Michelson Voice actor (Disney) Kirsten Dunst",
          "appears_in": [
            "Kiki's Delivery Service"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/5/59/Kiki.jpg/revision/latest/scale-to-width-down/268?cb=20210214125850",
          "age": "13 years",
          "gender": "Female"
        },
        {
          "name": "Jiji",
          "url": "https://ghibli.fandom.com/wiki/Jiji",
          "description": "Jiji Species Cat Age 13 years (From the Picture Book) Gender Male First Appearance Kiki's Delivery Service Role Supporting character Voice actor (Japanese) Rei Sakuma Voice actor (Streamline) Kerrigan Mahan Voice actor (Disney) Phil Hartman",
          "appears_in": [
            "Kiki's Delivery Service"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/b/b4/Jiji.jpg/revision/latest/scale-to-width-down/268?cb=20210218143145",
          "age": "13 years (From the Picture Book)",
          "gender": "Male"
        },
        {
          "name": "Okino",
          "url": "https://ghibli.fandom.com/wiki/Okino",
          "description": "Okino ( オキノ ) is a side character in Kiki's Delivery Service . He is a father of Kiki and a husband of Kokiri .",
          "appears_in": [
            "Kiki's Delivery Service"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/8/80/Okino.jpg/revision/latest/scale-to-width-down/268?cb=20210218142837",
          "age": "35 years",
          "gender": "Male"
        },
        {
          "name": "Kokiri",
          "url": "https://ghibli.fandom.com/wiki/Kokiri",
          "description": "Kokiri Species Human (Witch) Age 36 years Gender Female First Appearance Kiki's Delivery Service Voice actor (Japanese) Mieko Nobusawa Voice actor (Streamline) Barbara Goodson Voice actor (Disney) Kath Soucie",
          "appears_in": [
            "Kiki's Delivery Service"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/7/72/Kokiri.jpg/revision/latest/scale-to-width-down/268?cb=20210218142759",
          "age": "36 years",
          "gender": "Female"
        },
        {
          "name": "Osono",
          "url": "https://ghibli.fandom.com/wiki/Osono",
          "description": "Osono (おソノ , Osono ) is a baker and proprietor of Gütiokipänjä , as seen in the film, Kiki's Delivery Service . She is married to Fukuo , a fellow baker.",
          "appears_in": [
            "Kiki's Delivery Service"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/3/3a/Osono.jpg/revision/latest/scale-to-width-down/268?cb=20210218143020",
          "gender": "Female"
        },
        {
          "name": "Osono's Husband",
          "url": "https://ghibli.fandom.com/wiki/Fukuo",
          "description": "Fukuo Species Human Age Adult Gender Male First Appearance Kiki's Delivery Service Role Supporting character Voice actor (Japanese) Koichi Yamadera Voice actor (Streamline) Gregory Snegoff Voice actor (Disney) John Hostetter",
          "appears_in": [
            "Kiki's Delivery Service"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/2/29/Fukuo.jpg/revision/latest/scale-to-width-down/268?cb=20210218143410",
          "age": "Adult",
          "gender": "Male"
        }
      ]
    },
    {
      "title": "List of Studio Ghibli films by rating",
      "url": "https://ghibli.fandom.com/wiki/List_of_Studio_Ghibli_films_by_rating",
      "release_year": null,
      "director": null,
      "duration": null,
      "description": "This article details the content ratings given to Studio Ghibli films by film rating authorities of English speaking countries, notably the Motion Picture Association of America (MPAA), the British Board of Film Classification (BBFC), the Irish Film Censors/Classification Office (IFCO), the Australian Classification Board (ACB), or New Zealand's Classification Office (OFLC). Ratings generally fall into one of general audience (\"G\" or \"U\"), parental guidance (\"PG\" or \"M\"), or age restricted (\"PG-13\" or \"12\").",
      "synopsis": null,
      "poster_url": null,
      "genres": [
        "Fantasy",
        "Drama",
        "Animation"
      ],
      "characters": []
    },
    {
      "title": "Mary and the Witch's Flower",
      "url": "https://ghibli.fandom.com/wiki/Mary_and_the_Witch%27s_Flower",
      "release_year": 2017,
      "director": "Hiromasa Yonebayashi",
      "duration": "103 minutes",
      "description": "Mary and the Witch's Flower Kanji メアリと魔女の花 Rōmaji Meari to Majo no Hana Directed by Hiromasa Yonebayashi Produced by Yoshiaki Nishimura Screenplay by Riko Sakaguchi Hiromasa Yonebayashi Based on The Little Broomstick by Mary Stewart Starring Hana Sugisaki Yūki Amami Fumiyo Kohinata Music by Takatsugu Muramatsu Cinematography Toru Fukushi Studio Studio Ponoc Production Nippon TV Movies Mary and the Witch's Flower Production Committee : Amuse Chukyo TV D.N. Dream Partners Dentsu Fukuoka Broadcasting Corporation Hakuhodo DYMP Hiroshima TV Kadokawa Kenon Khara LAWSON LINE Miyagi Television Broadcasting Co., Ltd. Nippon Television Network Shizuoka Daiichi Television Corporation The Sapporo Television Broadcasting Co., Ltd. The Yomiuri Shimbun Toho Walt Disney Japan Yomiuri Telecasting Corporati",
      "synopsis": "Mary Smith moves into the northern English country estate of her great aunt / adoptive grandmother Charlotte . The bored, friendless girl tries to make herself useful through chores, but repeatedly messes up. A local boy named Peter teases her for her clumsiness and wild red hair. Tib -cat and Gib -cat, Peter's cats, lead Mary to some mysterious glowing flowers. The gardener identifies the flowers as \" fly-by-night \"; legend has it that witches covet the flower for its magical power. The next day, Gib-cat disappears. Tib-cat leads Mary to a broomstick but she accidentally bursts a fly-by-night bulb on it. The bulb releases magical power, making the broomstick come to life and enabling Mary to ride it like a witch. The Little Broomstick whisks Mary away to a complex of buildings in the clouds, known as Endor College for witches. Head mistress Madam Mumblechook assumes Mary is a new pupil with Tib as her familiar, and takes her on a tour of the college. She introduces Mary to Doctor Dee , the college's renowned chemistry teacher. Mary finds herself able to perform advanced spells such as invisibility. Madam and Doctor Dee become convinced that Mary is a prodigy because of her performance as well as her red hair, which is a distinguishing feature among the best witches. Mary admits that her magical ability comes from fly-by-night, and that Tib belongs to Peter. Madam's attitude changes then but she lets Mary return home once Mary turns over Peter's address. That night, Madam sends a message to Mary, informing that she's kidnapped Peter, and demands that Mary bring the fly-by-night bulbs to her. She and Tib quickly fly back to Endor with the bulbs, but Madam and Doctor Dee imprison her in their transformation lab. Mary finds Peter locked in with her, and discovers that Doctor Dee has been experimenting on animals, including Gib-cat, transforming them into fantastic creatures. From the spell book she took from Madam's office, Mary uses a spell to undo the transformations",
      "poster_url": "https://static.wikia.nocookie.net/studio-ghibli/images/1/15/Mary_and_the_Witch%27s_Flower.jpg/revision/latest/scale-to-width-down/268?cb=20210824193855",
      "genres": [
        "Adventure",
        "Fantasy",
        "Drama"
      ],
      "characters": [
        {
          "name": "Mary Smith",
          "url": "https://ghibli.fandom.com/wiki/Mary_Smith",
          "description": "Mary Smith is the main protagonist in the film: Mary and the Witch's Flower directed by Hiromasa Yonebayashi and produced by Studio Ponoc . Her Seiyū was Hana Sugisaki.",
          "appears_in": [
            "Mary and the Witch's Flower"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/b/b6/Mary_Smith.jpg/revision/latest/scale-to-width-down/268?cb=20210420135816",
          "age": "11 years (April 19th)",
          "gender": "Female"
        },
        {
          "name": "Peter",
          "url": "https://ghibli.fandom.com/wiki/Peter",
          "description": "Peter is the deuteragonist in the film Mary and the Witch's Flower .",
          "appears_in": [
            "Mary and the Witch's Flower"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/1/13/Peter.jpg/revision/latest?cb=20170703153239",
          "age": "12 years",
          "gender": "Male"
        },
        {
          "name": "Tib",
          "url": "https://ghibli.fandom.com/wiki/Tib",
          "description": "Tib (ティブ, Tibu ) is one of pet cats of Peter appeared in Mary and the Witch's Flower . He is also a companion of Mary . He and Gib are very close, and Zebedee suspects that they are mates.",
          "appears_in": [
            "Mary and the Witch's Flower"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/0/05/Cat.png/revision/latest/scale-to-width-down/268?cb=20170330144347",
          "age": "6 years",
          "gender": "Male"
        },
        {
          "name": "Gib",
          "url": "https://ghibli.fandom.com/wiki/Gib",
          "description": "Gib (ギブ, Gibu ) is one of Peter 's pet cats who appears in Mary and the Witch's Flower . She and Tib are very close, and Zebedee suspects that they are mates.",
          "appears_in": [
            "Mary and the Witch's Flower"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/c/cb/Gib.jpeg/revision/latest/scale-to-width-down/268?cb=20230417011444",
          "age": "5 years",
          "gender": "Female"
        },
        {
          "name": "Charlotte",
          "url": "https://ghibli.fandom.com/wiki/Charlotte",
          "description": "Charlotte Species Witch Age 71 years Gender Female First Appearance Mary and the Witch's Flower Voice actor (Japanese) Shinobu Otake Hikari Mitsushima (young) Voice actor (English) Lynda Baron Teresa Gallagher (young)",
          "appears_in": [
            "Mary and the Witch's Flower"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/2/21/Charlotte.jpg/revision/latest?cb=20180507184432",
          "age": "71 years",
          "gender": "Female"
        },
        {
          "name": "Flanagan",
          "url": "https://ghibli.fandom.com/wiki/Flanagan",
          "description": "Danny Flanagan Japanese name ダニー・フラナガン ( Danī Furanagan ) Species Scottish Mouse (Wizard) Age 27 years Gender Male First Appearance Mary and the Witch's Flower Voice actor (Japanese) Jiro Sato Voice actor (Disney) Ewen Bremner",
          "appears_in": [
            "Mary and the Witch's Flower"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/e/ed/Flanagan.jpg/revision/latest/scale-to-width-down/268?cb=20181121035509",
          "age": "27 years",
          "gender": "Male"
        },
        {
          "name": "Confucius",
          "url": "https://ghibli.fandom.com/wiki/Confucius",
          "description": "Confucius Japanese name コンフューシャス ( Konfūshasu ) Species Dog Age 5 years Gender Male First Appearance Mary and the Witch's Flower",
          "appears_in": [
            "Mary and the Witch's Flower"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/c/ca/Confucius.jpg/revision/latest/scale-to-width-down/268?cb=20230417012751",
          "age": "5 years",
          "gender": "Male"
        },
        {
          "name": "Madam Mumblechook",
          "url": "https://ghibli.fandom.com/wiki/Madam_Mumblechook",
          "description": "Madame Mumblechook is the secret main villain in the Studio Ponoc film, Mary and the Witch's Flower .",
          "appears_in": [
            "Mary and the Witch's Flower"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/4/4f/Madam_Mumblechook.jpg/revision/latest/scale-to-width-down/267?cb=20200401230001",
          "age": "110 years - 120 years",
          "gender": "Female"
        }
      ]
    },
    {
      "title": "Modest Heroes",
      "url": "https://ghibli.fandom.com/wiki/Modest_Heroes",
      "release_year": 2019,
      "director": "Hiromasa Yonebayashi",
      "duration": "54 minutes",
      "description": "Modest Heroes Kanji ちいさな英雄－カニとタマゴと透明人間 Rōmaji Chīsana Eiyū: Kani to Tamago to Tōmei Ningen Directed by Hiromasa Yonebayashi , Yoshiyuki Momose and Akihiko Yamashita Produced by Hiromasa Yonebayashi Yoshiaki Nishimura Isao Takahata Written by Yoshiyuki Momose , Akihiko Yamashita Screenplay by Hiromasa Yonebayashi Story by Yoshiaki Nishimura Music by Masanori Shimada , Takatsugu Muramatsu , Yasutaka Nakata Art Directed by Kaori Hino , Uken Ryū Editing by Toshihiko Kojima, Yumiko Nakaba Studio Studio Ponoc Production Dentsu , Nippon Television Network Studio Ponoc Distributed by Toho Release date(s) Jun 19, 2019 Running time 54 minutes Budget Box office Modest Heroes ( ちいさな英雄－カニとタマゴと透明人間 , Chīsana Eiyū: Kani to Tamago to Tōmei Ningen , lit. \"Modest Heroes\") is a three-part Japanese animated a",
      "synopsis": "Kanini and Kanino are tiny anthropomorphized freshwater crab siblings who live underwater in a nearby stream. Their father, Toto, is taking care of them while their mother, Kaka, has gone away to give birth. When they suddenly find themselves alone, the siblings embark on a dangerous journey to find their father. All of the dialogue is performed in a made-up language. Shun Yashima is a young boy born with a lethal allergy to eggs. Every day, then, his family focuses on protecting Shun from contact with eggs. Shun has to eat special meals at school, his classmates must be careful not to spit on him and get saliva with egg all over him, and Shun has to take his allergy into consideration when he thinks about going on a school field trip. At the same time, his mother tries to maintain her career as a dance teacher. One day Shun mistakenly consumes egg products when his parents are away from home. A man struggles with not being seen by those around him. Throughout the day, he is ignored by everyone else, and even begins to lose his physical permanence. An unexpected stranger speaks to him... and then the invisible man suddenly has an opportunity to be a hero.",
      "poster_url": "https://static.wikia.nocookie.net/studio-ghibli/images/a/ac/Ponoc_Short_Films_Theatre%2C_Volume_1_%E2%80%93_Modest_Heroes-_Official_Trailer/revision/latest/scale-to-width-down/268?cb=20240417233425",
      "genres": [
        "Adventure",
        "Animation"
      ],
      "characters": []
    },
    {
      "title": "My Neighbor Totoro",
      "url": "https://ghibli.fandom.com/wiki/My_Neighbor_Totoro",
      "release_year": 1988,
      "director": "Hayao Miyazaki",
      "duration": "100 minutes",
      "description": "My Neighbor Totoro JP US Kanji となりのトトロ Rōmaji Tonari no Totoro Directed by Hayao Miyazaki Produced by Toru Hara Written by Hayao Miyazaki Narrated by Lisa Michelson (Streamline) Dakota Fanning (Disney) Starring Chika Sakamoto Noriko Hidaka Hitoshi Takagi Music by Joe Hisaishi Cinematography Hisao Shirai Editing by Takeshi Seyama Studio Studio Ghibli Production Tokuma Shoten Distributed by Toho Release date(s) April 16, 1988 Running time 100 minutes Box office ¥588 million My Neighbor Totoro (となりのトトロ , Tonari no Totoro ) is the 4th animated film written and directed by Hayao Miyazaki , produced by Toru Hara and animated by Studio Ghibli for Tokuma Shoten . It premiered alongside Grave of the Fireflies as a double-feature on April 16, 1988.",
      "synopsis": "Taking place in 1950s Japan, university professor Tatsuo Kusakabe and his two daughters, Satsuki and Mei are moving into an old house in the country to be closer to the hospital where their mother Yasuko is recovering from a long-term illness. While helping set up the house Satsuki and Mei find that the place is inhabited by tiny animated dust creatures called Soot Sprites - small, dark, dust-like house spirits seen when moving from light to dark places.  While the girls can see them, their father can't, however an elderly woman that takes care of the house (whom the girls can call Granny) tells them she used to see Soot sprits when she was their age.  She explains that they live in old empty house and cover the place with dirt, when a family moves into the house they move out and find a new home.  Soon they all get to work cleaning the house and unpacking.  Later on, Granny's grandson and their new neighbor Kanta comes by with a basket but acts shy around Satsuki.  When the girls become comfortable in their new house and laugh with their father, the soot spirits leave the house to drift away on the wind.  They are shown floating towards the Kamfore tree which is their true home. Soon they go to the hospital to visit their mom who is improving, the doctors say that she should be able to come home in 2 weeks. Satsuki tells her that their new house is haunted, and Mei was worried if she didn't want to come home because of this. The next day, Satsuki starts class at her new school with Mitchiko her new friend.  While Tatsuo grades papers at home Mei goes off exploring, soon she sees two white, rabbit-like ears in the grass and follows the ears under the house. She discovers two small magical creatures who lead her through a briar patch and into the hollow of a large camphor tree . She meets and befriends a larger version of the same kind of spirit, which identifies itself by a series of roars that she interprets as Totoro . She falls asleep atop the large Totoro, but w",
      "poster_url": "https://static.wikia.nocookie.net/studio-ghibli/images/f/f2/Totoro_Japan_Poster.png/revision/latest/scale-to-width-down/268?cb=20240714142323",
      "genres": [
        "Adventure",
        "Fantasy",
        "Romance"
      ],
      "characters": [
        {
          "name": "Satsuki Kusakabe",
          "url": "https://ghibli.fandom.com/wiki/Satsuki_Kusakabe",
          "description": "Satsuki Kusakabe Japanese name 草壁 サツキ ( Kusakabe Satsuki ) Species Human Age 10 years Gender Female First Appearance My Neighbor Totoro Second Appearance Mei and the Kittenbus Role Main character Voice actor (Japanese) Noriko Hidaka Voice actor (Streamline) Lisa Michelson Voice actor (Disney) Dakota Fanning",
          "appears_in": [
            "My Neighbor Totoro"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/f/f2/Satsuki_Kusakabe.jpg/revision/latest/scale-to-width-down/268?cb=20210215103238",
          "age": "10 years",
          "gender": "Female"
        },
        {
          "name": "Mei Kusakabe",
          "url": "https://ghibli.fandom.com/wiki/Mei_Kusakabe",
          "description": "Mei Kusakabe Japanese name 草壁 メイ ( Mei Kusakabe ) Species Human Age 4 years Gender Female First Appearance My Neighbor Totoro Second Appearance Mei and the Kittenbus Role Main character Voice actor (Japanese) Chika Sakamoto Voice actor (Streamline) Cheryl Chase Voice actor (Disney) Elle Fanning",
          "appears_in": [
            "My Neighbor Totoro"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/0/01/Mei_Kusakabe.jpg/revision/latest/scale-to-width-down/268?cb=20181012193530",
          "age": "4 years",
          "gender": "Female"
        },
        {
          "name": "Tatsuo Kusakabe",
          "url": "https://ghibli.fandom.com/wiki/Tatsuo_Kusakabe",
          "description": "Tatsuo Kusakabe Species Human Age 32 years Gender Male First Appearance My Neighbor Totoro Second Appearance Mei and the Kittenbus Voice actor (Japanese) Shigesato Itoi Voice actor (Streamline) Gregory Snegoff Voice actor (Disney) Tim Daly",
          "appears_in": [
            "My Neighbor Totoro"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/d/d6/Tatsuo_Kusakabe.jpg/revision/latest/scale-to-width-down/268?cb=20210215101114",
          "age": "32 years",
          "gender": "Male"
        },
        {
          "name": "Yasuko Kusakabe",
          "url": "https://ghibli.fandom.com/wiki/Yasuko_Kusakabe",
          "description": "Yasuko Kusakabe is a supporting character in My Neighbor Totoro . She is the mother of Satsuki and Mei Kusakabe and sister in law of satsuki and Mei's auntie, and the wife of Tatsuo Kusakabe . Presumably, she suffers from tuberculosis ; her sickness being the reason why she and her family moved to the rural country side. She was admitted to the local hospital which offered the best care for the illness, and the family decided it would be best for her to recuperate in a more fresh and sunny environment.",
          "appears_in": [
            "My Neighbor Totoro"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/7/7b/Yasuko_Kusakabe.png/revision/latest/scale-to-width-down/268?cb=20110705210532",
          "age": "29 years",
          "gender": "Female"
        },
        {
          "name": "Totoro",
          "url": "https://ghibli.fandom.com/wiki/Totoro",
          "description": "Big Totoro Japanese name 大トトロ ( Ō Totoro ) Species Totoro Tribe or Kodama (Tree Spirit) Age ~1,302 years or more than 3,000 years Gender Male First Appearance My Neighbor Totoro Second Appearance Mei and the Kittenbus Voice actor (Japanese) Hitoshi Takagi Voice actor (Disney) Frank Welker",
          "appears_in": [
            "My Neighbor Totoro"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/d/df/Totoro_in_the_rain.png/revision/latest/scale-to-width-down/268?cb=20200831205004",
          "age": "~1,302 years or more than 3,000 years",
          "gender": "Male"
        },
        {
          "name": "Catbus",
          "url": "https://ghibli.fandom.com/wiki/Catbus",
          "description": "Catbus Japanese name ネコバス ( Nekobasu ) Species Catbus First Appearance My Neighbor Totoro Second Appearance Mei and the Kittenbus Role Supporting character Voice actor (Japanese) Naoko Matsui Voice actor (Streamline) Carl Macek Voice actor (Disney) Frank Welker",
          "appears_in": [
            "My Neighbor Totoro"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/3/30/Catbus.jpg/revision/latest/scale-to-width-down/268?cb=20181024032653"
        },
        {
          "name": "Medium Totoro",
          "url": "https://ghibli.fandom.com/wiki/Smaller_Totoros",
          "description": "Smaller Totoros are kinds of Totoro in My Neighbor Totoro .",
          "appears_in": [
            "My Neighbor Totoro"
          ]
        },
        {
          "name": "Granny",
          "url": "https://ghibli.fandom.com/wiki/Granny",
          "description": "Not to be confused with Nanny . Granny Japanese name 祖母 ( sobo ) Species Human Gender Female First Appearance My Neighbor Totoro Role Supporting character Voice actor (Japanese) Tanie Kitabayashi Voice actor (Streamline) Natalie Core Voice actor (Disney) Pat Carroll",
          "appears_in": [
            "My Neighbor Totoro"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/d/d9/Granny.png/revision/latest/scale-to-width-down/268?cb=20180815142833",
          "gender": "Female"
        },
        {
          "name": "Kanta",
          "url": "https://ghibli.fandom.com/wiki/Kanta_%C5%8Cgaki",
          "description": "Kanta Japanese name 大垣寛太 ( Ōgaki Kanta ) Species Human Age 10 years Gender Male First Appearance My Neighbor Totoro Role Supporting character Voice actor (Japanese) Toshiyuki Amagasa Voice actor (Streamline) Kenneth Hartman Voice actor (Disney) Paul Butcher",
          "appears_in": [
            "My Neighbor Totoro"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/c/c3/Kanta.jpg/revision/latest?cb=20211030200118",
          "age": "10 years",
          "gender": "Male"
        }
      ]
    },
    {
      "title": "My Neighbors the Yamadas",
      "url": "https://ghibli.fandom.com/wiki/My_Neighbors_the_Yamadas",
      "release_year": 1999,
      "director": "Isao Takahata",
      "duration": "104 minutes",
      "description": "My Neighbors the Yamadas Kanji ホーホケキョとなりの山田くん Rōmaji Hōhokekyo Tonari no Yamada-kun Directed by Isao Takahata Produced by Toshio Suzuki Screenplay by Isao Takahata Based on \"Nono-chan\" by Hisaichi Ishii Narrated by David Ogden Stiers (English dub) Starring Hayato Isobata Masako Araki Naomi Uno Touru Masuoka Music by Akiko Yano Cinematography Atsushi Okui Editing by Takeshi Seyama Studio Studio Ghibli Production Tokuma Shoten Nippon Television Network Hakuhodo Buena Vista Japan/Buena Vista Home Entertainment Distributed by Shochiku Release date(s) July 17, 1999 Running time 104 minutes Budget ¥2 billion ($15.27 million) Box office ¥1.56 billion (US$11.91 million) Streaming Platform(s) Max My Neighbors the Yamadas (ホーホケキョとなりの山田くん , Hōhokekyo Tonari no Yamada-kun ) is the 11th animated film w",
      "synopsis": "This film is about the daily lives of the Yamada family: Takashi and Matsuko (the father and mother), Shige (Matsuko's mother), Noboru (aged approximately 13, the son), Nonoko (aged approximately 7, the daughter), and Pochi (the family dog). It has a significantly different \"feel\" to it than other Studio Ghibli films, not only because of its different style of animation, but also because it is not a contiguous plot, but rather a series of vignettes, each preceded by a title such as \"Father as Role Model\", \"A Family Torn Apart\" or \"Patriarchal Supremacy Restored\". These vignettes cover such issues as losing a child in a department store, the relationships between father and son, or husband and wife, the wisdom of age, getting one's first girlfriend and many more. Each is presented with humour, presenting a very believable picture of family life which crosses cultural boundaries. The relationships between Matsuko, Takashi and Shige are particularly well observed, with Shige giving advice and proverbs to all the family members and having a great strength of character which far outweighs Matsuko's. Takashi and Matsuko's the focus of the episodes, their rivalries, such as arguing about who has control of the television, their frustrations and their difficulties, but the overriding theme is their love for one another, despite their flaws, and their desire to be the best parents possible for their children.",
      "poster_url": "https://static.wikia.nocookie.net/studio-ghibli/images/d/db/My_Neighbors_the_Yamadas.jpg/revision/latest/scale-to-width-down/268?cb=20220212045851",
      "genres": [
        "Adventure",
        "Fantasy",
        "Romance"
      ],
      "characters": []
    },
    {
      "title": "Nausicaä of the Valley of the Wind",
      "url": "https://ghibli.fandom.com/wiki/Nausica%C3%A4_of_the_Valley_of_the_Wind",
      "release_year": 1985,
      "director": "Hayao Miyazaki",
      "duration": "117 minutes",
      "description": "Nausicaä of the Valley of the Wind Kanji 風の谷のナウシカ Rōmaji Kaze no Tani no Naushika Directed by Hayao Miyazaki Produced by Yasuyoshi Tokuma (Executive) Michitaka Kondo Isao Takahata Screenplay by Hayao Miyazaki Based on Nausicaä of the Valley of the Wind by Hayao Miyazaki Narrated by Hal Smith (1985 dub) Tony Jay (Disney dub) Starring Sumi Shimamoto Gorō Naya Yōji Matsuda Yoshiko Sakakibara Iemasa Kayumi Music by Joe Hisaishi Cinematography Koji Shiragami Yukitomo Shudo Yasuhiro Shimizu Mamoru Sugiura Editing by Tomoko Kida Naoko Kaneko Masatsugu Sakai Production TopCraft Hakuhodo Distributed by Toei Company Release date(s) March 11, 1984 Running time 117 minutes Budget ¥108 million Box office ¥1.48 billion (gross) ¥742 million (rentals) Streaming Platform(s) Max Nausicaä of the Valley of th",
      "synopsis": "One thousand years have passed since the Seven Days of Fire, an apocalyptic war which destroyed human civilization and most of the Earth's original ecosystem. Scattered human settlements survive, isolated from one another by the Sea of Decay. The Sea of Decay is a jungle of giant plants and fungi swarming with giant insects, which seem to come together only to wage war. Everything in the Sea of Decay, including the air, is lethally toxic.  Lord Yupa sword master and explorer has spent a year traveling to see if there are any cities left and sadly every village he has visited has been consumed by the toxic jungles or destroyed through war and fire. Meanwhile Nausicaä is the agile and cheerful young 16-year-old princess of the peaceful Valley of the Wind. Although a skillful fighter, Miyazaki's Nausicaä is humane and peace-loving. She has an unusual gift for communicating with the giant insects (particularly with the Ohmu , the gigantic, armored, caterpillar-like insects who are the most intelligent creatures in the Sea of Decay). She is also noted for her empathy toward animals, humans, and other beings. An intelligent girl, and inspired by the mentor figure Yupa, a wandering samurai type possessed of great wisdom, Nausicaä frequently explores the Sea of Decay and conducts scientific experiments in an attempt to define the true nature and origins of the toxic world in which she lives. Her explorations are facilitated by her skill at \"windriding\"; flying with an advanced glider-like craft with a jet assist called a möwe. Yupa is searching for the mythological man in blue who, according to the legend, will appear surrounded by a sea of gold and reunite the people and nature. One evening, an airship (a kind of large cargo airplane) from the kingdom of Tolmekia travels through the Valley, noticing it's off course Nausicaä tries to guide the ship, unfortunately the ship is attacked by insects.  Despite her warnings the ship crashes into the cliffs near the sea. Nausicaä t",
      "poster_url": "https://static.wikia.nocookie.net/studio-ghibli/images/e/ea/Nausicaa_Of_The_Valley_of_The_Wind.jpg/revision/latest/scale-to-width-down/268?cb=20211031174237",
      "genres": [
        "Adventure",
        "Fantasy",
        "Romance"
      ],
      "characters": []
    },
    {
      "title": "Ocean Waves",
      "url": "https://ghibli.fandom.com/wiki/Ocean_Waves",
      "release_year": 1993,
      "director": "Tomomi Mochizuki",
      "duration": "72 minutes",
      "description": "Ocean Waves Kanji 海がきこえる Rōmaji Umi ga Kikoeru Directed by Tomomi Mochizuki Produced by Nozomu Takahashi Toshio Suzuki Seiji Okuda Written by Kaori Nakamura Based on \"I Can Hear the Sea\" by Saeko Himuro Starring Nobuo Tobita Toshihiko Seki Youko Sakamoto Music by Shigeru Nagata Art Directed by Naoya Tanaka Editing by Takeshi Seyama Studio Studio Ghibli Production Tokuma Shoten Nippon Television Network Distributed by Nippon TV Release date(s) May 5, 1993 Running time 72 minutes Streaming Platform(s) Max Ocean Waves ( 海がきこえる , Umi ga Kikoeru , lit. \"I Can Hear the Sea\") is an anime television film directed by Tomomi Mochizuki and written by Kaori Nakamura. It was animated by Studio Ghibli for Tokuma Shoten and the Nippon Television Network and premiered as part of the network's 40th anniver",
      "synopsis": "At Kichijōji Station, Tokyo, Taku Morisaki glimpses a familiar woman on the platform opposite. Later, as his flight to Kōchi Prefecture takes off, he narrates the events that brought her into his life. The story is told in flashback. In Kōchi, two years prior, Taku receives a call from his friend, Yutaka Matsuno, asking to meet at their high school. He finds Yutaka at a window, watching an attractive female transfer student whom Yutaka was asked to show around. The boys discuss their upcoming school trip to Hawaii. At the school gates, Taku is introduced to the new girl, Rikako Muto. She thanks Yutaka for providing directions to a bookstore. Taku teases Yutaka about his infatuation. Rikako is academically gifted and good at sports, but also arrogant. Taku believes she is unhappy about leaving Tokyo. His mother learns from gossip that a divorce brought Rikako's mother to Kōchi. In a phone conversation with Yutaka, he discovers that Rikako is living away from the family house. The school year ends, heralding the Hawaii trip. Taku, suffering from an upset stomach, is stopped in the hotel lobby by Rikako. She explains that she has lost her money and asks to borrow some. As Taku has a part-time job, he lends her ¥60,000. Promising to repay him, she warns not to tell anyone. As she departs, Taku sees a stern Yutaka and feels compelled to explain. Later, Rikako admonishes him for telling Yutaka about the money, saying that he also loaned her ¥20,000. Back in Kōchi, the third year begins with Rikako making a friend, Yumi Kohama. Rikako hasn't returned Taku's money and he wonders if she has forgotten. Out of the blue, a distressed Yumi calls Taku, explaining that Rikako had tricked her into coming to the airport on the pretence of a concert trip, only to discover that their real destination is Tokyo, tickets paid for with Taku's money. He races to the airport, sending Yumi home, saying that he will accompany Rikako. Upon arrival, it appears that Rikako has not forewarned her",
      "poster_url": "https://static.wikia.nocookie.net/studio-ghibli/images/e/e1/Ocean_Waves_English.jpg/revision/latest/scale-to-width-down/268?cb=20220409211616",
      "genres": [
        "Adventure",
        "Fantasy",
        "Romance"
      ],
      "characters": [
        {
          "name": "Taku Morisaki",
          "url": "https://ghibli.fandom.com/wiki/Taku_Morisaki",
          "description": "Taku has dark brown hair and brown eyes. He wears a white shirt and green tie as part of the Japanese school uniform. During the school year, he wears a light pink shirt and white T-shirt and blue",
          "appears_in": [
            "Ocean Waves"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/7/73/Taku.png/revision/latest/scale-to-width-down/268?cb=20120102013114",
          "age": "16-18",
          "gender": "Male"
        },
        {
          "name": "Rikako Muto",
          "url": "https://ghibli.fandom.com/wiki/Rikako_Muto",
          "description": "Rikako Muto ( 武藤 里伽子 , Mutō Rikako ) is the main character of Ocean Waves film.",
          "appears_in": [
            "Ocean Waves"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/5/59/Rikako.jpg/revision/latest/scale-to-width-down/268?cb=20181029025300",
          "age": "16 years - 18 years",
          "gender": "Female"
        },
        {
          "name": "Yutaka Matsuno",
          "url": "https://ghibli.fandom.com/wiki/Yutaka_Matsuno",
          "description": "Yutaka Matsuno is a friend of Taku Morisaki in Ocean Waves .",
          "appears_in": [
            "Ocean Waves"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/f/f9/Yutaka.jpg/revision/latest?cb=20181024033800",
          "age": "16-18",
          "gender": "Male"
        },
        {
          "name": "Yumi Kohama",
          "url": "https://ghibli.fandom.com/wiki/Yumi_Kohama",
          "description": "Yumi Kohama (小浜 裕実, Kohama Yumi ) is a minor character of Ocean Waves film. She is a closest friend of Rikako Muto .",
          "appears_in": [
            "Ocean Waves"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/e/ed/Yumi.jpg/revision/latest/scale-to-width-down/268?cb=20181031014446",
          "age": "12 or 13",
          "gender": "Female"
        },
        {
          "name": "Akiko Shimizu",
          "url": "https://ghibli.fandom.com/wiki/Akiko_Shimizu",
          "description": "Akiko Shimizu (清水 明子, Shimizu Akiko ) is a supporting character in Ocean Waves . She is Taku Morisaki 's classmate.",
          "appears_in": [
            "Ocean Waves"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/7/7c/Shimizu_Akiko.png/revision/latest/scale-to-width-down/268?cb=20181030025046",
          "age": "16 years (Born March 27th)",
          "gender": "Female"
        },
        {
          "name": "Okada",
          "url": "https://ghibli.fandom.com/wiki/Okada",
          "description": "Okada (岡田) is a character from Ocean Waves . He is the ex-boyfriend of Rikako Muto .",
          "appears_in": [
            "Ocean Waves"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/2/25/Okada.jpg/revision/latest/scale-to-width-down/268?cb=20181209095752",
          "gender": "Male"
        },
        {
          "name": "Tadashi Yamao",
          "url": "https://ghibli.fandom.com/wiki/Tadashi_Yamao",
          "description": "Tadashi Yamao is a character in Studio Ghibli's Television film Ocean Waves . He is friend of Taku and Yutaka .",
          "appears_in": [
            "Ocean Waves"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/2/28/Yamao.png/revision/latest/scale-to-width-down/268?cb=20181031000851",
          "gender": "Male"
        }
      ]
    },
    {
      "title": "Only Yesterday",
      "url": "https://ghibli.fandom.com/wiki/Only_Yesterday",
      "release_year": 1991,
      "director": "Isao Takahata",
      "duration": "118 minutes",
      "description": "Only Yesterday Kanji おもひでぽろぽろ Rōmaji Omohide Poro Poro Directed by Isao Takahata Produced by Toshio Suzuki Screenplay by Isao Takahata Based on Omoide Poro Poro by Hotaru Okamoto & Yuko Tone Starring Miki Imai Toshirō Yanagiba Yōko Honna Music by Katz Hoshi Cinematography Hisao Shiraishi Editing by Takeshi Seyama Studio Studio Ghibli Production Tokuma Shoten Nippon Television Network Hakuhodo Distributed by Toho Release date(s) July 20, 1991 Running time 118 minutes Box office ¥1.87 billion Streaming Platform(s) Max Only Yesterday (おもひでぽろぽろ , Omohide Poro Poro , Memories Come Tumbling Down ) is a 1991 Japanese animated drama film written and directed by Isao Takahata . It was animated by Studio Ghibli for Tokuma Shoten , Nippon Television Network and Hakuhodo , and distributed by Toho . It",
      "synopsis": "In 1982, Taeko is 27 years old, unmarried, has lived her whole life in Tokyo and now works at a company there. She decides to take another trip to visit the family of the elder brother of her brother-in-law in the rural countryside to help with the safflower harvest and get away from city life. While traveling at night on a sleeper train to Yamagata, she begins to recall memories of herself as a schoolgirl in 1966, and her intense desire to go on holiday like her classmates, all of whom have family outside of the big city. At the arrival train station, she is surprised to find out that her brother in law's second cousin Toshio, whom she barely knows, is the one who came to pick her up. During her stay in Yamagata, she finds herself increasingly nostalgic and wistful for her childhood self, while simultaneously wrestling with adult issues of career and love. The trip dredges up forgotten memories (not all of them good ones) — the first stirrings of childish romance, puberty and growing up, the frustrations of math and boys. In lyrical switches between the present and the past, Taeko wonders if she has been true to the dreams of her childhood self. In doing so, she begins to realize that Toshio has helped her along the way. Finally, Taeko faces her own true self, how she views the world and the people around her. Taeko chooses to stay in the countryside instead of returning to Tokyo. It is implied that she and Toshio begin a relationship.",
      "poster_url": "https://static.wikia.nocookie.net/studio-ghibli/images/a/a9/Only_Yesterday.jpg/revision/latest/scale-to-width-down/268?cb=20220212045636",
      "genres": [
        "Adventure",
        "Fantasy",
        "Romance"
      ],
      "characters": []
    },
    {
      "title": "Panda! Go, Panda!",
      "url": "https://ghibli.fandom.com/wiki/Panda!_Go,_Panda!",
      "release_year": 1972,
      "director": "Isao Takahata",
      "duration": "34 minutes",
      "description": "Panda! Go, Panda! First Sequel DVD Kanji パンダ・コパンダ Rōmaji Panda Kopanda Directed by Isao Takahata Screenplay by Hayao Miyazaki Music by Masahiko Sato Editing by Kazuo Inoue Production Tokyo Movie Distributed by Toho Release date(s) December 17, 1972 Running time 34 minutes Panda! Go, Panda! (パンダ・コパンダ , Panda Kopanda lit. Panda, Baby Panda ) is an animated film that premiered on December 17, 1972. It was written and created by Hayao Miyazaki and directed by Isao Takahata for TMS Entertainment (formerly Tokyo Movie), predating Studio Ghibli . It was followed by a sequel, Panda! Go, Panda! Rainy Day Circus (1973).",
      "synopsis": "The plot follows Mimiko , a bright little girl left alone when her grandmother leaves on a trip, which, according to the grandmother, is Mimiko's grandfather's memorial service. After making a few stops at some local stores, Mimiko comes home to her house in a bamboo grove and finds a baby panda named Panny sleeping on the back doorstep. She quickly makes friends with the little panda, and invites him in for a drink. His father, Papa Panda , soon comes to visit, and they decide to become a family after Papa Panda offers to be Mimiko's father (Mimiko never had any parents). The three adjust to life together during their first night together, while Mimiko writes the first of many letters to her grandma (who she promised to write to every day). The next day, Mimiko goes to school, reluctantly allowing Panny to tag along (even though she told him to stay home). In a close call, Panny ends up getting all of Mimiko's school (save for Mimiko) chasing after him. The next day, Mimiko gets an unexpected visit from a local policeman, who came to check on her. Expectedly, he freaks out after seeing Papa Panda. He goes to notify the local zoo staff, who invites the zookeeper (who lost Papa Panda and Panny after they broke out of the zoo). The zookeeper demands the safe return of his pandas, so he joins the police and zoo staff in the search. Meanwhile, Mimiko and her family go out on a walk and, after scaring off some local bullies, they inadvertently lose Panny after he rolls down a hill. Mimiko and Papa Panda go searching for him, eventually gaining help from local police and the zookeeper in the search. They find Panny floating on a piece of wood, heading towards an open floodgate and hurry to save him. The handle, however, has rusted, leaving Panny in a dangerous situation. Mimiko comes very close to falling into dangerous waters after she jumps down to save Panny from death, but Papa Panda saves both of them by closing the floodgate. Mimiko, alongside Panny, Papa Panda, the",
      "poster_url": "https://static.wikia.nocookie.net/studio-ghibli/images/9/9a/Panda1.webp/revision/latest/scale-to-width-down/268?cb=20201016070521",
      "genres": [
        "Adventure",
        "Fantasy",
        "Drama"
      ],
      "characters": []
    },
    {
      "title": "Pom Poko",
      "url": "https://ghibli.fandom.com/wiki/Pom_Poko",
      "release_year": 1994,
      "director": "Isao Takahata",
      "duration": "119 minutes",
      "description": "Pom Poko Kanji 平成狸合戦ぽんぽこ Rōmaji Heisei Tanuki Gassen Ponpoko Directed by Isao Takahata Produced by Toshio Suzuki Written by Isao Takahata Narrated by Shincho Kokontei (Japanese) Maurice LaMarche (English) Starring Kokontei Shinchou Makoto Nonomura Yuriko Ishida Music by Shang Shang Typhoon Cinematography Atsushi Okui Editing by Takeshi Seyama Studio Studio Ghibli Production Tokuma Shoten Nippon Television Network Hakuhodo Distributed by Toho Release date(s) July 16, 1994 Running time 119 minutes Box office ¥4.47 billion ($26.3 million) Streaming Platform(s) Max Pom Poko (平成狸合戦ぽんぽこ, Heisei Tanuki Gassen Ponpoko? , lit. Heisei-era Raccoon Dog War Pom Poko , also known as The Raccoon War ) is an animated comedy-drama film animated by Studio Ghibli for Tokuma Shoten , Nippon Television Network",
      "synopsis": "The story begins in late 1960s Japan. Back when much of the land was farms and forest raccoons lived peacefully and even had an abandoned farmhouse for a home, unknown to humans raccoons cannot only walk on two paws but can shapeshifter as well.  However some developers destroyed the farmhouse and the next year the raccoons became aggressive and hostile especially over food and territory.  One night two groups of raccoons from two mountains began to fight but at the urging of the matriarch Oroku who speaks through chanting; both sides will lose even if one wins, she then tells them while they were fighting the forest shrank, and they must keep their families small.  Hearing this the group of tanuki see what has become of their forests, Oroku tells them they should not be fighting each other.  After this and a warning of what will happen they decide to unify to stop the development.  During the 1960's the demand for housing had started to increase due to the development project called New Tama, in the Tama Hills on the outskirts of Tokyo . The development is cutting into their forest habitat and dividing their land. The story resumes in early 1990s Japan, during the early years of the Heisei era. Several tanuki lead the resistance, including the aggressive chief Gonta, the old guru Seizaemon, the wise-woman Oroku, and the young and resourceful Shoukichi.  All the nearby raccoons came to a meeting at an abandoned temple in the mountains.  At the meeting it was decided they must stop the development project.  At a private meeting of the elders they developed a five year plan which included teaching the art of transformation and traveling to the islands of Sado and Shikoku where the masters of transformation reside.  Due to the journey none of the elders wanted to go, so it's decided that they will train the young ones and when they are old enough will go.  They soon find an abandoned tv, setting it up in the temple to study humans, but the raccoons becomes so intereste",
      "poster_url": "https://static.wikia.nocookie.net/studio-ghibli/images/7/77/Pom_Poko.png/revision/latest/scale-to-width-down/268?cb=20210708010255",
      "genres": [
        "Adventure",
        "Fantasy",
        "Romance"
      ],
      "characters": []
    },
    {
      "title": "Ponyo",
      "url": "https://ghibli.fandom.com/wiki/Ponyo",
      "release_year": 2008,
      "director": "Hayao Miyazaki",
      "duration": "103 minutes",
      "description": "Ponyo JP US Kanji 崖の上のポニョ Rōmaji Gake no Ue no Ponyo Directed by Hayao Miyazaki Produced by Toshio Suzuki Written by Hayao Miyazaki and Reiko Yoshida Starring Tomoko Yamaguchi Kazushige Nagashima Yūki Amami George Tokoro Yuria Nara Hiroki Doi Rumi Hiiragi Akiko Yano Kazuko Yoshiyuki Tomoko Naraoka Music by Joe Hisaishi Cinematography Atsushi Okui Editing by Takeshi Seyama Studio Studio Ghibli Production Nippon Television Network Dentsu Hakuhodo DYMP Walt Disney Japan/Walt Disney Studios Home Entertainment Mitsubishi Toho Distributed by Toho Release date(s) July 19, 2008 Running time 103 minutes Budget ¥3.4 billion (US$34 million) Box office ¥15.5 billion US$201.8 million (worldwide) Streaming Platform(s) Max Ponyo ( 崖の上のポニョ , Gake no Ue no Ponyo ) , released in Japan as Ponyo on the Cliff ",
      "synopsis": "The plot centers on a goldfish named Brunhilde and a boy named Sōsuke who renames her Ponyo . Fujimoto , a once-human wizard/scientist, lives underwater along with his daughter, Brunhilde, and her numerous smaller sisters. While she and her siblings are on an outing with their father in his four-flippered submarine, Brunhilde sneaks off and floats away on the back of a jellyfish. After an encounter with a fishing trawler, she drifts to the shore of a small fishing town in a glass jar where she is rescued by a five-year-old boy named Sōsuke. Shattering the jar open with a rock, Sōsuke cuts his finger in the process. Brunhilde licks his wound causing it to heal almost instantly. Meanwhile, Fujimoto is looking for her and his waves tell him, he believes she has been kidnapped. Sōsuke puts the fish in a green pail and fills it with water, she likes it. Fujimoto using a water canister sprays water so he can walk on land. Sōsuke's mother Lisa thinks it's weed killer but Fujimoto tells her that it's ocean water. Lisa drives away before he can say anything else. While driving Lisa comments on how pretty the fish looks. Sōsuke names her Ponyo and promises to protect her, even offering her some of his sandwich, while she turns down the bread, she devours the ham. Meanwhile, a distraught Fujimoto searches frantically for his lost daughter but gets caught by all the waste in the ocean. Sōsuke tries to show off Ponyo to Kumiko, one of his friends, but she disapproves and calls Ponyo boring and for that she gets water on her new dress. Two people at the senior home where Lisa works do like Ponyo but Toki does not and also gets sprayed. Scared he runs and hides and during this Ponyo speaks to him which amazes him.  Fujimoto soon finds them and calls his wave spirits to recover her which they do so by cornering Sōsuke, leaving him heartbroken. On the way home, Lisa tells him that while he did try to take care of Ponyo, having her live in a bucket was not a good idea and the ocean i",
      "poster_url": "https://static.wikia.nocookie.net/studio-ghibli/images/0/01/Ponyo_Japan_Poster.png/revision/latest/scale-to-width-down/268?cb=20240608125339",
      "genres": [
        "Adventure",
        "Fantasy",
        "Romance"
      ],
      "characters": [
        {
          "name": "Ponyo",
          "url": "https://ghibli.fandom.com/wiki/Ponyo_(character)",
          "description": "Ponyo (ポニョ , Ponyo ), named Brunhilde (ブリュンヒルデ, Bryun-Hirude ) at birth, is the 5-year old protagonist of the film, Ponyo . She is a goldfish born from the sea goddess mother Granmamare and a human named father Fujimoto . She is known to liked both Sōsuke and ham.",
          "appears_in": [
            "Ponyo"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/b/bc/Brunhilda.png/revision/latest/scale-to-width-down/268?cb=20201016144049",
          "age": "5 years",
          "gender": "Female"
        },
        {
          "name": "Sôsuke",
          "url": "https://ghibli.fandom.com/wiki/Sosuke",
          "description": "This article is about a character from Ponyo . For information about the Pom Poko character with a similar name, see Sasuke . And My Neighbor Totoro character: Satsuki",
          "appears_in": [
            "Ponyo"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/c/cf/Sosuke.jpg/revision/latest/scale-to-width-down/268?cb=20181017002729",
          "age": "5 years",
          "gender": "Male"
        },
        {
          "name": "Lisa",
          "url": "https://ghibli.fandom.com/wiki/Lisa",
          "description": "Lisa Japanese name Risa ( Risa ) Species Human Age 25 years Gender Female First Appearance Ponyo on the Cliff by the Sea Role Supporting character Voice actor (Japanese) Tomoko Yamaguchi Voice actor (Disney) Tina Fey",
          "appears_in": [
            "Ponyo"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/5/59/Lisa.png/revision/latest/scale-to-width-down/268?cb=20110709024926",
          "age": "25 years",
          "gender": "Female"
        },
        {
          "name": "Koichi",
          "url": "https://ghibli.fandom.com/wiki/Koichi",
          "description": null,
          "appears_in": [
            "Ponyo"
          ]
        },
        {
          "name": "Fujimoto",
          "url": "https://ghibli.fandom.com/wiki/Fujimoto",
          "description": "Fujimoto Species Human (formerly) Wizard Age At least 40 years Gender Male First Appearance Ponyo on the Cliff by the Sea Role Sea Wizard Voice actor (Japanese) Joji Tokoro Voice actor (Disney) Liam Neeson",
          "appears_in": [
            "Ponyo"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/4/4b/Fujimoto.jpg/revision/latest/scale-to-width-down/268?cb=20181017020509",
          "age": "At least 40 years",
          "gender": "Male"
        },
        {
          "name": "Granmamare",
          "url": "https://ghibli.fandom.com/wiki/Granmamare",
          "description": "Granmammare Japanese name グランマンマーレ ( Granmammare ) Species Deity Goddess Age 600 years Immortal Gender Female First Appearance Ponyo Role Supporting character Voice actor (Japanese) Yuki Amami Voice actor (Disney) Cate Blanchett",
          "appears_in": [
            "Ponyo"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/4/43/Granmammare.png/revision/latest/scale-to-width-down/268?cb=20181029034955",
          "age": "600 years Immortal",
          "gender": "Female"
        },
        {
          "name": "Yoshie",
          "url": "https://ghibli.fandom.com/wiki/Yoshie",
          "description": "Yoshie (ヨシエ , Yoshie ) is one of the Senior Center inhabitants in the film, Ponyo .",
          "appears_in": [
            "Ponyo"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/3/3f/Yoshie.jpg/revision/latest/scale-to-width-down/268?cb=20181030230031",
          "age": "68 years",
          "gender": "Female"
        },
        {
          "name": "Noriko",
          "url": "https://ghibli.fandom.com/wiki/Noriko",
          "description": "Noriko is one of old aunts on the 2008 film, Ponyo . She lives on Senior Local Center, where Lisa works.",
          "appears_in": [
            "Ponyo"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/3/34/Noriko.jpg/revision/latest?cb=20181024003358",
          "age": "70 years",
          "gender": "Female"
        },
        {
          "name": "Toki",
          "url": "https://ghibli.fandom.com/wiki/Toki_(Ponyo)",
          "description": "Toki (トキ , Toki ) is an elderly woman from Ponyo . She lives in the Local Senior Center along with Noriko and Yoshie .",
          "appears_in": [
            "Ponyo"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/9/94/Toki.jpg/revision/latest/scale-to-width-down/268?cb=20181023134956",
          "age": "72 years",
          "gender": "Female"
        }
      ]
    },
    {
      "title": "Porco Rosso",
      "url": "https://ghibli.fandom.com/wiki/Porco_Rosso",
      "release_year": 1992,
      "director": "Hayao Miyazaki",
      "duration": "93 minutes",
      "description": "Porco Rosso Japanese release poster Kanji 紅の豚 Rōmaji Kurenai no Buta Directed by Hayao Miyazaki Produced by Yasuyoshi Tokuma (Executive) Matsuo Toshimitsu Yoshio Sasaki Toshio Suzuki Screenplay by Hayao Miyazaki Based on \"Hikōtei Jidai\" by Hayao Miyazaki Narrated by Kimberly Williams-Paisley (English) Starring Shūichirō Moriyama Tokiko Kato Akemi Okamura Akio Ōtsuka Music by Joe Hisaishi Cinematography Atsushi Okui Editing by Takeshi Seyama Studio Studio Ghibli Production Tokuma Shoten Japan Airlines Nippon Television Network Distributed by Toho Release date(s) July 18, 1992 Running time 93 minutes Budget $9.2 million Box office ¥2.8 billion Streaming Platform(s) Max",
      "synopsis": "The film, set in the Adriatic Sea in the interwar period, begins with the titular character Porco Rosso , a veteran World War I fighter ace and freelance bounty hunter, responding to an alert over an attack on a ferry liner by airborne pirates. Having successfully defeated the pirates, the so-called Mamma Aiuto , Porco retires to the Hotel Adriano , which is run by his long-time friend Madame Gina . Two reporters come over to Porco and photograph him and try to interview him on the spot, but their loud questions earn them the ire of an American named Mr. Curtis, who physically removes the reporters so he can concentrate on Gina without noise. Gina's music is able to soothe even the savage hearts of the pirates. At the restaurant, Curtis proposes to Gina, but she rebuffs him. Porco goes off to eat alone, but shortly Gina sits and talks to him. As it turns out, Curtis asked her to marry him but she refused as all three of her previous husbands were pilots as well but all three of them were killed (she even got word about her recent husband's death).  Gina admits that she had spent so long crying that she has now run out of tears.  There's a photo of several pilots and Gina on the wall, dated 1912 which Porco hates. Gina says she loves that picture but still can't believe he  scribbled out his own head.  Gina wishes that there was some way to break his curse but he says that's he a pig and that's that. The next day Porco goes into town to collect some cash and pay off his sea plane, he even goes to pick up his new bullets for the plane.  Meanwhile all the air pirates team up and attack a cruise vessel to draw out Porco even leaving him a warning message but he doesn't fall for it.  After Porco Rosso leaves to Milan, to make repairs to his plane, he is shot down by Curtis, who wants to achieve fame by killing Rosso. Rosso survives but has to head to Milan on train, he calls Gina who is worried about him.  He tells Gina he is back in the country to get his plane fixed, G",
      "poster_url": "https://static.wikia.nocookie.net/studio-ghibli/images/4/41/Porco_Rosso.jpg/revision/latest/scale-to-width-down/268?cb=20220212051521",
      "genres": [
        "Adventure",
        "Fantasy",
        "Romance"
      ],
      "characters": [
        {
          "name": "Porco Rosso / Marco Pagot",
          "url": "https://ghibli.fandom.com/wiki/Marco_Pagot",
          "description": "Marco Pagot Species Human (formerly) Pig Age 37 years Gender Male First Appearance Porco Rosso Role Main character Voice actor (Japanese) Shuichiro Moriyama Voice actor (English) Ward Sexton Voice actor (Disney) Michael Keaton",
          "appears_in": [
            "Porco Rosso"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/0/02/Porcellino%21.png/revision/latest/scale-to-width-down/268?cb=20200915124341",
          "age": "37 years",
          "gender": "Male"
        },
        {
          "name": "Madame Gina",
          "url": "https://ghibli.fandom.com/wiki/Gina",
          "description": "Gina Japanese name ジーナ ( Gina ) Species Human Age circa 23 years - 35 years Gender Female First Appearance Porco Rosso Role Supporting character Voice actor (Japanese) Tokiko Kato Voice actor (English) Faith Bach Voice actor (Disney) Susan Egan",
          "appears_in": [
            "Porco Rosso"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/e/eb/Gina.jpg/revision/latest?cb=20210311172727",
          "age": "circa 23 years - 35 years",
          "gender": "Female"
        },
        {
          "name": "Fio Piccolo",
          "url": "https://ghibli.fandom.com/wiki/Fio_Piccolo",
          "description": "Fio Piccolo Japanese name フィオ・ピッコロ ( Fio Pikkoro ) Species Human Age 17 years Gender Female First Appearance Porco Rosso Role Main character Voice actor (Japanese) Akemi Okamura Voice actor (English) Lynn Eve Harris Voice actor (Disney) Kimberly Williams-Paisley",
          "appears_in": [
            "Porco Rosso"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/c/c2/Fio_Piccolo.jpg/revision/latest?cb=20210311172537",
          "age": "17 years",
          "gender": "Female"
        },
        {
          "name": "Grandpa Piccolo",
          "url": "https://ghibli.fandom.com/wiki/Mr._Piccolo",
          "description": "Mr. Piccolo (ピッコロのおやじ , Pikkoro no Ooyaji ) is the grandfather of Fio Piccolo and Porco Rosso's personal mechanic in the film Porco Rosso . He first appeared on The Age of the Flying Boat .",
          "appears_in": [
            "Porco Rosso"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/0/0e/Mr_Piccolo.jpg/revision/latest/scale-to-width-down/268?cb=20181009193523",
          "gender": "Male"
        },
        {
          "name": "Capo/\"Boss\"",
          "url": "https://ghibli.fandom.com/wiki/Capo",
          "description": "Capo , often referred to as Boss (マンマユート・ボス , Manmayūto Bosu ), is a character in Porco Rosso . He is the leader of the Mamma Aiuto , an air pirate group known throughout the Adriatic Sea. He first appeared in The Age of the Flying Boat .",
          "appears_in": [
            "Porco Rosso"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/9/98/Aiuto_Gang_boss.jpg/revision/latest/scale-to-width-down/268?cb=20181009193659",
          "gender": "Male"
        },
        {
          "name": "Donald Curtis",
          "url": "https://ghibli.fandom.com/wiki/Donald_Curtis",
          "description": "Donald Curtis Japanese name ドナルド・カーチス ( Donald Curtis ) Species Human Age 35 years Gender Male First Appearance Porco Rosso Role Main character Voice actor (Japanese) Akio Otsuka Voice actor (English) Greg Dale Voice actor (Disney) Cary Elwes",
          "appears_in": [
            "Porco Rosso"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/6/61/Donald_Curtis.jpg/revision/latest/scale-to-width-down/268?cb=20210311172933",
          "age": "35 years",
          "gender": "Male"
        }
      ]
    },
    {
      "title": "Princess Mononoke",
      "url": "https://ghibli.fandom.com/wiki/Princess_Mononoke",
      "release_year": 1997,
      "director": "Hayao Miyazaki",
      "duration": "134 minutes",
      "description": "Princess Mononoke JP US Kanji もののけ姫 Rōmaji Mononoke-hime Directed by Hayao Miyazaki Produced by Toshio Suzuki Yasuyoshi Tokuma Written by Hayao Miyazaki Narrated by Keith David (English) Starring Yōji Matsuda Yuriko Ishida Yūko Tanaka Kaoru Kobayashi Masahiko Nishimura Tsunehiko Kamijo Akihiro Miwa Mitsuko Mori Hisaya Morishige Music by Joe Hisaishi Cinematography Atsushi Okui Editing by Takeshi Seyama Studio Studio Ghibli Production Tokuma Shoten Nippon Television Network Dentsu Distributed by Toho Release date(s) July 12, 1997 Running time 134 minutes Budget ¥2.1 billion ($23.5 million) Box office ¥19.3 billion Streaming Platform(s) Max Princess Mononoke (もののけ姫 , Mononoke Hime ) is the 10th feature-length animated film written and directed by Hayao Miyazaki and animated by Studio Ghibli ",
      "synopsis": "Princess Mononoke follows the journey of the last Emishi prince, Ashitaka , and his attempts to make peace between the human settlement, Irontown , and the creatures living in the forest that surrounds it. The film begins with Ashitaka riding on his red elk to warn three girls to return to the village as per the wise woman's orders.  Ashitaka then heads to the lookout tower where Ji tells Ashitaka something is in the forest, seconds later a demon who is actually the giant boar god Nago embodied by rage comes out of the forest.  He ends up saving his village from a vicious assault by killing the demon. During the fight, Ashitaka receives a demon mark on his right arm, and he is cursed by the Boar God's hatred and pain. Ashitaka is told that the mark will spread throughout his body, killing him. A ball of iron is found inside Nago's corpse, which is somehow connected to the curse.  The Wise Woman says that Ashitaka will have to leave the village forever, this upsets three of the men present especially since Ashitaka risked his life to save them but one man quietly points out that they are the last of the Emishi people and now their last prince must be exiled from their land, never to come back. Ashitaka resolves to journey to Nago's origin, the lands to the West, to try and find a cure for his curse. He cuts his hair, signifying his permanent departure from his village, and rides out with Yakul , his loyal red elk. Since it was considered taboo to see off one who is banished, only one person dared to say goodbye to Ashitaka: his 'little sister,' Kaya (according to Miyazaki, actually his bride-to-be; calling herself his 'little sister' was a term of affection), who gives him her crystal dagger so that he would not forget her. Having traveled some distance, Ashitaka soon ends up in the middle of a Samurai attack.  He is spotted and tries to escape but is chased.  Left with not much of a choice, Ashitaka fires his bow and arrow, this causes his cursed arm to react and ca",
      "poster_url": "https://static.wikia.nocookie.net/studio-ghibli/images/4/4e/Mononoke_JP_Poster.png/revision/latest/scale-to-width-down/268?cb=20240713213125",
      "genres": [
        "Adventure",
        "Fantasy",
        "Romance"
      ],
      "characters": [
        {
          "name": "Ashitaka",
          "url": "https://ghibli.fandom.com/wiki/Ashitaka",
          "description": "Ashitaka Japanese name アシタカ ( Ashitaka ) Species Human Age 17 years [ 1 ] Gender Male First Appearance Princess Mononoke Role Main character Voice actor (Japanese) Yoji Matsuda Voice actor (Disney) Billy Crudup",
          "appears_in": [
            "Princess Mononoke"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/4/49/Ashitaka.jpg/revision/latest/scale-to-width-down/268?cb=20220118140313",
          "age": "17 years [ 1 ]",
          "gender": "Male"
        },
        {
          "name": "San",
          "url": "https://ghibli.fandom.com/wiki/San",
          "description": "San (サン), otherwise known as Princess Mononoke (もののけ姫, \"Mononoke hime\") or the \" Wolf Girl / Princess \", is the titular deuteragonist in Princess Mononoke . She acts, misbehaves, and resembles a wolf due to the fact that she was raised by wolves themselves.\nSan is the Princess of the Wolf Gods.",
          "appears_in": [
            "Princess Mononoke"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/3/3f/San.jpg/revision/latest/scale-to-width-down/268?cb=20210214204849",
          "age": "Unknown  (circa 15 years -17 years)",
          "gender": "Female"
        },
        {
          "name": "Shishigami",
          "url": "https://ghibli.fandom.com/wiki/Forest_Spirit",
          "description": "Forest Spirit Forest Spirit Night-Walker Japanese name シシ神 / デイダラボッチ ( Shishi Gami / Deidarabotchi ) Species God of life and death Gender Unknown, possibly genderless First Appearance Princess Mononoke Role Supporting character",
          "appears_in": [
            "Princess Mononoke"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/b/b7/Forest_Spirit.jpg/revision/latest/scale-to-width-down/268?cb=20181031022208",
          "gender": "Unknown, possibly genderless"
        },
        {
          "name": "Okkoto-nushi",
          "url": "https://ghibli.fandom.com/wiki/Okkoto",
          "description": "Okkoto (乙事主 Okkoto-Nushi) is a character from Princess Mononoke . Okkoto has the ability to see the past by sniffing someone's arm, as he did so on Ashitaka's arm to see Nago 's death.",
          "appears_in": [
            "Princess Mononoke"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/e/e2/Okkoto.png/revision/latest/scale-to-width-down/268?cb=20181011142155",
          "age": "500 years",
          "gender": "Male"
        },
        {
          "name": "Moro",
          "url": "https://ghibli.fandom.com/wiki/Moro",
          "description": "Moro (モロの君 Moro no Kimi ) is supporting character of Princess Mononoke film. She is the three-hundred years old goddess of the wolves who possesses divine power and intelligence, as well as being capable of understanding and speaking human languages. Moro is very wise and is keen to the tricks of mankind. She is a stoic and strong character who knows the evil intentions of humans. She is the leader of the wolf tribe and a loving mother. Moro comes across as threatening towards Ashitaka, but understands his deep affection for San.",
          "appears_in": [
            "Princess Mononoke"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/5/5e/Moro.png/revision/latest/scale-to-width-down/268?cb=20110702021519",
          "age": "300 years (deceased)",
          "gender": "Female"
        },
        {
          "name": "Kodama",
          "url": "https://ghibli.fandom.com/wiki/Kodama",
          "description": "Species Name Kodama Japanese notation 木霊, 木魂 or 木魅 ( Kodama ) ⓵ Appearance Princess Mononoke",
          "appears_in": [
            "Princess Mononoke"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/3/32/Kodama_Animation.gif/revision/latest/scale-to-width-down/268?cb=20210306212342"
        },
        {
          "name": "Lady Eboshi",
          "url": "https://ghibli.fandom.com/wiki/Lady_Eboshi",
          "description": "Lady Eboshi (エボシ御前, Eboshi Gozen ) is one of the villains of Princess Mononoke .",
          "appears_in": [
            "Princess Mononoke"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/5/53/Eboshi.jpg/revision/latest/scale-to-width-down/268?cb=20220118140456",
          "gender": "Female"
        },
        {
          "name": "Gonza",
          "url": "https://ghibli.fandom.com/wiki/Gonza",
          "description": "Gonza is the henchman of Lady Eboshi from Princess Mononoke directed by Hayao Miyazaki of Studio Ghibli . He was voiced by Tsunehiko Kamijo in the Japanese version and John DiMaggio in the English version.",
          "appears_in": [
            "Princess Mononoke"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/4/42/Gonza_%282%29.jpg/revision/latest/scale-to-width-down/268?cb=20181011031227",
          "gender": "Male"
        },
        {
          "name": "Kohroku",
          "url": "https://ghibli.fandom.com/wiki/Kohroku",
          "description": "Kohroku (甲六, Kōroku ) is the husband of Toki in Princess Mononoke directed by Hayao Miyazaki of Studio Ghibli . He fears Kodamas .",
          "appears_in": [
            "Princess Mononoke"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/d/d1/Kohroku_gives.jpg/revision/latest/scale-to-width-down/268?cb=20181016005524",
          "gender": "Male"
        },
        {
          "name": "Jikobo",
          "url": "https://ghibli.fandom.com/wiki/Jigo",
          "description": "Jigo or Jiko Bō (ジコ坊, lit. \"Jiko the man/priest\") in Japanese is a character from Princess Mononoke .",
          "appears_in": [
            "Princess Mononoke"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/7/79/Jigo_%282%29.jpg/revision/latest/scale-to-width-down/268?cb=20181011030826",
          "age": "Middle age",
          "gender": "Male"
        }
      ]
    },
    {
      "title": "Ronja, the Robber's Daughter",
      "url": "https://ghibli.fandom.com/wiki/Ronja,_the_Robber%27s_Daughter",
      "release_year": 2014,
      "director": "Gorō Miyazaki",
      "duration": "26 episodes",
      "description": "Ronja, the Robber's Daughter Kanji 山賊の娘ローニャ Rōmaji Sanzoku no Musume Rōnya Directed by Gorō Miyazaki [ 1 ] Produced by Nobuo Kawakami Written by Gorō Miyazaki Screenplay by Hiroyuki Kawasaki Narrated by Gillian Anderson Starring Haruka Shiraishi Reika Uyama Takaaki Seki Yukari Nozawa Music by Satoshi Takebe Aoi Teshima Production Polygon Pictures Studio Ghibli (Production cooperation) Distributed by NHK BS Premium Release date(s) October 11, 2014 Running time 26 episodes Ronja, the Robber's Daughter (山賊の娘ローニャ, Sanzoku no Musume Rōnya ) is a 26 episode animated television series directed by Gorō Miyazaki and written by Hiroyuki Kawasaki for NHK. It is animated by Polygon Pictures as a production for NHK Enterprises and Dwango. The story is based on the Astrid Lindgren novel of the same name",
      "synopsis": "Ronja, the only child of a bandit chief, grows up among a clan of robbers living in a castle in the woodlands of early-Medieval Scandinavia. When Ronja grows old enough she ventures into the forest, exploring and discovering its wonders and dangers like the mystical creatures that dwell there. She learns to live in the forest through her own strength, with the occasional rescue by her parents. Ronja has never met another child until after her 10th birthday, when she happens upon a boy her own age named Birk, who turns out to be the son of the rival clan chief. [ 2 ]",
      "poster_url": "https://static.wikia.nocookie.net/studio-ghibli/images/1/1a/Ronja%2C_the_Robber%27s_Daughter.jpg/revision/latest/scale-to-width-down/268?cb=20220409223256",
      "genres": [
        "Adventure",
        "Fantasy",
        "Romance"
      ],
      "characters": []
    },
    {
      "title": "Spirited Away",
      "url": "https://ghibli.fandom.com/wiki/Spirited_Away",
      "release_year": 2001,
      "director": "Hayao Miyazaki",
      "duration": "124 minutes",
      "description": "Spirited Away JP US Kanji 千と千尋の神隠し Rōmaji Sen to Chihiro no Kamikakushi Directed by Hayao Miyazaki Kirk Wise (English) Produced by Toshio Suzuki Written by Hayao Miyazaki Starring Rumi Hiiragi Miyu Irino Mari Natsuki Yumi Tamai Takeshi Naito Yasuko Sawaguchi Tsunehiko Kamijō Takehiko Ono Bunta Sugawara Music by Joe Hisaishi Cinematography Atsushi Okui Art Directed by Yoji Takeshige Editing by Takeshi Seyama Studio Studio Ghibli Production Tokuma Shoten Nippon Television Network Dentsu Walt Disney International Japan/Buena Vista Home Entertainment Tohokushinsha Film Mitsubishi Distributed by Toho The Walt Disney Company (US) Mikado Film (Italian cinema distribution only) Universal Pictures Italia S.r.l. (Italian home video distribution only) Release date(s) July 20, 2001 (Japan) Running tim",
      "synopsis": "Chihiro Ogino , a disaffected child, is annoyed about having to move to a new town. She is traveling with her parents in their 1996 Audi A4 Quattro to their new home. While driving to their new house, Chihiro's father attempts to follow a shortcut; they subsequently lose their way and come across a mysterious red gate and a tunnel which exits to a clock tower and leads to what appears to be an abandoned theme park , lined with seemingly empty restaurants. Finding a restaurant fully-stocked with unattended food, both parents eat the food they find there and, as a result, transform into pigs. Chihiro's distress at losing her parents is compounded by the discoveries that the world around her has changed and that her body seems to be disappearing. A mysterious boy named Haku appears, comforts Chihiro, and gives her a red berry to eat, which makes her solid again. He smuggles her into a large bathhouse owned and operated by the evil witch Yubaba , where thousands of spirits come to refresh themselves. Haku tells Chihiro that the only way she can remain in the spirit-world long enough to rescue her parents is by gaining employment in Yubaba's bathhouse. When Chihiro asks Haku how he seems to know her so well, Haku replies that he has known Chihiro since she was very small. At first, she tries to get work with Kamajī , who works at the boiler room , but is rejected. Kamajī instead hands Chihiro off to the worker, Lin , to take her to Yubaba. In Yubaba's penthouse suite , Chihiro repeatedly asks for a job, overriding the monstrous witch's refusals. Yubaba ultimately consents, on condition that Chihiro give up her name. Yubaba literally takes possession of Chihiro's real name (荻野 千尋 , Ogino Chihiro) by grasping the kanji characters from Chihiro's signed contract, leaving Chihiro with one part of one character of her original two-character name, in isolation pronounced \"Sen\" (千). Taking a person's name gives Yubaba power to keep its owner in her service permanently; it is rev",
      "poster_url": "https://static.wikia.nocookie.net/studio-ghibli/images/4/4a/Spirited_Away_JP_Poster.png/revision/latest/scale-to-width-down/268?cb=20240608130110",
      "genres": [
        "Adventure",
        "Fantasy",
        "Romance"
      ],
      "characters": [
        {
          "name": "Chihiro Ogino/Sen",
          "url": "https://ghibli.fandom.com/wiki/Chihiro_Ogino",
          "description": "Chihiro Ogino/Sen Japanese name 荻野 千尋/千 ( Ogino Chihiro/Sen ) Species Human Age 10 years [ 1 ] Gender Female First Appearance Spirited Away Role Main character Voice actor (Japanese) Rumi Hiiragi Voice actor (Disney) Daveigh Chase",
          "appears_in": [
            "Spirited Away"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/8/8e/Chihiro_Ogino.jpg/revision/latest/scale-to-width-down/268?cb=20210214130251",
          "age": "10 years [ 1 ]",
          "gender": "Female"
        },
        {
          "name": "Haku/Nigihayami Kohaku Nushi",
          "url": "https://ghibli.fandom.com/wiki/Haku",
          "description": "Nigihayami Kohaku Nushi Japanese name ハク / 饒速水小白主 ( Haku / Nigihayami Kohaku Nushi ) Species River God, Dragon , Snake [ 1 ] Age 12 years (in appearance) Gender Male First Appearance Spirited Away Role Co-protagonist, Yubaba 's apprentice, Dragon (river god) Voice actor (Japanese) Miyu Irino Voice actor (Disney) Jason Marsden",
          "appears_in": [
            "Spirited Away"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/8/89/Haku-2.png/revision/latest/scale-to-width-down/268?cb=20201008131345",
          "age": "12 years (in appearance)",
          "gender": "Male"
        },
        {
          "name": "Yubaba",
          "url": "https://ghibli.fandom.com/wiki/Yubaba",
          "description": "Yubaba (湯婆婆, Yubāba ), or Granny by Chihiro , is the proprietor of the Bathhouse and the main villain of the Japanese animated film Spirited Away . She is the identical younger twin sister of Zeniba and the mother of Boh . She has a harpy servant called Yu-Bird and has an apprentice by the name of Haku , and is the employer of maybe hundreds of other bathhouse workers. Chihiro Ogino calls her \"Granny\".",
          "appears_in": [
            "Spirited Away"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/f/f8/Yubaba-0.jpg/revision/latest/scale-to-width-down/268?cb=20200710021834",
          "gender": "Female"
        },
        {
          "name": "Kamajī",
          "url": "https://ghibli.fandom.com/wiki/Kamaj%C4%AB",
          "description": "Kamajī Japanese name かまじ ( Kamajī ) Species Spirit Age At least 40 years [ 1 ] Gender Male First Appearance Spirited Away Role Supporting character Voice actor (Japanese) Bunta Sugawara Voice actor (Disney) David Ogden Stiers",
          "appears_in": [
            "Spirited Away"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/7/78/Kamaji.jpg/revision/latest/scale-to-width-down/268?cb=20181013004805",
          "age": "At least 40 years [ 1 ]",
          "gender": "Male"
        },
        {
          "name": "No-Face",
          "url": "https://ghibli.fandom.com/wiki/Kaonashi_(No-Face)",
          "description": "No-Face Japanese name 顔無し ( Kaonashi ) Species Spirit, \"Monster\" by Yubaba First Appearance Spirited Away Role Supporting character Voice actor (Japanese) Akio Nakamura Voice actor (Disney) Bob Bergen",
          "appears_in": [
            "Spirited Away"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/9/9d/No-Face_infobox.png/revision/latest/scale-to-width-down/268?cb=20200908135515"
        },
        {
          "name": "Lin",
          "url": "https://ghibli.fandom.com/wiki/Lin",
          "description": "Lin Japanese name リン ( Rin ) Species Spirit of The White Fox (白狐) [ 1 ] Age Almost 20 years Gender Female First Appearance Spirited Away Role Supporting character Voice actor (Japanese) Yumi Tamai Voice actor (Disney) Susan Egan",
          "appears_in": [
            "Spirited Away"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/f/f2/Lin_face.png/revision/latest/scale-to-width-down/267?cb=20200914123534",
          "age": "Almost 20 years",
          "gender": "Female"
        },
        {
          "name": "Boh",
          "url": "https://ghibli.fandom.com/wiki/Boh",
          "description": "Bō (坊, Bō , lit. \"boy\"), also known as Boh or Baby , is the son of Yubaba and nephew of Zeniba and the tertiary villain in the film, Spirited Away .",
          "appears_in": [
            "Spirited Away"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/7/7e/Boh_winks.jpg/revision/latest/scale-to-width-down/268?cb=20180815032035",
          "age": "1 years",
          "gender": "Male"
        },
        {
          "name": "Akio Ogino",
          "url": "https://ghibli.fandom.com/wiki/Akio_Ogino",
          "description": "Akio Ogino Japanese name 荻野 明夫 ( Ogino Akio ) Species Human Age 38 years [ 1 ] Gender Male First Appearance Spirited Away Role Supporting character Voice actor (Japanese) Takashi Naito Voice actor (Disney) Michael Chiklis",
          "appears_in": [
            "Spirited Away"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/4/47/Akio_Ogino.jpg/revision/latest/scale-to-width-down/268?cb=20110701072357",
          "age": "38 years [ 1 ]",
          "gender": "Male"
        },
        {
          "name": "Yuko Ogino",
          "url": "https://ghibli.fandom.com/wiki/Yuko_Ogino",
          "description": "Yūko Ogino Japanese name 荻野悠子 ( Ogino Yūko ) Species Human Age 35 years [ 1 ] Gender Female First Appearance Spirited Away Role Supporting character Voice actor (Japanese) Yasuko Sawaguchi Voice actor (Disney) Lauren Holly",
          "appears_in": [
            "Spirited Away"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/c/c6/Ichiyuko_Ogino.png/revision/latest/scale-to-width-down/268?cb=20181013005635",
          "age": "35 years [ 1 ]",
          "gender": "Female"
        },
        {
          "name": "Kashira",
          "url": "https://ghibli.fandom.com/wiki/Kashira",
          "description": "Kashira Japanese name 頭 ( Kashira ) Species Spirit Age 800+ years Gender Male First Appearance Spirited Away Role Supporting character Voice actor (Japanese) Akio Nakamura Voice actor (Disney) Unknown",
          "appears_in": [
            "Spirited Away"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/0/01/Kashira.png/revision/latest/scale-to-width-down/268?cb=20181015012841",
          "age": "800+ years",
          "gender": "Male"
        },
        {
          "name": "River Spirit",
          "url": "https://ghibli.fandom.com/wiki/River_Spirit",
          "description": "River Spirit Japanese name 河の神 ( Kawa no Kami ) Species River God, Dragon [ 1 ] Gender Male First Appearance Spirited Away Role Supporting character Voice actor (Japanese) Koba Hayashi Voice actor (Disney) Jim Ward",
          "appears_in": [
            "Spirited Away"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/d/db/River_spirit_thankful.png/revision/latest/scale-to-width-down/268?cb=20200923154720",
          "gender": "Male"
        },
        {
          "name": "Zeniba",
          "url": "https://ghibli.fandom.com/wiki/Zeniba",
          "description": "Zeniba Japanese name 銭婆 ( Zenība ) Species Witch Age 60 years Gender Female First Appearance Spirited Away Role Supporting character Overarching Villain Voice actor (Japanese) Mari Natsuki Voice actor (Disney) Suzanne Pleshette",
          "appears_in": [
            "Spirited Away"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/d/d8/Zeniba.png/revision/latest/scale-to-width-down/268?cb=20180917115708",
          "age": "60 years",
          "gender": "Female"
        }
      ]
    },
    {
      "title": "Tales from Earthsea",
      "url": "https://ghibli.fandom.com/wiki/Tales_from_Earthsea",
      "release_year": 2006,
      "director": "Goro Miyazaki",
      "duration": "115 minutes",
      "description": "Tales from Earthsea Kanji ゲド戦記 Rōmaji Gedo Senki Directed by Goro Miyazaki Produced by Toshio Suzuki Screenplay by Gorō Miyazaki Keiko Niwa Based on Earthsea by Ursula K. Le Guin The Journey of Shuna by Hayao Miyazaki Starring Bunta Sugawara Junichi Okada Aoi Teshima Yūko Tanaka Music by Tamiya Terashima Editing by Takeshi Seyama Studio Studio Ghibli Production Nippon Television Network Dentsu Hakuhodo DYMP Walt Disney Japan/Buena Vista Home Entertainment Mitsubishi Toho Distributed by Toho Release date(s) July 29, 2006 Running time 115 minutes Budget $22 million Box office $68,673,565 Streaming Platform(s) Max Tales from Earthsea (ゲド戦記 , Gedo Senki? , loosely Ged 's War Chronicles ) is the 15th anime film from Studio Ghibli , released in Japan on July 29, 2006, and to the rest of the worl",
      "synopsis": "The movie begins with a war galley caught in a storm at sea. The ship's weatherworker is distressed to realize that he has lost the power to control the wind and waves, but is even more disturbed when he observes two dragons fighting above the clouds where one of them is eventually killed. Shortly thereafter the King of Enlad , already troubled by tales of drought and pestilence in the land, receives news both of the strange omen at sea and of the disappearance of Prince Arren (the King's son). The King's wizard tells the tale of how dragons and men were once one, until dragons chose freedom and men chose possessions, and of his fears of how the land's plight is due to a weakening of the Balance. The King has little time to ponder on this before he is set upon and fatally stabbed in a dark corridor by a young lad, who turns out to be Arren where the prince steals his father's sword and flees the palace while his father dies from the wound inflicted by Arren. The action now moves to a desert where Arren is pursued by wolves and he is rescued (despite refusing to defend himself) by a wizard who turns out to be Sparrowhawk the Archmage. During a conversation between the two, Sparrowhawk notes the magical nature of Arren's father's sword and expresses his doubt that Arren can unsheathe such a weapon. Arren, not having any direction in Life, accompanies Sparrowhawk to the town of Hort . When he's left to explore the town alone, he suddenly becomes scared as if something is following him. As Arren runs away, he sees a girl fleeing from slave hunters.  He intervenes and saves her, though his \"bravery\" is but a reflection of his death-wish and not truly a heroic act.  The girl recognizes this at once and runs away from him and towards a woman's voice calling her name Therru . That evening, Arren is captured by the same slave hunter but loses his father's sword as the hunter believes it to be worthless junk. Arren is rescued by Sparrowhawk from the slavers by wizardry and Sp",
      "poster_url": "https://static.wikia.nocookie.net/studio-ghibli/images/5/53/Tales_From_Earthsea.png/revision/latest/scale-to-width-down/268?cb=20220212050455",
      "genres": [
        "Adventure",
        "Fantasy",
        "Romance"
      ],
      "characters": [
        {
          "name": "Ged/Sparrowhawk",
          "url": "https://ghibli.fandom.com/wiki/Ged",
          "description": "Ged (ゲド, Gedo ), also known as Sparrowhawk (ハイタカ, Haitaka ), is the deuteragonist from Tales from Earthsea . He is one of the most powerful and renowned wizards in Earthsea , and is also known as one of the \"dragon lords\" that have authorities to communicate and negotiate with dragons . At the beginning of the film, he runs into Prince Arren and saves him from a pack of wolves that are chasing him through the desert.",
          "appears_in": [
            "Tales from Earthsea"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/3/33/Ged.jpg/revision/latest/scale-to-width-down/268?cb=20181015235754",
          "gender": "Male"
        },
        {
          "name": "Prince Arren/Lebannen",
          "url": "https://ghibli.fandom.com/wiki/Arren",
          "description": "Arren / Lebannen Japanese name アレン王子 ( Aren Ōji ) Species Human Age 17 years Gender Male First Appearance Tales from Earthsea Role Main character Voice actor (Japanese) Junichi Okada Voice actor (Disney) Matt Levin",
          "appears_in": [
            "Tales from Earthsea"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/e/ee/Arren.png/revision/latest/scale-to-width-down/268?cb=20120103020747",
          "age": "17 years",
          "gender": "Male"
        },
        {
          "name": "Therru/Tehanu",
          "url": "https://ghibli.fandom.com/wiki/Therru",
          "description": "Therru Japanese name テハヌー or テルー ( Tehanū or Terū ) Species Dragon Age circa 14-17 Gender Female First Appearance Tales from Earthsea Voice actor (Japanese) Aoi Teshima Voice actor (Disney) Blaire Restaneo",
          "appears_in": [
            "Tales from Earthsea"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/1/1a/Therru.jpg/revision/latest/scale-to-width-down/268?cb=20210411193308",
          "age": "circa 14-17",
          "gender": "Female"
        }
      ]
    },
    {
      "title": "The Boy and the Heron",
      "url": "https://ghibli.fandom.com/wiki/The_Boy_and_the_Heron",
      "release_year": 2023,
      "director": "Hayao Miyazaki",
      "duration": "124 minutes",
      "description": "The Boy and the Heron Kanji 君たちはどう生きるか Rōmaji Kimitachi wa Dō Ikiru ka Directed by Hayao Miyazaki Produced by Toshio Suzuki Written by Hayao Miyazaki Starring Soma Santoki Masaki Suda Aimyon Yoshino Kimura Shōhei Hino Ko Shibasaki Takuya Kimura Music by Joe Hisaishi Cinematography Atsushi Okui Editing by Takeshi Seyama Rie Matsubara Akane Shiraishi Studio Studio Ghibli Distributed by Toho Release date(s) July 14, 2023 Running time 124 minutes The Boy and the Heron (君たちはどう生きるか, Kimitachi wa Dō Ikiru ka , lit. \"How do you live?\") is the 22nd animated film written and directed by Hayao Miyazaki and produced by Studio Ghibli .  Distributed by Toho , it was released in Japan on July 14, 2023. The story follows a boy, Mahito Maki , negotiating the difficult relationship with his father and step ",
      "synopsis": null,
      "poster_url": "https://static.wikia.nocookie.net/studio-ghibli/images/d/d2/How_Do_You_Live_Poster_2.jpg/revision/latest/scale-to-width-down/268?cb=20230704143216",
      "genres": [
        "Adventure",
        "Fantasy",
        "Drama"
      ],
      "characters": []
    },
    {
      "title": "The Castle of Cagliostro",
      "url": "https://ghibli.fandom.com/wiki/The_Castle_of_Cagliostro",
      "release_year": 1979,
      "director": "Hayao Miyazaki",
      "duration": "100 minutes",
      "description": "Lupin III: The Castle of Cagliostro Poster DVD BD Kanji ルパン三世 カリオストロの城 Rōmaji Rupan Sansei: Kariosutoro no Shiro Directed by Hayao Miyazaki Produced by Yutaka Fujioka Tetsuo Katayama Screenplay by Haruya Yamazaki Hayao Miyazaki Story by Hayao Miyazaki Based on Lupin III by Monkey Punch \"Arsène Lupin\" by Maurice Leblanc Starring Yasuo Yamada Kiyoshi Kobayashi Makio Inoue Eiko Masuyama Goro Naya Sumi Shimamoto Taro Ishida Music by Yuji Ohno Cinematography Hirokata Takahashi Art Directed by Shichirō Kobayashi Production Tokyo Movie Shinsha Yasuo Ōtsuka (Animation Director) Distributed by Toho Release date(s) December 15, 1979 Running time 100 minutes Budget ¥500 million Box office ¥610 million (Box office) ¥305 million (Home video) Lupin III: The Castle of Cagliostro (ルパン三世 カリオストロの城 , Rupan S",
      "synopsis": "The year is 1968. Arsene Lupin III , Daisuke Jigen and Goemon are escaping on a Fiat 500 pursuit after robbing the casino of Monaco, only to discover that their entire haul is counterfeit. When Lupin was just getting started as a professional thief, he was almost killed while searching for the source of these so-called goat bills. He decides that it is time to take another chance, and, with Jigen, heads off to the purported source of the bills, the Principality of Cagliostro. Shortly after arriving, they rescue a young girl from a car full of thugs, only to let her get captured again when Lupin is knocked unconscious after tumbling down a cliff. They later discover that she is Clarisse , the princess of Cagliostro and is engaged to be married to the Count Cagliostro, the country's ruler. The count wants to recover the ancient treasure of the Cagliostro family, and needs the princess's ring to do so. Realizing he will need more help after he is attacked by a group of the count's elite assassins, Lupin calls on Goemon and tips off longtime foe Inspector Koichi Zenigata to his whereabouts. He also find his former lover, Fujiko Mine, posing as Clarisse's lady-in-waiting. Using a party and Zenigata as a distraction, Lupin makes his way to the tower where Clarisse is kept, returns her ring, and promises to help her to escape. The count arrives shortly thereafter with his assassins; Lupin is dropped down a trapdoor into the bowels of the castle. The ring turns out to be a practical joke left by Lupin. Infuriated, the Count flushes him deeper into the cellars, which are full of bodies of spies who attempted to learn the secrets of Cagliostro and the goat bills. While down there, Lupin bumps into Inspector Zenigata, who was accidentally thrown down earlier. The two reluctantly form a pact to help escape. Using two aqualungs dropped by elite soldiers, the pair escape. Their escape leads them to the printing presses, where Lupin and Zenigata finally discover the source of the ",
      "poster_url": "https://static.wikia.nocookie.net/studio-ghibli/images/7/71/The_Castle_of_Cagliostro.jpg/revision/latest/scale-to-width-down/268?cb=20220409221721",
      "genres": [
        "Adventure",
        "Fantasy",
        "Romance"
      ],
      "characters": [
        {
          "name": "Arsene Lupin III",
          "url": "https://ghibli.fandom.com/wiki/Arsene_Lupin_III",
          "description": "Arséne Lupin III (ルパン三世, Rupan Sansei ) is the protagonist in the Studio Ghibli film The Castle of Cagliostro",
          "appears_in": [
            "The Castle of Cagliostro"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/1/1e/Tredje_Lupin.png/revision/latest/scale-to-width-down/268?cb=20181023140949",
          "gender": "Male"
        },
        {
          "name": "Daisuke Jigen",
          "url": "https://ghibli.fandom.com/wiki/Daisuke_Jigen",
          "description": "Daisuke Jigen is a character in The Castle of Cagliostro . He is a gunman and partner in crime  of Lupin III .",
          "appears_in": [
            "The Castle of Cagliostro"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/6/67/Jigen.png/revision/latest/scale-to-width-down/268?cb=20181031002615",
          "gender": "Male"
        },
        {
          "name": "Koichi Zenigata",
          "url": "https://ghibli.fandom.com/wiki/Koichi_Zenigata",
          "description": "Koichi Zenigata (usually called Inspector Zenigata ) is an incredibly talented, yet often bumbling police officer who has made it his life's goal to capture Lupin III .",
          "appears_in": [
            "The Castle of Cagliostro"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/d/d1/Koichi_Zenigata.jpg/revision/latest/scale-to-width-down/268?cb=20180910030136",
          "gender": "Male"
        },
        {
          "name": "Clarisse d'Cagliostro",
          "url": "https://ghibli.fandom.com/wiki/Clarisse_d%27Cagliostro",
          "description": "Clarisse d'Cagliostro (クラリス・ド・カリオストロ Kurarisu do Kariosutoro) is the princess and current ruler of the European Grand Duchy of Gagliostro and a friend of Lupin III from the film The Castle of Cagliostro .",
          "appears_in": [
            "The Castle of Cagliostro"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/7/7f/Clarisse_d%27Cagliostro.jpg/revision/latest/scale-to-width-down/268?cb=20180812014452",
          "gender": "Female"
        }
      ]
    },
    {
      "title": "The Cat Returns",
      "url": "https://ghibli.fandom.com/wiki/The_Cat_Returns",
      "release_year": 2002,
      "director": "Hiroyuki Morita",
      "duration": "75 minutes",
      "description": "The Cat Returns Kanji 猫の恩返し Rōmaji Neko no Ongaeshi Directed by Hiroyuki Morita Produced by Toshio Suzuki Nozomu Takahashi Screenplay by Reiko Yoshida Based on The Cat Returns by Aoi Hiiragi Starring Chizuru Ikewaki Yoshihiko Hakamada Tetsu Watanabe Yosuke Saito Aki Maeda Tetsurō Tamba Music by Yuji Nomi Cinematography Kentaro Takahashi Art Directed by Naoya Tanaka Editing by Megumi Uchida Studio Studio Ghibli Production Tokuma Shoten Nippon Television Network Hakuhodo Walt Disney International Japan/Buena Vista Home Entertainment Mitsubishi Toho Distributed by Toho Release date(s) July 20, 2002 Running time 75 minutes Budget USD$20 million Box office ¥6.46 billion (USD$54 million) Streaming Platform(s) Max The Cat Returns (猫の恩返し , Neko no Ongaeshi , literally The Cat's Repayment ) is an a",
      "synopsis": "Haru , a quiet and shy high school student who has a suppressed ability to talk with cats. One day, she sleeps through her alarm is late for class and is laughed at by practically everyone for trying to sneak in.  While walking home, she admits to her friend Naoko that she actually likes a boy in her class named Machida but is too shy to ask him out.  Naoko then reveals that he has a girlfriend, who happens to be a Freshman, the two have a friendly fight with each other.  While walking, the girls notice a cat with a gift box crossing the street, while crossing the road the light turns green, and using her lacrosse stick, Haru saves a Russian Blue odd-eyed cat from being hit by a truck on a busy road. The cat stands up and thanks Haru for saving him, Haru is too surprised to even respond.  After the cat leaves, Haru tells her friend that the cat spoke but she doesn't believe Haru.  Later she tells her mother and her mother remembers how Haru once said she could talk to cats especially when she was younger, she gave a stray cat some fish crackers. That night, the king of the Cat Kingdom comes to thank her, he comes to her house with a parade which shocks the other cats and they chase after them (several bodyguards dispose of them).  As it turns out, the cat that Haru saved is named Lune , and he is the only Prince of the Cat Kingdom. In gratitude, the Cat King gives Haru a list of gifts she'll receive tomorrow, Haru thanks them and the King goes on his way.  The next day, the gifts are shock to Haru and cause problems: Naoko has tons of Lacrosse sticks in her house which she questions, Haru's front yard is filled with cattails (which Haru is allergic to) as she is hurrying off to school, she gets chased by the neighborhood cats, which surprises her friends, they suspect she must have catnip on her (it is soon confirmed she does).  When opening her locker, Haru discovers boxes full of mice which freak her out, thankfully the cats that were following her take care of th",
      "poster_url": "https://static.wikia.nocookie.net/studio-ghibli/images/8/87/The_Cat_Returns.jpg/revision/latest/scale-to-width-down/268?cb=20211104164341",
      "genres": [
        "Adventure",
        "Fantasy",
        "Romance"
      ],
      "characters": []
    },
    {
      "title": "The Imaginary",
      "url": "https://ghibli.fandom.com/wiki/The_Imaginary",
      "release_year": 2023,
      "director": "Yoshiyuki Momose",
      "duration": "105 minutes",
      "description": "The Imaginary Kanji 屋根裏のラジャー Rōmaji Yaneura no Rajā Directed by Yoshiyuki Momose Produced by Yoshiaki Nishimura Screenplay by Yoshiaki Nishimura Based on The Imaginary by A.F. Harrold Starring Kokoro Terada Rio Suzuki Sakura Ando Riisa Naka Takayuki Yamada Atsuko Takahata Issey Ogata Music by Kenji Tamai Agehasprings Cinematography Susumu Fukushi Editing by Toshihiko Kojima Studio Studio Ponoc Distributed by Toho Release date(s) 15 December 2023 Running time 105 minutes Box office $478,300 The Imaginary (屋根裏のラジャー , Yaneura no Rajā ) is an Japanese animated feature films and produced by Studio Ponoc and directed by Yoshiyuki Momose and produced Yoshiaki Nishimura .",
      "synopsis": "The film opens with Rudger, an invisible entity known as an Imaginary, in the midst of a colorful adventure conjured by his creator, Amanda Shuffleup. Their escapades are interrupted by Amanda's mother, Lizzie, who is exasperated by her daughter's aloof behavior and fixation on a friend who, as far as she can tell, does not exist. While on a day trip with Lizzie, Amanda and Rudger encounter the menacing Mr. Bunting and his own Imaginary, a sullen girl in black. Revealing himself to be a hunter and devourer of exceptional Imaginaries, he decides Rudger is his next mark. As the two children flee from the man in a panic, Amanda is hit by a car, the accident appearing to be fatal. Now alone, Rudger begins to disappear, since Imaginaries cease to exist once their creator forgets them. Zinzan, a mysterious cat, persuades the boy to follow him to a sanctuary for Imaginaries at risk of vanishing. The sanctuary is a real-life library, where Imaginaries are sustained by the creative energies of the books within. Among the dozens like himself, Rudger befriends the skeletal Cruncher-of-Bones, Snowflake the Hippo, and Emily, who is a leader among the library's inhabitants. Over dinner that night, Rudger asks Emily about Mr. Bunting, and she explains that he was once a mortal human man who was so desperate to preserve his Imaginary, he resorted to consuming other Imaginaries, which has sustained the both of them for hundreds of years. At the conclusion of her story, she insists Bunting is nothing but a myth, much to Rudger's frustration. The following morning, Emily tasks Rudger with his new job, where he'll spend the day with a child in need of pretend playmates. He selects John, one of Amanda's classmates, as his first assignment. At the end of the day, he spots Bunting lurking outside of John's home, and confronts him about Amanda coming to harm. Bunting does not accept the blame and attempts to capture Rudger, who narrowly escapes and takes refuge at Amanda's house. There, he",
      "poster_url": "https://static.wikia.nocookie.net/studio-ghibli/images/8/8e/The_Imaginary_Poster.jpg/revision/latest/scale-to-width-down/268?cb=20250703132026",
      "genres": [
        "Adventure",
        "Drama",
        "Animation"
      ],
      "characters": []
    },
    {
      "title": "The Red Turtle",
      "url": "https://ghibli.fandom.com/wiki/The_Red_Turtle",
      "release_year": 2016,
      "director": "Michaël Dudok de Wit",
      "duration": "80 minutes",
      "description": "The Red Turtle Japanese English French Kanji レッドタートル ある島の物語 Directed by Michaël Dudok de Wit Produced by Toshio Suzuki Isao Takahata Vincent Maraval Pascal Caucheteux Grégoire Sorlat Léon Perahia Written by Michaël Dudok de Wit Pascale Ferran Music by Laurent Perez del Mar Production Prima Linea Productions Why Not Productions Wild Bunch Studio Ghibli CN4 Productions Arte France Cinéma Belvision Corporation Nippon Television Network Dentsu Hakuhodo DY Media Partners Walt Disney Japan Mitsubishi Toho Distributed by Wild Bunch (France) Lumière (Belgium) Toho (Japan) Release date(s) May 18, 2016 (Cannes) June 29, 2016 (France) September 17, 2016 (Japan) Running time 80 minutes Box office $6.6 million The Red Turtle (French: La Tortue rouge) is a 2016 animated film directed by Michael Dudok de",
      "synopsis": "A nameless man set adrift by a storm wakes up on a deserted island. The man finds that the island is rich in resources, finding fresh fruit and water as well as a variety of small animals and a dense bamboo forest. After he falls into an isolated cave, the man swims downward and narrowly swims out of the cave. That night, he watches as many sea turtles paddle out to sea. Later on, he prepares to leave the island. The man builds a raft from bamboo, and attempts to sail away. However, an unseen sea creature destroys the raft, forcing the man back to the island. Attempting to escape with another raft, his plan is foiled again by the sea creature. Trying a third time, his raft is again destroyed, but once in the water, he finds a red turtle facing him. The turtle does not harm the man, and the man retreats back to the island. That evening, the man sees the red turtle crawling on the shore, attempting to go inland. In revenge, he hits the red turtle on the head with a bamboo stick, and pushes it over on its back. After halfway through building another raft, the man starts to feel remorse about leaving the turtle upside-down and tries to save the turtle by flipping it over, but it's too heavy. He desperately runs to get some water to revive the turtle, but realizes that it's dead, and falls asleep next to it. The turtle's shell splits down the middle during the night and to the man's surprise, he sees a woman lying inside of the turtle shell. The man tries to revive her, making a shelter over her to protect her from the sun. When rain hits the island, the woman wakes up. The man notices she is gone, and searches the island for her, finally seeing that she is on the coastline. Giving her his shirt, he eventually sees the woman is wearing his shirt, but she is dragging the now empty turtle shell into the sea and setting it off. The man does the same with his half-built raft. The two soon form a strong and enduring romance. Some years later, the couple has a son who is a cur",
      "poster_url": "https://static.wikia.nocookie.net/studio-ghibli/images/6/68/The_Red_Turtle.jpg/revision/latest/scale-to-width-down/268?cb=20180820223403",
      "genres": [
        "Adventure",
        "Fantasy",
        "Romance"
      ],
      "characters": [
        {
          "name": "Unnamed Castaway",
          "url": "https://ghibli.fandom.com/wiki/Castaway",
          "description": "Castaway Species Human Gender Male First Appearance The Red Turtle Role Main character",
          "appears_in": [
            "The Red Turtle"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/b/b7/Castaway.jpg/revision/latest/scale-to-width-down/268?cb=20181023025810",
          "gender": "Male"
        },
        {
          "name": "Giant turtle",
          "url": "https://ghibli.fandom.com/wiki/Giant_turtle",
          "description": "Giant turtle Species Sea Turtle (Ghost) Gender Female First Appearance The Red Turtle Role Main character",
          "appears_in": [
            "The Red Turtle"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/9/90/Giant_Red_Turtle.jpg/revision/latest/scale-to-width-down/268?cb=20230414034946",
          "gender": "Female"
        }
      ]
    },
    {
      "title": "The Secret World of Arrietty",
      "url": "https://ghibli.fandom.com/wiki/The_Secret_World_of_Arrietty",
      "release_year": 2010,
      "director": "Hiromasa Yonebayashi",
      "duration": "95 minutes",
      "description": "The Secret World of Arrietty Kanji 借りぐらしのアリエッティ Rōmaji Kari-gurashi no Arietti Directed by Hiromasa Yonebayashi Produced by Toshio Suzuki Screenplay by Hayao Miyazaki Keiko Niwa Based on The Borrowers by Mary Norton Starring Mirai Shida Ryunosuke Kamiki Shinobu Otake Keiko Takeshita Tatsuya Fujiwara Tomokazu Miura Kirin Kiki Music by Cécile Corbel Cinematography Atsushi Okui Editing by Keiko Kadokawa Rie Matsubara Hiromi Sasaki Takeshi Seyama Studio Studio Ghibli Production Nippon Television Network Dentsu Hakuhodo DYMP Walt Disney Japan Mitsubishi Toho Wild Bunch Distributed by Toho Release date(s) July 17, 2010 Running time 95 minutes Budget $23 million Box office ¥9.26 billion $145.6 million (worldwide) Streaming Platform(s) Max The Secret World of Arrietty , known in Japan as The Borro",
      "synopsis": "The story takes place in 2010 in Koganei, western Tokyo and like the novel revolves around a group of \"tiny people\" who are 10-cm tall and live under the floorboards of a typical human household.  They call themselves \"Borrowers\" because they in people's houses and take items in the house such as tea leaves, sugar, in other words items that won't be missed if they disappear and it's only what they need to survive. A boy named Sho arrives at the house his mother lived in as a child, to stay with his great aunt Sadako . When Sho leaves the car, he sees a cat trying to attack something in the bushes, but the cat leaves after being attacked by a crow. Sho goes to see what the cat was trying to attack, he then sees a Borrower named Arrietty or thinks he does.  Arriety runs back to basement before the cat gets her with some flowers and leaves for her mother.  Her worried mother asks Arriety if she went outside again but is surprised that her room has become a forest.  Arrietty gives the leaves to her mother as an early birthday gift.  Homily reminds her daughter that she shouldn't be near beings as their relative was killed by an animal.  Arrietty says she can keep the gift if she is too concerned but Homily says she'll keep it as she has a recipe for the leaves she can use.  Arrietty is excited because tonight she going on her first borrowing with her father.  When her father Pod returns and tells them there is a new being the house, Homily becomes hesitant to let her daughter go especially since children are wild, but Arriety wants to go as they promised that this would be her night.  Pod lets her come since Sho is sick so she'll be fine, before leaving to get ready Arriety assures her mother she'll look after her father.  Pod tells Homily that Arriety is almost 14 and will be out on her own soon. That night Pod takes Arrietty above the floorboards to show her how he gets sugar. Their first stop is the kitchen, then they walk within a wall to reach a dollhouse in Shawn'",
      "poster_url": "https://static.wikia.nocookie.net/studio-ghibli/images/f/f7/The_Secret_World_of_Arrietty.jpg/revision/latest/scale-to-width-down/268?cb=20210306220734",
      "genres": [
        "Adventure",
        "Fantasy",
        "Romance"
      ],
      "characters": [
        {
          "name": "Arrietty",
          "url": "https://ghibli.fandom.com/wiki/Arrietty",
          "description": "Arrietty Clock Species Borrower Age Almost 14 years Gender Female First Appearance The Secret World of Arrietty Role Main character Voice actor (Japanese) Mirai Shida Voice actor (English) Saoirse Ronan Voice actor (Disney) Bridgit Mendler",
          "appears_in": [
            "The Secret World of Arrietty"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/0/04/Arrietty.jpg/revision/latest/scale-to-width-down/268?cb=20210223202308",
          "age": "Almost 14 years",
          "gender": "Female"
        },
        {
          "name": "Sho/Shawn",
          "url": "https://ghibli.fandom.com/wiki/Sho",
          "description": "Sho (Shawn) Species Human Age 12 years Gender Male First Appearance The Secret World of Arrietty Voice actor (Japanese) Ryūnosuke Kamiki Voice actor (English) Tom Holland Voice actor (Disney) David Henrie",
          "appears_in": [
            "The Secret World of Arrietty"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/0/04/Sho.jpg/revision/latest/scale-to-width-down/268?cb=20210223202406",
          "age": "12 years",
          "gender": "Male"
        },
        {
          "name": "Homily",
          "url": "https://ghibli.fandom.com/wiki/Homily",
          "description": "Homily Japanese name ホミリ ( homiri ) Species Borrower Age Late 40s years Gender Female First Appearance The Secret World of Arrietty Role Supporting character Voice actor (Japanese) Shinobu Otake Voice actor (English) Olivia Coleman Voice actor (Disney) Amy Poehler",
          "appears_in": [
            "The Secret World of Arrietty"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/2/28/Homily_Clock.jpg/revision/latest/scale-to-width-down/268?cb=20171116031638",
          "age": "Late 40s years",
          "gender": "Female"
        },
        {
          "name": "Sadako Maki",
          "url": "https://ghibli.fandom.com/wiki/Sadako_Maki",
          "description": "Sadako Maki Species Human Age 51 years under 53 years Gender Female First Appearance The Secret World of Arrietty Voice actor (Japanese) Keiko Takeshita Voice actor (English) Phyllida Law Voice actor (Disney) Gracie Poletti",
          "appears_in": [
            "The Secret World of Arrietty"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/1/1b/Jessica.jpg/revision/latest/scale-to-width-down/268?cb=20181024000741",
          "age": "51 years under 53 years",
          "gender": "Female"
        },
        {
          "name": "Spiller",
          "url": "https://ghibli.fandom.com/wiki/Spiller",
          "description": "Spiller Species Borrower Age 18 years Gender Male First Appearance The Secret World of Arrietty Voice actor (Japanese) Tatsuya Fujiwara Voice actor (English) Luke Allen-Gale Voice actor (Disney) Moises Arias",
          "appears_in": [
            "The Secret World of Arrietty"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/4/43/Spiller.jpg/revision/latest/scale-to-width-down/268?cb=20210629230507",
          "age": "18 years",
          "gender": "Male"
        },
        {
          "name": "Pod",
          "url": "https://ghibli.fandom.com/wiki/Pod",
          "description": "Arrietty's Father Species Borrowers Age late 40s years Gender Male First Appearance The Secret World of Arrietty Voice actor (Japanese) Miura Tomokazu Voice actor (English) Mark Strong Voice actor (Disney) Will Arnett",
          "appears_in": [
            "The Secret World of Arrietty"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/7/76/Pod.png/revision/latest/scale-to-width-down/268?cb=20181031023404",
          "age": "late 40s years",
          "gender": "Male"
        },
        {
          "name": "Haru",
          "url": "https://ghibli.fandom.com/wiki/Haru",
          "description": "Haru Japanese name ハル ( haru ) Species Human Age 32 years Gender Female First Appearance The Secret World of Arrietty Role Villain Voice actor (Japanese) Kirin Kiki Voice actor (English) Geraldine McEwan Voice actor (Disney) Carol Burnett",
          "appears_in": [
            "The Secret World of Arrietty"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/3/3d/Haru_%28dam%29.jpg/revision/latest/scale-to-width-down/268?cb=20181024034124",
          "age": "32 years",
          "gender": "Female"
        }
      ]
    },
    {
      "title": "The Tale of the Princess Kaguya",
      "url": "https://ghibli.fandom.com/wiki/The_Tale_of_the_Princess_Kaguya",
      "release_year": 2013,
      "director": "Isao Takahata",
      "duration": "137 minutes",
      "description": "The Tale of the Princess Kaguya Japanese theatrical release poster Kanji かぐや姫の物語 Rōmaji Kaguya-hime no Monogatari Directed by Isao Takahata Produced by Yoshiaki Nishimura Screenplay by Isao Takahata Riko Sakaguchi Based on The Tale of the Bamboo Cutter Narrated by Lucy Liu (English) Starring Aki Asakura Kengo Kora Takeo Chii Nobuko Miyamoto Music by Joe Hisaishi Cinematography Keisuke Nakamura Editing by Toshihiko Kojima Studio Studio Ghibli Production Nippon Television Network Dentsu Hakuhodo DYMP Walt Disney Japan Mitsubishi Toho KDDI Distributed by Toho Release date(s) November 23, 2013 Running time 137 minutes Budget ¥5 billion (US$49.3 million) Box office ¥2.5 billion (US$24.2 million) Streaming Platform(s) Max",
      "synopsis": "A bamboo cutter named Sanuki no Miyatsuko discovers a miniature girl inside a glowing bamboo shoot. Believing her to be a divine presence, Miyatsuko and his wife decide to raise her as their own, calling her \"Princess\". The girl grows rapidly and conspicuously, marveling her parents and earning her the nickname \"Takenoko\" (Little Bamboo) from the other children in the village. Sutemaru , the oldest among Kaguya 's friends, develops a particularly close relationship with her. Miyatsuko comes upon gold and fine cloth in the bamboo grove in the same way he found his daughter. He takes these as proof of her divine royalty and begins planning to make her a proper princess. He soon relocates the family to the capital, forcing her to leave her friends behind. She finds herself in a mansion, replete with servants and fine clothes. She is also saddled with a governess who is tasked with taming her into a proper noblewoman. She struggles with the restraints of nobility, arguing that life should be full of laughter and struggle. When the girl comes of age, she is granted the formal name of \"Princess Kaguya \" for the light and life that radiates from her. Miyatsuko holds a celebration in commemoration of Kaguya 's naming. At the celebration, Kaguya overhears party-goers ridiculing her father's attempts to turn a peasant girl into a noble through money. Kaguya flees the capital in despair and runs back to the mountains, seeking Sutemaru and her other friends, but discovers that they have all moved away. Kaguya passes out in the snow and awakens back at the party. Kaguya grows in beauty, attracting scores of would-be suitors. Five men of noble standing court her, comparing her to mythical treasures. Not wanting to marry any of them, Kaguya tells them she will only marry whoever can bring her the mythical treasure mentioned. Two suitors unsuccessfully attempt to persuade her with counterfeits. The third abandons his conquest out of cowardice, and the fourth attempts to woo her wit",
      "poster_url": "https://static.wikia.nocookie.net/studio-ghibli/images/8/87/The_Tale_of_the_Princess_Kaguya.jpg/revision/latest/scale-to-width-down/268?cb=20220414000919",
      "genres": [
        "Adventure",
        "Fantasy",
        "Drama"
      ],
      "characters": []
    },
    {
      "title": "The Wind Rises",
      "url": "https://ghibli.fandom.com/wiki/The_Wind_Rises",
      "release_year": 2013,
      "director": "Hayao Miyazaki",
      "duration": "126 minutes [ 1 ]",
      "description": "The Wind Rises Kanji 風立ちぬ Rōmaji Kaze Tachinu Directed by Hayao Miyazaki Produced by Toshio Suzuki Screenplay by Hayao Miyazaki Based on The Wind Has Risen by Tatsuo Hori Starring Hideaki Anno Miori Takimoto Hidetoshi Nishijima Masahiko Nishimura Steve Alpert Morio Kazama Keiko Takeshita Mirai Shida Jun Kunimura Shinobu Otake Nomura Mansai Music by Joe Hisaishi Cinematography Atsushi Okui Editing by Takeshi Seyama Studio Studio Ghibli Production Nippon Television Network Dentsu Hakuhodo DYMP Walt Disney Japan Mitsubishi Toho KDDI Distributed by Toho Release date(s) 日本語 July 20, 2013 Running time 126 minutes [ 1 ] Budget US$30 million [ 2 ] Box office US$136.5 million [ 3 ] [ 4 ] Streaming Platform(s) Max",
      "synopsis": "The story of Jirō Horikoshi unfolds as a captivating tale of a young boy living in a quaint provincial town in Japan. He dreams of a day when he could design and possibly fly airplanes, as aviation becomes the passion that drives him. However, his dreams are dealt a devastating blow as his eyesight begins to rapidly deteriorate, preventing him from ever piloting an aircraft. Jirō's heart is filled with hopeless longing, and even in his dreams, he faces the haunting vision of falling from the very airplanes he yearns to control. His eyes struggle to withstand the pressure of high altitudes, reinforcing the seemingly insurmountable barriers standing between him and his aspirations. In a desperate quest to overcome his physical weakness and pursue his dreams, Jirō seeks help and guidance from Giovanni Caproni, a famous Italian aircraft designer who appears to him in his reveries. Caproni becomes a mentor and source of inspiration, encouraging Jirō to embrace a different path—that of an aeronautical engineer. With Caproni's wise counsel, Jirō discovers a new purpose for his boundless creativity and love for aircraft. By becoming an aeronautical engineer, he can channel his passion into designing airplanes, transcending the limitations of his eyesight while still contributing significantly to the world of aviation. Determined to become an aeronautical engineer one day, Jirô studies the principles of aviation throughout his academic years, continuously seeking guidance and encouragement from Caproni along the way. By the time he is an adult, he is able to enter the University of Tokyo to study aeronautics. Boarding a train, he makes his way to the Kanto region of Japan. During the journey, he meets Naoko, a young girl traveling with her maid, for the first time. An unprecedented, deadly earthquake suddenly hits the Kanto region, leaving the city in devastation and fire. The passengers inside the train flee from the train, as the damaged boiler threatens to explode. As Jir",
      "poster_url": "https://static.wikia.nocookie.net/studio-ghibli/images/2/2d/The_Wind_Rises.jpg/revision/latest/scale-to-width-down/268?cb=20220209132042",
      "genres": [
        "Adventure",
        "Fantasy",
        "Romance"
      ],
      "characters": [
        {
          "name": "Jiro Horikoshi",
          "url": "https://ghibli.fandom.com/wiki/Jiro_Horikoshi",
          "description": "Jiro Horikoshi Japanese name 堀越 二郎 ( Horikoshi Jirō ) Species Human Age Around 30 years [ 1 ] Gender Male First Appearance The Wind Rises Role Main character Voice actor (Japanese) Hideaki Anno Voice actor (Disney) Joseph Gordon-Levitt Zach Callison (Young)",
          "appears_in": [
            "The Wind Rises"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/d/d7/Jirou_Horikoshi.jpg/revision/latest/scale-to-width-down/268?cb=20210214130814",
          "age": "Around 30 years [ 1 ]",
          "gender": "Male"
        },
        {
          "name": "Naoko Satomi",
          "url": "https://ghibli.fandom.com/wiki/Naoko_Satomi",
          "description": "Naoko Satomi (里見 菜穂子 Satomi Naoko ) is the deuteragonist of The Wind Rises . She becomes the wife of Jirō Horikoshi , which eventually makes her Naoko Horikoshi (堀越 菜穂子 Horikoshi Naoko ).",
          "appears_in": [
            "The Wind Rises"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/d/d9/Nahoko_Satomi.jpg/revision/latest/scale-to-width-down/268?cb=20180212232627",
          "gender": "Female"
        },
        {
          "name": "Kiro Honjo",
          "url": "https://ghibli.fandom.com/wiki/Kiro_Honjo",
          "description": "Kiro Honjo Japanese name 本庄 季郎 ( Honjō Kirō ) Species Human Age Adult Gender Male First Appearance The Wind Rises Role Supporting character Voice actor (Japanese) Hidetoshi Nishija Voice actor (English) John Krasinski",
          "appears_in": [
            "The Wind Rises"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/6/6c/Kiro_Honjo.jpg/revision/latest/scale-to-width-down/268?cb=20210220142714",
          "age": "Adult",
          "gender": "Male"
        },
        {
          "name": "Kurokawa",
          "url": "https://ghibli.fandom.com/wiki/Kurokawa",
          "description": "He is the leader of a group of airplane designers at Mitsubishi Aircraft Company .",
          "appears_in": [
            "The Wind Rises"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/b/bd/Kurokawa.jpg/revision/latest/scale-to-width-down/268?cb=20210220142414",
          "age": "Adult",
          "gender": "Male"
        },
        {
          "name": "Castorp",
          "url": "https://ghibli.fandom.com/wiki/Castorp",
          "description": "Castorp is a supporting character of The Wind Rises film. He is a German gentleman seen in a hotel located in Karuizawa.",
          "appears_in": [
            "The Wind Rises"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/b/b4/Castorp.jpg/revision/latest/scale-to-width-down/268?cb=20210214131228",
          "gender": "Male"
        },
        {
          "name": "Kayo Horikoshi",
          "url": "https://ghibli.fandom.com/wiki/Kayo_Horikoshi",
          "description": "Kayo Horikoshi Species Human Age 2 (prologue) later 10 end of the film 19 Gender Female First Appearance The Wind Rises Role Supporting character Voice actor (Japanese) Mirai Shida Maki Shinta (Child) Voice actor (Disney) Mae Whitman Eva Bella (Young)",
          "appears_in": [
            "The Wind Rises"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/9/91/Kayo_Horikoshi.jpg/revision/latest/scale-to-width-down/268?cb=20210214131318",
          "age": "2 (prologue) later 10 end of the film 19",
          "gender": "Female"
        },
        {
          "name": "Caproni",
          "url": "https://ghibli.fandom.com/wiki/Caproni",
          "description": "Caproni Japanese name カプローニ ( Kapurōni ) Species Human Age 45 Gender Male First Appearance The Wind Rises Role Supporting character Voice actor (Japanese) Nomura Mansai Voice actor (Disney) Stanley Tucci",
          "appears_in": [
            "The Wind Rises"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/6/66/Caproni.jpg/revision/latest/scale-to-width-down/268?cb=20210214131501",
          "age": "45",
          "gender": "Male"
        },
        {
          "name": "Junkers",
          "url": "https://ghibli.fandom.com/wiki/Junkers",
          "description": "Junkers Japanese name フーゴー・ユンカース ( Fūgō Yunkāsu ) Species Human Gender Male First Appearance The Wind Rises Role Supporting character",
          "appears_in": [
            "The Wind Rises"
          ],
          "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/6/6d/Mr_Junkers.jpg/revision/latest?cb=20171119194913",
          "gender": "Male"
        }
      ]
    }
  ],
  "characters": [
    {
      "name": "Pazu",
      "url": "https://ghibli.fandom.com/wiki/Pazu",
      "description": "Pazu Species Human Age 13 years Gender Male First Appearance Castle in the Sky Role Main character Voice actor (Japanese) Mayumi Tanaka Voice actor (English) Barbara Goodson Voice actor (Disney) James Van Der Beek",
      "appears_in": [
        "Castle in the Sky"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/8/8b/Pazu.jpg/revision/latest/scale-to-width-down/268?cb=20210214205023",
      "age": "13 years",
      "gender": "Male"
    },
    {
      "name": "Sheeta",
      "url": "https://ghibli.fandom.com/wiki/Sheeta",
      "description": "Sheeta Japanese name シータ ( Shīta ) Species Human Age 13 years Gender Female Personality Shy Taciturn Kind Curious Intelligent Wise Kind-hearted Polite Innocent First Appearance Castle in the Sky Role Main character Voice actor (Japanese) Keiko Yokozawa Shiori Fujita (child) Voice actor (English) Lara Cody Voice actor (Disney) Anna Paquin Debi Derryberry (young)",
      "appears_in": [
        "Castle in the Sky"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/b/bb/Sheeta_3.png/revision/latest/scale-to-width-down/268?cb=20221030023634",
      "age": "13 years",
      "gender": "Female"
    },
    {
      "name": "Dola",
      "url": "https://ghibli.fandom.com/wiki/Dola",
      "description": "Captain Dola Japanese name ドーラ ( Dōra ) Species Human Age 54 years Gender Female First Appearance Castle in the Sky Role Supporting character Voice actor (Japanese) Kotoe Hatsui Voice actor (English) Rachel Vanowen Voice actor (Disney) Cloris Leachman",
      "appears_in": [
        "Castle in the Sky"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/b/b3/Dola.png/revision/latest/scale-to-width-down/268?cb=20180910230438",
      "age": "54 years",
      "gender": "Female"
    },
    {
      "name": "Charles",
      "url": "https://ghibli.fandom.com/wiki/Charles",
      "description": "Charles Japanese name シャルル ( Sharuru ) Species Human Age 30 years Gender Male First Appearance Castle in the Sky Role Supporting character Voice actor (Japanese) Takuzō Kamiyama Voice actor (English) Barry Stigler Voice actor (Disney) Michael McShane",
      "appears_in": [
        "Castle in the Sky"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/f/f0/Charlie.jpg/revision/latest?cb=20181030030917",
      "age": "30 years",
      "gender": "Male"
    },
    {
      "name": "Louis",
      "url": "https://ghibli.fandom.com/wiki/Louis",
      "description": "Louis Japanese name ルイ ( Rui ) Species Human Age 25 years Gender Male First Appearance Castle in the Sky Role Supporting character Voice actor (Japanese) Yoshito Yasuhara Voice actor (English) Dave Mallow Voice actor (Disney) Mandy Patinkin",
      "appears_in": [
        "Castle in the Sky"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/2/28/Charlies.jpg/revision/latest/scale-to-width-down/268?cb=20181031025246",
      "age": "25 years",
      "gender": "Male"
    },
    {
      "name": "Henri",
      "url": "https://ghibli.fandom.com/wiki/Henri",
      "description": "Henri Species Human Age 20 years Gender Male First Appearance Castle in the Sky Voice actor (Japanese) Sukekiyo Kameyama Voice actor (English) Eddie Frierson (as Ernest Fessler) Voice actor (Disney) Andy Dick",
      "appears_in": [
        "Castle in the Sky"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/1/15/Henri.jpg/revision/latest/scale-to-width-down/268?cb=20181024031333",
      "age": "20 years",
      "gender": "Male"
    },
    {
      "name": "Motro",
      "url": "https://ghibli.fandom.com/wiki/Motro",
      "description": "Hara Motro (ハラ・モトロ, Hara Motoro ) is a character from Castle in the Sky . He is Dola's husband and works on board the airship Tiger Moth as its engineer.",
      "appears_in": [
        "Castle in the Sky"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/5/55/Castle_in_the_Sky_Motro.webp/revision/latest?cb=20250712130835",
      "age": "54 years",
      "gender": "Male"
    },
    {
      "name": "Muska",
      "url": "https://ghibli.fandom.com/wiki/Muska",
      "description": "Romska Palo Ul Laputa Species Human Age 32 years Gender Male First Appearance Castle in the Sky Voice actor (Japanese) Minori Terada Voice actor (English) Jeff Winkless Voice actor (Disney) Mark Hamill",
      "appears_in": [
        "Castle in the Sky"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/d/d5/Muska.jpg/revision/latest/scale-to-width-down/268?cb=20210516132909",
      "age": "32 years",
      "gender": "Male"
    },
    {
      "name": "General Muoro",
      "url": "https://ghibli.fandom.com/wiki/Muoro",
      "description": "General Muoro is the secondary villain in Castle in the Sky . Muoro is a general in the army and is Colonel Muska 's subordinate.",
      "appears_in": [
        "Castle in the Sky"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/1/12/Muoro.jpg/revision/latest/scale-to-width-down/268?cb=20210516135925",
      "age": "34 years (deceased)",
      "gender": "Male"
    },
    {
      "name": "Uncle Pom",
      "url": "https://ghibli.fandom.com/wiki/Uncle_Pom",
      "description": "Uncle Pom is a stocky, elderly man with wild, white hair and a bushy mustache and beard. He wears a cap, a worn and patched coat and a knapsack. Uncle Pom also carries lots of supplies for life in the mine, such as a bedroll, canteen, and lantern.",
      "appears_in": [
        "Castle in the Sky"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/d/de/Uncle_Pom.png/revision/latest/scale-to-width-down/268?cb=20180809131657",
      "age": "86 years",
      "gender": "Male"
    },
    {
      "name": "Earwig/Aya/Erica",
      "url": "https://ghibli.fandom.com/wiki/Earwig",
      "description": "Earwig , also referred to as Aya Tseru (アーヤ・ツール, Āya Tsūru ) or Erica depending on translation, is the titular main protagonist of Earwig and the Witch .",
      "appears_in": [
        "Earwig and the Witch"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/d/df/Earwig.jpg/revision/latest/scale-to-width-down/268?cb=20220427170000",
      "age": "10 years",
      "gender": "Female"
    },
    {
      "name": "Bella Yaga",
      "url": "https://ghibli.fandom.com/wiki/Bella_Yaga",
      "description": "Bella Yaga (ベラ・ヤーガ, Bera Yāga ) is the main antagonist of the film Earwig and the Witch . She is the Earwig 's adoptive mother.",
      "appears_in": [
        "Earwig and the Witch"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/d/dd/Aya_3.jpg/revision/latest/scale-to-width-down/268?cb=20210319034747",
      "age": "32 years",
      "gender": "female"
    },
    {
      "name": "Mandrake",
      "url": "https://ghibli.fandom.com/wiki/Mandrake",
      "description": "Mandrake (マンドレーク, Mandorēku ) is a character in the film Earwig and the Witch . He is a former band member who lives with Bella Yaga who adopt Earwig .",
      "appears_in": [
        "Earwig and the Witch"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/9/99/Mandrake.jpeg/revision/latest/scale-to-width-down/268?cb=20210812212831",
      "age": "34 years",
      "gender": "Male"
    },
    {
      "name": "Earwig's Mother",
      "url": "https://ghibli.fandom.com/wiki/Earwig%27s_Mother",
      "description": "Earwig's mother is the overarching protagonist of the film Earwig and the Witch .",
      "appears_in": [
        "Earwig and the Witch"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/f/f0/Aya_1.jpeg/revision/latest/scale-to-width-down/268?cb=20210319034705",
      "age": "33 years",
      "gender": "Female"
    },
    {
      "name": "Thomas",
      "url": "https://ghibli.fandom.com/wiki/Thomas",
      "description": "Thomas (トーマス, Tōmasu ) is Bella Yaga 's cat in the film Earwig and the Witch .",
      "appears_in": [
        "Earwig and the Witch"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/f/f2/Thomas.jpg/revision/latest/scale-to-width-down/267?cb=20221107195948",
      "age": "9 years",
      "gender": "Male"
    },
    {
      "name": "Custard",
      "url": "https://ghibli.fandom.com/wiki/Custard",
      "description": "Custard (カスタード, Kasutādo ) is Earwig's best friend at the orphanage in the film Earwig and the Witch .",
      "appears_in": [
        "Earwig and the Witch"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/7/7c/Custard.webp/revision/latest?cb=20230420112840",
      "age": "11 years",
      "gender": "Male"
    },
    {
      "name": "Matron",
      "url": "https://ghibli.fandom.com/wiki/Matron",
      "description": "Matron is the head of the St. Morwald's Home for Children in the film Earwig and the Witch .",
      "appears_in": [
        "Earwig and the Witch"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/1/1d/Matron.webp/revision/latest?cb=20230420113758",
      "age": "41 years",
      "gender": "Female"
    },
    {
      "name": "Thelma",
      "url": "https://ghibli.fandom.com/wiki/Thelma",
      "description": "Thelma lives at the St. Morwald's Home for Children as one of the main caretakers in the film Earwig and the Witch .",
      "appears_in": [
        "Earwig and the Witch"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/e/eb/Thelma.webp/revision/latest?cb=20230420113129",
      "gender": "Female"
    },
    {
      "name": "Seita",
      "url": "https://ghibli.fandom.com/wiki/Seita_Yokokawa",
      "description": "Seita Yokokawa Species Human (Spirit) Age 14 years Gender Male First Appearance Grave of the Fireflies Role Main character Voice actor (Japanese) Tsutomu Tatsumi Voice actor (CPM) J. Robert Spencer Voice actor (Sentai) Adam Gibbs Voice actor (Netflix) Lucas Jaye",
      "appears_in": [
        "Grave of the Fireflies"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/2/21/Seita_Yokokawa.jpg/revision/latest/scale-to-width-down/268?cb=20210215103515",
      "age": "14 years",
      "gender": "Male"
    },
    {
      "name": "Setsuko",
      "url": "https://ghibli.fandom.com/wiki/Setsuko_Yokokawa",
      "description": "Setsuko Yokokawa Species Human (Spirit) Age 4 years (death of deceased) Gender Female First Appearance Grave of the Fireflies Voice actor (Japanese) Ayano Shirashi Voice actor (CPM) Rhoda Chrosite Voice actor (Sentai) Emily Neves Voice actor (Netflix) Luna Hamilton",
      "appears_in": [
        "Grave of the Fireflies"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/a/a8/Setsuko_Yokokawa.jpg/revision/latest/scale-to-width-down/268?cb=20210215103612",
      "age": "4 years (death of deceased)",
      "gender": "Female"
    },
    {
      "name": "Seita's aunt",
      "url": "https://ghibli.fandom.com/wiki/Seita%27s_aunt",
      "description": "Aunt Yokokawa Species Human Gender Female First Appearance Grave of the Fireflies Role Supporting character Voice actor (Japanese) Akemi Yamaguchi Voice actor (CPM) Amy Jones Voice actor (Sentai) Marcy Bannor Voice actor (Netflix) Ren Hanami",
      "appears_in": [
        "Grave of the Fireflies"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/1/1b/Seita_Aunt.jpg/revision/latest/scale-to-width-down/267?cb=20110701062623",
      "gender": "Female"
    },
    {
      "name": "Farmer",
      "url": "https://ghibli.fandom.com/wiki/Farmer_(Grave_of_the_Fireflies)",
      "description": "Farmer (Grave of the Fireflies) Species Human Gender Male First Appearance Grave of the Fireflies Voice actor (CPM) Dan Green",
      "appears_in": [
        "Grave of the Fireflies"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/3/3d/Farmer.png/revision/latest/scale-to-width-down/268?cb=20220128103118",
      "gender": "Male"
    },
    {
      "name": "Howl",
      "url": "https://ghibli.fandom.com/wiki/Howl",
      "description": "Howl Jenkins Pendragon Japanese name ハウル ( Hauru ) Species Wizard Age Unknown (film) 27 years (original novel) Gender Male First Appearance Howl's Moving Castle Role Deuteragonist Voice actor (Japanese) Takuya Kimura Voice actor (English) Christian Bale",
      "appears_in": [
        "Howl's Moving Castle"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/f/fe/Howl_Jenkins_Pendragon.jpg/revision/latest/scale-to-width-down/268?cb=20200423183516",
      "age": "Unknown (film) 27 years (original novel)",
      "gender": "Male"
    },
    {
      "name": "Sophie Hatter",
      "url": "https://ghibli.fandom.com/wiki/Sophie",
      "description": "Sophie Hatter Young Elder Bob cut Starlight Japanese name ソフィー・ハッター ( Sofī Hattā ) Species Human Age 18 years (only prologue and after being cured of her curse) 90 years (after she get cursed by Witch of the Waste ) Gender Female First Appearance Howl's Moving Castle Role Main protagonist Voice actor (Japanese) Chieko Baisho Voice actor (Disney) Emily Mortimer (young) Jean Simmons (old)",
      "appears_in": [
        "Howl's Moving Castle"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/f/f4/Sophie_short_hair.jpg/revision/latest/scale-to-width-down/268?cb=20210708010401",
      "age": "18 years (only prologue and after being cured of her curse) 90 years (after she get cursed by Witch of the Waste )",
      "gender": "Female"
    },
    {
      "name": "Witch of the Waste",
      "url": "https://ghibli.fandom.com/wiki/Witch_of_the_Waste",
      "description": "Witch of the Waste Species Witch/Human Age 273 years Gender Female First Appearance Howl's Moving Castle Role Secondary villain (formerly) Supporting character Voice actor (Japanese) Akihiro Miwa Voice actor (Disney) Lauren Bacall",
      "appears_in": [
        "Howl's Moving Castle"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/3/3f/The_Witch.jpg/revision/latest?cb=20170829232306",
      "age": "273 years",
      "gender": "Female"
    },
    {
      "name": "Calcifer",
      "url": "https://ghibli.fandom.com/wiki/Calcifer",
      "description": "Calcifer Japanese name カルシファー ( Karushifā ) Species Demon (originally Star Children ) Gender Male First Appearance Howl's Moving Castle Role Supporting character Voice actor (Japanese) Tatsuya Gashuin Voice actor (Disney) Billy Crystal",
      "appears_in": [
        "Howl's Moving Castle"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/2/2a/Calcifer.png/revision/latest/scale-to-width-down/268?cb=20110705204516",
      "gender": "Male"
    },
    {
      "name": "Markl",
      "url": "https://ghibli.fandom.com/wiki/Markl",
      "description": "Markl Japanese name マルクル ( markl ) Species Human (Wizard) Age 10 years Gender Male First Appearance Howl's Moving Castle Role Supporting character Voice actor (Japanese) Ryūnosuke Kamiki Voice actor (Disney) Josh Hutcherson",
      "appears_in": [
        "Howl's Moving Castle"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/5/5d/Markl.jpg/revision/latest/scale-to-width-down/268?cb=20210707005535",
      "age": "10 years",
      "gender": "Male"
    },
    {
      "name": "Turnip Head",
      "url": "https://ghibli.fandom.com/wiki/Turnip_Head",
      "description": "Turnip Head, (かかしのカブ , Kakashi no Kabu , lit. \"Scarecrow Turnip\" ), credited in the film as Turnip and known in the original novels as Prince Justin , is a character in the film, Howl's Moving Castle . He follows Sophie after she rescues him on her way to the wasteland .",
      "appears_in": [
        "Howl's Moving Castle"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/e/e7/Turnip-Head-In-Howls-Moving-Castle.jpg/revision/latest/scale-to-width-down/268?cb=20210707050624",
      "age": "20 years - 30 years",
      "gender": "Male"
    },
    {
      "name": "Suliman",
      "url": "https://ghibli.fandom.com/wiki/Suliman",
      "description": "Madame Suliman (サリマン , Sariman ) is a main villain the film, Howl's Moving Castle . She is the court-appointed sorceress and mastermind behind the King . Saddened by her former talented disciple Howl for leaving her, she keeps a close watch over him as a potential archenemy. She has a loyal henchdog named Heen . She is voiced by Haruko Katō in the Japanese version and Blythe Danner in the Disney dub.",
      "appears_in": [
        "Howl's Moving Castle"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/6/64/Madame_Suliman.png/revision/latest/scale-to-width-down/268?cb=20181015234604",
      "age": "70 years - 80 years",
      "gender": "Female"
    },
    {
      "name": "Heen",
      "url": "https://ghibli.fandom.com/wiki/Heen",
      "description": "Heen (ヒン, Hin ) is a character in Howl's Moving Castle . He is an \"errand dog\" of Suliman and was created solely for the film adaptation. He is voiced by Daijirō Harada, who has said Heen's gasping noise sounds like a person with asthma.",
      "appears_in": [
        "Howl's Moving Castle"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/a/a7/Heen.png/revision/latest/scale-to-width-down/268?cb=20110704002033",
      "gender": "Male"
    },
    {
      "name": "Kiki",
      "url": "https://ghibli.fandom.com/wiki/Kiki",
      "description": "Kiki Japanese name キキ ( Kiki ) Species Human (Witch) Age 13 years Gender Female Personality Adventurer Adorable Kind Curious Cute Dramatic Intelligent Kind-hearted Childish Very Friendly Polite Innocent Sweet Upbeat First Appearance Kiki's Delivery Service Role Main character Voice actor (Japanese) Minami Takayama Voice actor (Streamline) Lisa Michelson Voice actor (Disney) Kirsten Dunst",
      "appears_in": [
        "Kiki's Delivery Service"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/5/59/Kiki.jpg/revision/latest/scale-to-width-down/268?cb=20210214125850",
      "age": "13 years",
      "gender": "Female"
    },
    {
      "name": "Jiji",
      "url": "https://ghibli.fandom.com/wiki/Jiji",
      "description": "Jiji Species Cat Age 13 years (From the Picture Book) Gender Male First Appearance Kiki's Delivery Service Role Supporting character Voice actor (Japanese) Rei Sakuma Voice actor (Streamline) Kerrigan Mahan Voice actor (Disney) Phil Hartman",
      "appears_in": [
        "Kiki's Delivery Service"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/b/b4/Jiji.jpg/revision/latest/scale-to-width-down/268?cb=20210218143145",
      "age": "13 years (From the Picture Book)",
      "gender": "Male"
    },
    {
      "name": "Okino",
      "url": "https://ghibli.fandom.com/wiki/Okino",
      "description": "Okino ( オキノ ) is a side character in Kiki's Delivery Service . He is a father of Kiki and a husband of Kokiri .",
      "appears_in": [
        "Kiki's Delivery Service"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/8/80/Okino.jpg/revision/latest/scale-to-width-down/268?cb=20210218142837",
      "age": "35 years",
      "gender": "Male"
    },
    {
      "name": "Kokiri",
      "url": "https://ghibli.fandom.com/wiki/Kokiri",
      "description": "Kokiri Species Human (Witch) Age 36 years Gender Female First Appearance Kiki's Delivery Service Voice actor (Japanese) Mieko Nobusawa Voice actor (Streamline) Barbara Goodson Voice actor (Disney) Kath Soucie",
      "appears_in": [
        "Kiki's Delivery Service"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/7/72/Kokiri.jpg/revision/latest/scale-to-width-down/268?cb=20210218142759",
      "age": "36 years",
      "gender": "Female"
    },
    {
      "name": "Osono",
      "url": "https://ghibli.fandom.com/wiki/Osono",
      "description": "Osono (おソノ , Osono ) is a baker and proprietor of Gütiokipänjä , as seen in the film, Kiki's Delivery Service . She is married to Fukuo , a fellow baker.",
      "appears_in": [
        "Kiki's Delivery Service"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/3/3a/Osono.jpg/revision/latest/scale-to-width-down/268?cb=20210218143020",
      "gender": "Female"
    },
    {
      "name": "Osono's Husband",
      "url": "https://ghibli.fandom.com/wiki/Fukuo",
      "description": "Fukuo Species Human Age Adult Gender Male First Appearance Kiki's Delivery Service Role Supporting character Voice actor (Japanese) Koichi Yamadera Voice actor (Streamline) Gregory Snegoff Voice actor (Disney) John Hostetter",
      "appears_in": [
        "Kiki's Delivery Service"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/2/29/Fukuo.jpg/revision/latest/scale-to-width-down/268?cb=20210218143410",
      "age": "Adult",
      "gender": "Male"
    },
    {
      "name": "Mary Smith",
      "url": "https://ghibli.fandom.com/wiki/Mary_Smith",
      "description": "Mary Smith is the main protagonist in the film: Mary and the Witch's Flower directed by Hiromasa Yonebayashi and produced by Studio Ponoc . Her Seiyū was Hana Sugisaki.",
      "appears_in": [
        "Mary and the Witch's Flower"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/b/b6/Mary_Smith.jpg/revision/latest/scale-to-width-down/268?cb=20210420135816",
      "age": "11 years (April 19th)",
      "gender": "Female"
    },
    {
      "name": "Peter",
      "url": "https://ghibli.fandom.com/wiki/Peter",
      "description": "Peter is the deuteragonist in the film Mary and the Witch's Flower .",
      "appears_in": [
        "Mary and the Witch's Flower"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/1/13/Peter.jpg/revision/latest?cb=20170703153239",
      "age": "12 years",
      "gender": "Male"
    },
    {
      "name": "Tib",
      "url": "https://ghibli.fandom.com/wiki/Tib",
      "description": "Tib (ティブ, Tibu ) is one of pet cats of Peter appeared in Mary and the Witch's Flower . He is also a companion of Mary . He and Gib are very close, and Zebedee suspects that they are mates.",
      "appears_in": [
        "Mary and the Witch's Flower"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/0/05/Cat.png/revision/latest/scale-to-width-down/268?cb=20170330144347",
      "age": "6 years",
      "gender": "Male"
    },
    {
      "name": "Gib",
      "url": "https://ghibli.fandom.com/wiki/Gib",
      "description": "Gib (ギブ, Gibu ) is one of Peter 's pet cats who appears in Mary and the Witch's Flower . She and Tib are very close, and Zebedee suspects that they are mates.",
      "appears_in": [
        "Mary and the Witch's Flower"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/c/cb/Gib.jpeg/revision/latest/scale-to-width-down/268?cb=20230417011444",
      "age": "5 years",
      "gender": "Female"
    },
    {
      "name": "Charlotte",
      "url": "https://ghibli.fandom.com/wiki/Charlotte",
      "description": "Charlotte Species Witch Age 71 years Gender Female First Appearance Mary and the Witch's Flower Voice actor (Japanese) Shinobu Otake Hikari Mitsushima (young) Voice actor (English) Lynda Baron Teresa Gallagher (young)",
      "appears_in": [
        "Mary and the Witch's Flower"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/2/21/Charlotte.jpg/revision/latest?cb=20180507184432",
      "age": "71 years",
      "gender": "Female"
    },
    {
      "name": "Flanagan",
      "url": "https://ghibli.fandom.com/wiki/Flanagan",
      "description": "Danny Flanagan Japanese name ダニー・フラナガン ( Danī Furanagan ) Species Scottish Mouse (Wizard) Age 27 years Gender Male First Appearance Mary and the Witch's Flower Voice actor (Japanese) Jiro Sato Voice actor (Disney) Ewen Bremner",
      "appears_in": [
        "Mary and the Witch's Flower"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/e/ed/Flanagan.jpg/revision/latest/scale-to-width-down/268?cb=20181121035509",
      "age": "27 years",
      "gender": "Male"
    },
    {
      "name": "Confucius",
      "url": "https://ghibli.fandom.com/wiki/Confucius",
      "description": "Confucius Japanese name コンフューシャス ( Konfūshasu ) Species Dog Age 5 years Gender Male First Appearance Mary and the Witch's Flower",
      "appears_in": [
        "Mary and the Witch's Flower"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/c/ca/Confucius.jpg/revision/latest/scale-to-width-down/268?cb=20230417012751",
      "age": "5 years",
      "gender": "Male"
    },
    {
      "name": "Madam Mumblechook",
      "url": "https://ghibli.fandom.com/wiki/Madam_Mumblechook",
      "description": "Madame Mumblechook is the secret main villain in the Studio Ponoc film, Mary and the Witch's Flower .",
      "appears_in": [
        "Mary and the Witch's Flower"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/4/4f/Madam_Mumblechook.jpg/revision/latest/scale-to-width-down/267?cb=20200401230001",
      "age": "110 years - 120 years",
      "gender": "Female"
    },
    {
      "name": "Satsuki Kusakabe",
      "url": "https://ghibli.fandom.com/wiki/Satsuki_Kusakabe",
      "description": "Satsuki Kusakabe Japanese name 草壁 サツキ ( Kusakabe Satsuki ) Species Human Age 10 years Gender Female First Appearance My Neighbor Totoro Second Appearance Mei and the Kittenbus Role Main character Voice actor (Japanese) Noriko Hidaka Voice actor (Streamline) Lisa Michelson Voice actor (Disney) Dakota Fanning",
      "appears_in": [
        "My Neighbor Totoro"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/f/f2/Satsuki_Kusakabe.jpg/revision/latest/scale-to-width-down/268?cb=20210215103238",
      "age": "10 years",
      "gender": "Female"
    },
    {
      "name": "Mei Kusakabe",
      "url": "https://ghibli.fandom.com/wiki/Mei_Kusakabe",
      "description": "Mei Kusakabe Japanese name 草壁 メイ ( Mei Kusakabe ) Species Human Age 4 years Gender Female First Appearance My Neighbor Totoro Second Appearance Mei and the Kittenbus Role Main character Voice actor (Japanese) Chika Sakamoto Voice actor (Streamline) Cheryl Chase Voice actor (Disney) Elle Fanning",
      "appears_in": [
        "My Neighbor Totoro"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/0/01/Mei_Kusakabe.jpg/revision/latest/scale-to-width-down/268?cb=20181012193530",
      "age": "4 years",
      "gender": "Female"
    },
    {
      "name": "Tatsuo Kusakabe",
      "url": "https://ghibli.fandom.com/wiki/Tatsuo_Kusakabe",
      "description": "Tatsuo Kusakabe Species Human Age 32 years Gender Male First Appearance My Neighbor Totoro Second Appearance Mei and the Kittenbus Voice actor (Japanese) Shigesato Itoi Voice actor (Streamline) Gregory Snegoff Voice actor (Disney) Tim Daly",
      "appears_in": [
        "My Neighbor Totoro"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/d/d6/Tatsuo_Kusakabe.jpg/revision/latest/scale-to-width-down/268?cb=20210215101114",
      "age": "32 years",
      "gender": "Male"
    },
    {
      "name": "Yasuko Kusakabe",
      "url": "https://ghibli.fandom.com/wiki/Yasuko_Kusakabe",
      "description": "Yasuko Kusakabe is a supporting character in My Neighbor Totoro . She is the mother of Satsuki and Mei Kusakabe and sister in law of satsuki and Mei's auntie, and the wife of Tatsuo Kusakabe . Presumably, she suffers from tuberculosis ; her sickness being the reason why she and her family moved to the rural country side. She was admitted to the local hospital which offered the best care for the illness, and the family decided it would be best for her to recuperate in a more fresh and sunny environment.",
      "appears_in": [
        "My Neighbor Totoro"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/7/7b/Yasuko_Kusakabe.png/revision/latest/scale-to-width-down/268?cb=20110705210532",
      "age": "29 years",
      "gender": "Female"
    },
    {
      "name": "Totoro",
      "url": "https://ghibli.fandom.com/wiki/Totoro",
      "description": "Big Totoro Japanese name 大トトロ ( Ō Totoro ) Species Totoro Tribe or Kodama (Tree Spirit) Age ~1,302 years or more than 3,000 years Gender Male First Appearance My Neighbor Totoro Second Appearance Mei and the Kittenbus Voice actor (Japanese) Hitoshi Takagi Voice actor (Disney) Frank Welker",
      "appears_in": [
        "My Neighbor Totoro"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/d/df/Totoro_in_the_rain.png/revision/latest/scale-to-width-down/268?cb=20200831205004",
      "age": "~1,302 years or more than 3,000 years",
      "gender": "Male"
    },
    {
      "name": "Catbus",
      "url": "https://ghibli.fandom.com/wiki/Catbus",
      "description": "Catbus Japanese name ネコバス ( Nekobasu ) Species Catbus First Appearance My Neighbor Totoro Second Appearance Mei and the Kittenbus Role Supporting character Voice actor (Japanese) Naoko Matsui Voice actor (Streamline) Carl Macek Voice actor (Disney) Frank Welker",
      "appears_in": [
        "My Neighbor Totoro"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/3/30/Catbus.jpg/revision/latest/scale-to-width-down/268?cb=20181024032653"
    },
    {
      "name": "Medium Totoro",
      "url": "https://ghibli.fandom.com/wiki/Smaller_Totoros",
      "description": "Smaller Totoros are kinds of Totoro in My Neighbor Totoro .",
      "appears_in": [
        "My Neighbor Totoro"
      ]
    },
    {
      "name": "Granny",
      "url": "https://ghibli.fandom.com/wiki/Granny",
      "description": "Not to be confused with Nanny . Granny Japanese name 祖母 ( sobo ) Species Human Gender Female First Appearance My Neighbor Totoro Role Supporting character Voice actor (Japanese) Tanie Kitabayashi Voice actor (Streamline) Natalie Core Voice actor (Disney) Pat Carroll",
      "appears_in": [
        "My Neighbor Totoro"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/d/d9/Granny.png/revision/latest/scale-to-width-down/268?cb=20180815142833",
      "gender": "Female"
    },
    {
      "name": "Kanta",
      "url": "https://ghibli.fandom.com/wiki/Kanta_%C5%8Cgaki",
      "description": "Kanta Japanese name 大垣寛太 ( Ōgaki Kanta ) Species Human Age 10 years Gender Male First Appearance My Neighbor Totoro Role Supporting character Voice actor (Japanese) Toshiyuki Amagasa Voice actor (Streamline) Kenneth Hartman Voice actor (Disney) Paul Butcher",
      "appears_in": [
        "My Neighbor Totoro"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/c/c3/Kanta.jpg/revision/latest?cb=20211030200118",
      "age": "10 years",
      "gender": "Male"
    },
    {
      "name": "Taku Morisaki",
      "url": "https://ghibli.fandom.com/wiki/Taku_Morisaki",
      "description": "Taku has dark brown hair and brown eyes. He wears a white shirt and green tie as part of the Japanese school uniform. During the school year, he wears a light pink shirt and white T-shirt and blue",
      "appears_in": [
        "Ocean Waves"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/7/73/Taku.png/revision/latest/scale-to-width-down/268?cb=20120102013114",
      "age": "16-18",
      "gender": "Male"
    },
    {
      "name": "Rikako Muto",
      "url": "https://ghibli.fandom.com/wiki/Rikako_Muto",
      "description": "Rikako Muto ( 武藤 里伽子 , Mutō Rikako ) is the main character of Ocean Waves film.",
      "appears_in": [
        "Ocean Waves"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/5/59/Rikako.jpg/revision/latest/scale-to-width-down/268?cb=20181029025300",
      "age": "16 years - 18 years",
      "gender": "Female"
    },
    {
      "name": "Yutaka Matsuno",
      "url": "https://ghibli.fandom.com/wiki/Yutaka_Matsuno",
      "description": "Yutaka Matsuno is a friend of Taku Morisaki in Ocean Waves .",
      "appears_in": [
        "Ocean Waves"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/f/f9/Yutaka.jpg/revision/latest?cb=20181024033800",
      "age": "16-18",
      "gender": "Male"
    },
    {
      "name": "Yumi Kohama",
      "url": "https://ghibli.fandom.com/wiki/Yumi_Kohama",
      "description": "Yumi Kohama (小浜 裕実, Kohama Yumi ) is a minor character of Ocean Waves film. She is a closest friend of Rikako Muto .",
      "appears_in": [
        "Ocean Waves"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/e/ed/Yumi.jpg/revision/latest/scale-to-width-down/268?cb=20181031014446",
      "age": "12 or 13",
      "gender": "Female"
    },
    {
      "name": "Akiko Shimizu",
      "url": "https://ghibli.fandom.com/wiki/Akiko_Shimizu",
      "description": "Akiko Shimizu (清水 明子, Shimizu Akiko ) is a supporting character in Ocean Waves . She is Taku Morisaki 's classmate.",
      "appears_in": [
        "Ocean Waves"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/7/7c/Shimizu_Akiko.png/revision/latest/scale-to-width-down/268?cb=20181030025046",
      "age": "16 years (Born March 27th)",
      "gender": "Female"
    },
    {
      "name": "Okada",
      "url": "https://ghibli.fandom.com/wiki/Okada",
      "description": "Okada (岡田) is a character from Ocean Waves . He is the ex-boyfriend of Rikako Muto .",
      "appears_in": [
        "Ocean Waves"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/2/25/Okada.jpg/revision/latest/scale-to-width-down/268?cb=20181209095752",
      "gender": "Male"
    },
    {
      "name": "Tadashi Yamao",
      "url": "https://ghibli.fandom.com/wiki/Tadashi_Yamao",
      "description": "Tadashi Yamao is a character in Studio Ghibli's Television film Ocean Waves . He is friend of Taku and Yutaka .",
      "appears_in": [
        "Ocean Waves"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/2/28/Yamao.png/revision/latest/scale-to-width-down/268?cb=20181031000851",
      "gender": "Male"
    },
    {
      "name": "Ponyo",
      "url": "https://ghibli.fandom.com/wiki/Ponyo_(character)",
      "description": "Ponyo (ポニョ , Ponyo ), named Brunhilde (ブリュンヒルデ, Bryun-Hirude ) at birth, is the 5-year old protagonist of the film, Ponyo . She is a goldfish born from the sea goddess mother Granmamare and a human named father Fujimoto . She is known to liked both Sōsuke and ham.",
      "appears_in": [
        "Ponyo"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/b/bc/Brunhilda.png/revision/latest/scale-to-width-down/268?cb=20201016144049",
      "age": "5 years",
      "gender": "Female"
    },
    {
      "name": "Sôsuke",
      "url": "https://ghibli.fandom.com/wiki/Sosuke",
      "description": "This article is about a character from Ponyo . For information about the Pom Poko character with a similar name, see Sasuke . And My Neighbor Totoro character: Satsuki",
      "appears_in": [
        "Ponyo"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/c/cf/Sosuke.jpg/revision/latest/scale-to-width-down/268?cb=20181017002729",
      "age": "5 years",
      "gender": "Male"
    },
    {
      "name": "Lisa",
      "url": "https://ghibli.fandom.com/wiki/Lisa",
      "description": "Lisa Japanese name Risa ( Risa ) Species Human Age 25 years Gender Female First Appearance Ponyo on the Cliff by the Sea Role Supporting character Voice actor (Japanese) Tomoko Yamaguchi Voice actor (Disney) Tina Fey",
      "appears_in": [
        "Ponyo"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/5/59/Lisa.png/revision/latest/scale-to-width-down/268?cb=20110709024926",
      "age": "25 years",
      "gender": "Female"
    },
    {
      "name": "Koichi",
      "url": "https://ghibli.fandom.com/wiki/Koichi",
      "description": null,
      "appears_in": [
        "Ponyo"
      ]
    },
    {
      "name": "Fujimoto",
      "url": "https://ghibli.fandom.com/wiki/Fujimoto",
      "description": "Fujimoto Species Human (formerly) Wizard Age At least 40 years Gender Male First Appearance Ponyo on the Cliff by the Sea Role Sea Wizard Voice actor (Japanese) Joji Tokoro Voice actor (Disney) Liam Neeson",
      "appears_in": [
        "Ponyo"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/4/4b/Fujimoto.jpg/revision/latest/scale-to-width-down/268?cb=20181017020509",
      "age": "At least 40 years",
      "gender": "Male"
    },
    {
      "name": "Granmamare",
      "url": "https://ghibli.fandom.com/wiki/Granmamare",
      "description": "Granmammare Japanese name グランマンマーレ ( Granmammare ) Species Deity Goddess Age 600 years Immortal Gender Female First Appearance Ponyo Role Supporting character Voice actor (Japanese) Yuki Amami Voice actor (Disney) Cate Blanchett",
      "appears_in": [
        "Ponyo"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/4/43/Granmammare.png/revision/latest/scale-to-width-down/268?cb=20181029034955",
      "age": "600 years Immortal",
      "gender": "Female"
    },
    {
      "name": "Yoshie",
      "url": "https://ghibli.fandom.com/wiki/Yoshie",
      "description": "Yoshie (ヨシエ , Yoshie ) is one of the Senior Center inhabitants in the film, Ponyo .",
      "appears_in": [
        "Ponyo"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/3/3f/Yoshie.jpg/revision/latest/scale-to-width-down/268?cb=20181030230031",
      "age": "68 years",
      "gender": "Female"
    },
    {
      "name": "Noriko",
      "url": "https://ghibli.fandom.com/wiki/Noriko",
      "description": "Noriko is one of old aunts on the 2008 film, Ponyo . She lives on Senior Local Center, where Lisa works.",
      "appears_in": [
        "Ponyo"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/3/34/Noriko.jpg/revision/latest?cb=20181024003358",
      "age": "70 years",
      "gender": "Female"
    },
    {
      "name": "Toki",
      "url": "https://ghibli.fandom.com/wiki/Toki_(Ponyo)",
      "description": "Toki (トキ , Toki ) is an elderly woman from Ponyo . She lives in the Local Senior Center along with Noriko and Yoshie .",
      "appears_in": [
        "Ponyo"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/9/94/Toki.jpg/revision/latest/scale-to-width-down/268?cb=20181023134956",
      "age": "72 years",
      "gender": "Female"
    },
    {
      "name": "Porco Rosso / Marco Pagot",
      "url": "https://ghibli.fandom.com/wiki/Marco_Pagot",
      "description": "Marco Pagot Species Human (formerly) Pig Age 37 years Gender Male First Appearance Porco Rosso Role Main character Voice actor (Japanese) Shuichiro Moriyama Voice actor (English) Ward Sexton Voice actor (Disney) Michael Keaton",
      "appears_in": [
        "Porco Rosso"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/0/02/Porcellino%21.png/revision/latest/scale-to-width-down/268?cb=20200915124341",
      "age": "37 years",
      "gender": "Male"
    },
    {
      "name": "Madame Gina",
      "url": "https://ghibli.fandom.com/wiki/Gina",
      "description": "Gina Japanese name ジーナ ( Gina ) Species Human Age circa 23 years - 35 years Gender Female First Appearance Porco Rosso Role Supporting character Voice actor (Japanese) Tokiko Kato Voice actor (English) Faith Bach Voice actor (Disney) Susan Egan",
      "appears_in": [
        "Porco Rosso"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/e/eb/Gina.jpg/revision/latest?cb=20210311172727",
      "age": "circa 23 years - 35 years",
      "gender": "Female"
    },
    {
      "name": "Fio Piccolo",
      "url": "https://ghibli.fandom.com/wiki/Fio_Piccolo",
      "description": "Fio Piccolo Japanese name フィオ・ピッコロ ( Fio Pikkoro ) Species Human Age 17 years Gender Female First Appearance Porco Rosso Role Main character Voice actor (Japanese) Akemi Okamura Voice actor (English) Lynn Eve Harris Voice actor (Disney) Kimberly Williams-Paisley",
      "appears_in": [
        "Porco Rosso"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/c/c2/Fio_Piccolo.jpg/revision/latest?cb=20210311172537",
      "age": "17 years",
      "gender": "Female"
    },
    {
      "name": "Grandpa Piccolo",
      "url": "https://ghibli.fandom.com/wiki/Mr._Piccolo",
      "description": "Mr. Piccolo (ピッコロのおやじ , Pikkoro no Ooyaji ) is the grandfather of Fio Piccolo and Porco Rosso's personal mechanic in the film Porco Rosso . He first appeared on The Age of the Flying Boat .",
      "appears_in": [
        "Porco Rosso"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/0/0e/Mr_Piccolo.jpg/revision/latest/scale-to-width-down/268?cb=20181009193523",
      "gender": "Male"
    },
    {
      "name": "Capo/\"Boss\"",
      "url": "https://ghibli.fandom.com/wiki/Capo",
      "description": "Capo , often referred to as Boss (マンマユート・ボス , Manmayūto Bosu ), is a character in Porco Rosso . He is the leader of the Mamma Aiuto , an air pirate group known throughout the Adriatic Sea. He first appeared in The Age of the Flying Boat .",
      "appears_in": [
        "Porco Rosso"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/9/98/Aiuto_Gang_boss.jpg/revision/latest/scale-to-width-down/268?cb=20181009193659",
      "gender": "Male"
    },
    {
      "name": "Donald Curtis",
      "url": "https://ghibli.fandom.com/wiki/Donald_Curtis",
      "description": "Donald Curtis Japanese name ドナルド・カーチス ( Donald Curtis ) Species Human Age 35 years Gender Male First Appearance Porco Rosso Role Main character Voice actor (Japanese) Akio Otsuka Voice actor (English) Greg Dale Voice actor (Disney) Cary Elwes",
      "appears_in": [
        "Porco Rosso"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/6/61/Donald_Curtis.jpg/revision/latest/scale-to-width-down/268?cb=20210311172933",
      "age": "35 years",
      "gender": "Male"
    },
    {
      "name": "Ashitaka",
      "url": "https://ghibli.fandom.com/wiki/Ashitaka",
      "description": "Ashitaka Japanese name アシタカ ( Ashitaka ) Species Human Age 17 years [ 1 ] Gender Male First Appearance Princess Mononoke Role Main character Voice actor (Japanese) Yoji Matsuda Voice actor (Disney) Billy Crudup",
      "appears_in": [
        "Princess Mononoke"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/4/49/Ashitaka.jpg/revision/latest/scale-to-width-down/268?cb=20220118140313",
      "age": "17 years [ 1 ]",
      "gender": "Male"
    },
    {
      "name": "San",
      "url": "https://ghibli.fandom.com/wiki/San",
      "description": "San (サン), otherwise known as Princess Mononoke (もののけ姫, \"Mononoke hime\") or the \" Wolf Girl / Princess \", is the titular deuteragonist in Princess Mononoke . She acts, misbehaves, and resembles a wolf due to the fact that she was raised by wolves themselves.\nSan is the Princess of the Wolf Gods.",
      "appears_in": [
        "Princess Mononoke"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/3/3f/San.jpg/revision/latest/scale-to-width-down/268?cb=20210214204849",
      "age": "Unknown  (circa 15 years -17 years)",
      "gender": "Female"
    },
    {
      "name": "Shishigami",
      "url": "https://ghibli.fandom.com/wiki/Forest_Spirit",
      "description": "Forest Spirit Forest Spirit Night-Walker Japanese name シシ神 / デイダラボッチ ( Shishi Gami / Deidarabotchi ) Species God of life and death Gender Unknown, possibly genderless First Appearance Princess Mononoke Role Supporting character",
      "appears_in": [
        "Princess Mononoke"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/b/b7/Forest_Spirit.jpg/revision/latest/scale-to-width-down/268?cb=20181031022208",
      "gender": "Unknown, possibly genderless"
    },
    {
      "name": "Okkoto-nushi",
      "url": "https://ghibli.fandom.com/wiki/Okkoto",
      "description": "Okkoto (乙事主 Okkoto-Nushi) is a character from Princess Mononoke . Okkoto has the ability to see the past by sniffing someone's arm, as he did so on Ashitaka's arm to see Nago 's death.",
      "appears_in": [
        "Princess Mononoke"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/e/e2/Okkoto.png/revision/latest/scale-to-width-down/268?cb=20181011142155",
      "age": "500 years",
      "gender": "Male"
    },
    {
      "name": "Moro",
      "url": "https://ghibli.fandom.com/wiki/Moro",
      "description": "Moro (モロの君 Moro no Kimi ) is supporting character of Princess Mononoke film. She is the three-hundred years old goddess of the wolves who possesses divine power and intelligence, as well as being capable of understanding and speaking human languages. Moro is very wise and is keen to the tricks of mankind. She is a stoic and strong character who knows the evil intentions of humans. She is the leader of the wolf tribe and a loving mother. Moro comes across as threatening towards Ashitaka, but understands his deep affection for San.",
      "appears_in": [
        "Princess Mononoke"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/5/5e/Moro.png/revision/latest/scale-to-width-down/268?cb=20110702021519",
      "age": "300 years (deceased)",
      "gender": "Female"
    },
    {
      "name": "Kodama",
      "url": "https://ghibli.fandom.com/wiki/Kodama",
      "description": "Species Name Kodama Japanese notation 木霊, 木魂 or 木魅 ( Kodama ) ⓵ Appearance Princess Mononoke",
      "appears_in": [
        "Princess Mononoke"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/3/32/Kodama_Animation.gif/revision/latest/scale-to-width-down/268?cb=20210306212342"
    },
    {
      "name": "Lady Eboshi",
      "url": "https://ghibli.fandom.com/wiki/Lady_Eboshi",
      "description": "Lady Eboshi (エボシ御前, Eboshi Gozen ) is one of the villains of Princess Mononoke .",
      "appears_in": [
        "Princess Mononoke"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/5/53/Eboshi.jpg/revision/latest/scale-to-width-down/268?cb=20220118140456",
      "gender": "Female"
    },
    {
      "name": "Gonza",
      "url": "https://ghibli.fandom.com/wiki/Gonza",
      "description": "Gonza is the henchman of Lady Eboshi from Princess Mononoke directed by Hayao Miyazaki of Studio Ghibli . He was voiced by Tsunehiko Kamijo in the Japanese version and John DiMaggio in the English version.",
      "appears_in": [
        "Princess Mononoke"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/4/42/Gonza_%282%29.jpg/revision/latest/scale-to-width-down/268?cb=20181011031227",
      "gender": "Male"
    },
    {
      "name": "Kohroku",
      "url": "https://ghibli.fandom.com/wiki/Kohroku",
      "description": "Kohroku (甲六, Kōroku ) is the husband of Toki in Princess Mononoke directed by Hayao Miyazaki of Studio Ghibli . He fears Kodamas .",
      "appears_in": [
        "Princess Mononoke"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/d/d1/Kohroku_gives.jpg/revision/latest/scale-to-width-down/268?cb=20181016005524",
      "gender": "Male"
    },
    {
      "name": "Jikobo",
      "url": "https://ghibli.fandom.com/wiki/Jigo",
      "description": "Jigo or Jiko Bō (ジコ坊, lit. \"Jiko the man/priest\") in Japanese is a character from Princess Mononoke .",
      "appears_in": [
        "Princess Mononoke"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/7/79/Jigo_%282%29.jpg/revision/latest/scale-to-width-down/268?cb=20181011030826",
      "age": "Middle age",
      "gender": "Male"
    },
    {
      "name": "Chihiro Ogino/Sen",
      "url": "https://ghibli.fandom.com/wiki/Chihiro_Ogino",
      "description": "Chihiro Ogino/Sen Japanese name 荻野 千尋/千 ( Ogino Chihiro/Sen ) Species Human Age 10 years [ 1 ] Gender Female First Appearance Spirited Away Role Main character Voice actor (Japanese) Rumi Hiiragi Voice actor (Disney) Daveigh Chase",
      "appears_in": [
        "Spirited Away"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/8/8e/Chihiro_Ogino.jpg/revision/latest/scale-to-width-down/268?cb=20210214130251",
      "age": "10 years [ 1 ]",
      "gender": "Female"
    },
    {
      "name": "Haku/Nigihayami Kohaku Nushi",
      "url": "https://ghibli.fandom.com/wiki/Haku",
      "description": "Nigihayami Kohaku Nushi Japanese name ハク / 饒速水小白主 ( Haku / Nigihayami Kohaku Nushi ) Species River God, Dragon , Snake [ 1 ] Age 12 years (in appearance) Gender Male First Appearance Spirited Away Role Co-protagonist, Yubaba 's apprentice, Dragon (river god) Voice actor (Japanese) Miyu Irino Voice actor (Disney) Jason Marsden",
      "appears_in": [
        "Spirited Away"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/8/89/Haku-2.png/revision/latest/scale-to-width-down/268?cb=20201008131345",
      "age": "12 years (in appearance)",
      "gender": "Male"
    },
    {
      "name": "Yubaba",
      "url": "https://ghibli.fandom.com/wiki/Yubaba",
      "description": "Yubaba (湯婆婆, Yubāba ), or Granny by Chihiro , is the proprietor of the Bathhouse and the main villain of the Japanese animated film Spirited Away . She is the identical younger twin sister of Zeniba and the mother of Boh . She has a harpy servant called Yu-Bird and has an apprentice by the name of Haku , and is the employer of maybe hundreds of other bathhouse workers. Chihiro Ogino calls her \"Granny\".",
      "appears_in": [
        "Spirited Away"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/f/f8/Yubaba-0.jpg/revision/latest/scale-to-width-down/268?cb=20200710021834",
      "gender": "Female"
    },
    {
      "name": "Kamajī",
      "url": "https://ghibli.fandom.com/wiki/Kamaj%C4%AB",
      "description": "Kamajī Japanese name かまじ ( Kamajī ) Species Spirit Age At least 40 years [ 1 ] Gender Male First Appearance Spirited Away Role Supporting character Voice actor (Japanese) Bunta Sugawara Voice actor (Disney) David Ogden Stiers",
      "appears_in": [
        "Spirited Away"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/7/78/Kamaji.jpg/revision/latest/scale-to-width-down/268?cb=20181013004805",
      "age": "At least 40 years [ 1 ]",
      "gender": "Male"
    },
    {
      "name": "No-Face",
      "url": "https://ghibli.fandom.com/wiki/Kaonashi_(No-Face)",
      "description": "No-Face Japanese name 顔無し ( Kaonashi ) Species Spirit, \"Monster\" by Yubaba First Appearance Spirited Away Role Supporting character Voice actor (Japanese) Akio Nakamura Voice actor (Disney) Bob Bergen",
      "appears_in": [
        "Spirited Away"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/9/9d/No-Face_infobox.png/revision/latest/scale-to-width-down/268?cb=20200908135515"
    },
    {
      "name": "Lin",
      "url": "https://ghibli.fandom.com/wiki/Lin",
      "description": "Lin Japanese name リン ( Rin ) Species Spirit of The White Fox (白狐) [ 1 ] Age Almost 20 years Gender Female First Appearance Spirited Away Role Supporting character Voice actor (Japanese) Yumi Tamai Voice actor (Disney) Susan Egan",
      "appears_in": [
        "Spirited Away"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/f/f2/Lin_face.png/revision/latest/scale-to-width-down/267?cb=20200914123534",
      "age": "Almost 20 years",
      "gender": "Female"
    },
    {
      "name": "Boh",
      "url": "https://ghibli.fandom.com/wiki/Boh",
      "description": "Bō (坊, Bō , lit. \"boy\"), also known as Boh or Baby , is the son of Yubaba and nephew of Zeniba and the tertiary villain in the film, Spirited Away .",
      "appears_in": [
        "Spirited Away"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/7/7e/Boh_winks.jpg/revision/latest/scale-to-width-down/268?cb=20180815032035",
      "age": "1 years",
      "gender": "Male"
    },
    {
      "name": "Akio Ogino",
      "url": "https://ghibli.fandom.com/wiki/Akio_Ogino",
      "description": "Akio Ogino Japanese name 荻野 明夫 ( Ogino Akio ) Species Human Age 38 years [ 1 ] Gender Male First Appearance Spirited Away Role Supporting character Voice actor (Japanese) Takashi Naito Voice actor (Disney) Michael Chiklis",
      "appears_in": [
        "Spirited Away"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/4/47/Akio_Ogino.jpg/revision/latest/scale-to-width-down/268?cb=20110701072357",
      "age": "38 years [ 1 ]",
      "gender": "Male"
    },
    {
      "name": "Yuko Ogino",
      "url": "https://ghibli.fandom.com/wiki/Yuko_Ogino",
      "description": "Yūko Ogino Japanese name 荻野悠子 ( Ogino Yūko ) Species Human Age 35 years [ 1 ] Gender Female First Appearance Spirited Away Role Supporting character Voice actor (Japanese) Yasuko Sawaguchi Voice actor (Disney) Lauren Holly",
      "appears_in": [
        "Spirited Away"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/c/c6/Ichiyuko_Ogino.png/revision/latest/scale-to-width-down/268?cb=20181013005635",
      "age": "35 years [ 1 ]",
      "gender": "Female"
    },
    {
      "name": "Kashira",
      "url": "https://ghibli.fandom.com/wiki/Kashira",
      "description": "Kashira Japanese name 頭 ( Kashira ) Species Spirit Age 800+ years Gender Male First Appearance Spirited Away Role Supporting character Voice actor (Japanese) Akio Nakamura Voice actor (Disney) Unknown",
      "appears_in": [
        "Spirited Away"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/0/01/Kashira.png/revision/latest/scale-to-width-down/268?cb=20181015012841",
      "age": "800+ years",
      "gender": "Male"
    },
    {
      "name": "River Spirit",
      "url": "https://ghibli.fandom.com/wiki/River_Spirit",
      "description": "River Spirit Japanese name 河の神 ( Kawa no Kami ) Species River God, Dragon [ 1 ] Gender Male First Appearance Spirited Away Role Supporting character Voice actor (Japanese) Koba Hayashi Voice actor (Disney) Jim Ward",
      "appears_in": [
        "Spirited Away"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/d/db/River_spirit_thankful.png/revision/latest/scale-to-width-down/268?cb=20200923154720",
      "gender": "Male"
    },
    {
      "name": "Zeniba",
      "url": "https://ghibli.fandom.com/wiki/Zeniba",
      "description": "Zeniba Japanese name 銭婆 ( Zenība ) Species Witch Age 60 years Gender Female First Appearance Spirited Away Role Supporting character Overarching Villain Voice actor (Japanese) Mari Natsuki Voice actor (Disney) Suzanne Pleshette",
      "appears_in": [
        "Spirited Away"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/d/d8/Zeniba.png/revision/latest/scale-to-width-down/268?cb=20180917115708",
      "age": "60 years",
      "gender": "Female"
    },
    {
      "name": "Ged/Sparrowhawk",
      "url": "https://ghibli.fandom.com/wiki/Ged",
      "description": "Ged (ゲド, Gedo ), also known as Sparrowhawk (ハイタカ, Haitaka ), is the deuteragonist from Tales from Earthsea . He is one of the most powerful and renowned wizards in Earthsea , and is also known as one of the \"dragon lords\" that have authorities to communicate and negotiate with dragons . At the beginning of the film, he runs into Prince Arren and saves him from a pack of wolves that are chasing him through the desert.",
      "appears_in": [
        "Tales from Earthsea"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/3/33/Ged.jpg/revision/latest/scale-to-width-down/268?cb=20181015235754",
      "gender": "Male"
    },
    {
      "name": "Prince Arren/Lebannen",
      "url": "https://ghibli.fandom.com/wiki/Arren",
      "description": "Arren / Lebannen Japanese name アレン王子 ( Aren Ōji ) Species Human Age 17 years Gender Male First Appearance Tales from Earthsea Role Main character Voice actor (Japanese) Junichi Okada Voice actor (Disney) Matt Levin",
      "appears_in": [
        "Tales from Earthsea"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/e/ee/Arren.png/revision/latest/scale-to-width-down/268?cb=20120103020747",
      "age": "17 years",
      "gender": "Male"
    },
    {
      "name": "Therru/Tehanu",
      "url": "https://ghibli.fandom.com/wiki/Therru",
      "description": "Therru Japanese name テハヌー or テルー ( Tehanū or Terū ) Species Dragon Age circa 14-17 Gender Female First Appearance Tales from Earthsea Voice actor (Japanese) Aoi Teshima Voice actor (Disney) Blaire Restaneo",
      "appears_in": [
        "Tales from Earthsea"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/1/1a/Therru.jpg/revision/latest/scale-to-width-down/268?cb=20210411193308",
      "age": "circa 14-17",
      "gender": "Female"
    },
    {
      "name": "Arsene Lupin III",
      "url": "https://ghibli.fandom.com/wiki/Arsene_Lupin_III",
      "description": "Arséne Lupin III (ルパン三世, Rupan Sansei ) is the protagonist in the Studio Ghibli film The Castle of Cagliostro",
      "appears_in": [
        "The Castle of Cagliostro"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/1/1e/Tredje_Lupin.png/revision/latest/scale-to-width-down/268?cb=20181023140949",
      "gender": "Male"
    },
    {
      "name": "Daisuke Jigen",
      "url": "https://ghibli.fandom.com/wiki/Daisuke_Jigen",
      "description": "Daisuke Jigen is a character in The Castle of Cagliostro . He is a gunman and partner in crime  of Lupin III .",
      "appears_in": [
        "The Castle of Cagliostro"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/6/67/Jigen.png/revision/latest/scale-to-width-down/268?cb=20181031002615",
      "gender": "Male"
    },
    {
      "name": "Koichi Zenigata",
      "url": "https://ghibli.fandom.com/wiki/Koichi_Zenigata",
      "description": "Koichi Zenigata (usually called Inspector Zenigata ) is an incredibly talented, yet often bumbling police officer who has made it his life's goal to capture Lupin III .",
      "appears_in": [
        "The Castle of Cagliostro"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/d/d1/Koichi_Zenigata.jpg/revision/latest/scale-to-width-down/268?cb=20180910030136",
      "gender": "Male"
    },
    {
      "name": "Clarisse d'Cagliostro",
      "url": "https://ghibli.fandom.com/wiki/Clarisse_d%27Cagliostro",
      "description": "Clarisse d'Cagliostro (クラリス・ド・カリオストロ Kurarisu do Kariosutoro) is the princess and current ruler of the European Grand Duchy of Gagliostro and a friend of Lupin III from the film The Castle of Cagliostro .",
      "appears_in": [
        "The Castle of Cagliostro"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/7/7f/Clarisse_d%27Cagliostro.jpg/revision/latest/scale-to-width-down/268?cb=20180812014452",
      "gender": "Female"
    },
    {
      "name": "Unnamed Castaway",
      "url": "https://ghibli.fandom.com/wiki/Castaway",
      "description": "Castaway Species Human Gender Male First Appearance The Red Turtle Role Main character",
      "appears_in": [
        "The Red Turtle"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/b/b7/Castaway.jpg/revision/latest/scale-to-width-down/268?cb=20181023025810",
      "gender": "Male"
    },
    {
      "name": "Giant turtle",
      "url": "https://ghibli.fandom.com/wiki/Giant_turtle",
      "description": "Giant turtle Species Sea Turtle (Ghost) Gender Female First Appearance The Red Turtle Role Main character",
      "appears_in": [
        "The Red Turtle"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/9/90/Giant_Red_Turtle.jpg/revision/latest/scale-to-width-down/268?cb=20230414034946",
      "gender": "Female"
    },
    {
      "name": "Arrietty",
      "url": "https://ghibli.fandom.com/wiki/Arrietty",
      "description": "Arrietty Clock Species Borrower Age Almost 14 years Gender Female First Appearance The Secret World of Arrietty Role Main character Voice actor (Japanese) Mirai Shida Voice actor (English) Saoirse Ronan Voice actor (Disney) Bridgit Mendler",
      "appears_in": [
        "The Secret World of Arrietty"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/0/04/Arrietty.jpg/revision/latest/scale-to-width-down/268?cb=20210223202308",
      "age": "Almost 14 years",
      "gender": "Female"
    },
    {
      "name": "Sho/Shawn",
      "url": "https://ghibli.fandom.com/wiki/Sho",
      "description": "Sho (Shawn) Species Human Age 12 years Gender Male First Appearance The Secret World of Arrietty Voice actor (Japanese) Ryūnosuke Kamiki Voice actor (English) Tom Holland Voice actor (Disney) David Henrie",
      "appears_in": [
        "The Secret World of Arrietty"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/0/04/Sho.jpg/revision/latest/scale-to-width-down/268?cb=20210223202406",
      "age": "12 years",
      "gender": "Male"
    },
    {
      "name": "Homily",
      "url": "https://ghibli.fandom.com/wiki/Homily",
      "description": "Homily Japanese name ホミリ ( homiri ) Species Borrower Age Late 40s years Gender Female First Appearance The Secret World of Arrietty Role Supporting character Voice actor (Japanese) Shinobu Otake Voice actor (English) Olivia Coleman Voice actor (Disney) Amy Poehler",
      "appears_in": [
        "The Secret World of Arrietty"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/2/28/Homily_Clock.jpg/revision/latest/scale-to-width-down/268?cb=20171116031638",
      "age": "Late 40s years",
      "gender": "Female"
    },
    {
      "name": "Sadako Maki",
      "url": "https://ghibli.fandom.com/wiki/Sadako_Maki",
      "description": "Sadako Maki Species Human Age 51 years under 53 years Gender Female First Appearance The Secret World of Arrietty Voice actor (Japanese) Keiko Takeshita Voice actor (English) Phyllida Law Voice actor (Disney) Gracie Poletti",
      "appears_in": [
        "The Secret World of Arrietty"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/1/1b/Jessica.jpg/revision/latest/scale-to-width-down/268?cb=20181024000741",
      "age": "51 years under 53 years",
      "gender": "Female"
    },
    {
      "name": "Spiller",
      "url": "https://ghibli.fandom.com/wiki/Spiller",
      "description": "Spiller Species Borrower Age 18 years Gender Male First Appearance The Secret World of Arrietty Voice actor (Japanese) Tatsuya Fujiwara Voice actor (English) Luke Allen-Gale Voice actor (Disney) Moises Arias",
      "appears_in": [
        "The Secret World of Arrietty"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/4/43/Spiller.jpg/revision/latest/scale-to-width-down/268?cb=20210629230507",
      "age": "18 years",
      "gender": "Male"
    },
    {
      "name": "Pod",
      "url": "https://ghibli.fandom.com/wiki/Pod",
      "description": "Arrietty's Father Species Borrowers Age late 40s years Gender Male First Appearance The Secret World of Arrietty Voice actor (Japanese) Miura Tomokazu Voice actor (English) Mark Strong Voice actor (Disney) Will Arnett",
      "appears_in": [
        "The Secret World of Arrietty"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/7/76/Pod.png/revision/latest/scale-to-width-down/268?cb=20181031023404",
      "age": "late 40s years",
      "gender": "Male"
    },
    {
      "name": "Haru",
      "url": "https://ghibli.fandom.com/wiki/Haru",
      "description": "Haru Japanese name ハル ( haru ) Species Human Age 32 years Gender Female First Appearance The Secret World of Arrietty Role Villain Voice actor (Japanese) Kirin Kiki Voice actor (English) Geraldine McEwan Voice actor (Disney) Carol Burnett",
      "appears_in": [
        "The Secret World of Arrietty"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/3/3d/Haru_%28dam%29.jpg/revision/latest/scale-to-width-down/268?cb=20181024034124",
      "age": "32 years",
      "gender": "Female"
    },
    {
      "name": "Jiro Horikoshi",
      "url": "https://ghibli.fandom.com/wiki/Jiro_Horikoshi",
      "description": "Jiro Horikoshi Japanese name 堀越 二郎 ( Horikoshi Jirō ) Species Human Age Around 30 years [ 1 ] Gender Male First Appearance The Wind Rises Role Main character Voice actor (Japanese) Hideaki Anno Voice actor (Disney) Joseph Gordon-Levitt Zach Callison (Young)",
      "appears_in": [
        "The Wind Rises"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/d/d7/Jirou_Horikoshi.jpg/revision/latest/scale-to-width-down/268?cb=20210214130814",
      "age": "Around 30 years [ 1 ]",
      "gender": "Male"
    },
    {
      "name": "Naoko Satomi",
      "url": "https://ghibli.fandom.com/wiki/Naoko_Satomi",
      "description": "Naoko Satomi (里見 菜穂子 Satomi Naoko ) is the deuteragonist of The Wind Rises . She becomes the wife of Jirō Horikoshi , which eventually makes her Naoko Horikoshi (堀越 菜穂子 Horikoshi Naoko ).",
      "appears_in": [
        "The Wind Rises"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/d/d9/Nahoko_Satomi.jpg/revision/latest/scale-to-width-down/268?cb=20180212232627",
      "gender": "Female"
    },
    {
      "name": "Kiro Honjo",
      "url": "https://ghibli.fandom.com/wiki/Kiro_Honjo",
      "description": "Kiro Honjo Japanese name 本庄 季郎 ( Honjō Kirō ) Species Human Age Adult Gender Male First Appearance The Wind Rises Role Supporting character Voice actor (Japanese) Hidetoshi Nishija Voice actor (English) John Krasinski",
      "appears_in": [
        "The Wind Rises"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/6/6c/Kiro_Honjo.jpg/revision/latest/scale-to-width-down/268?cb=20210220142714",
      "age": "Adult",
      "gender": "Male"
    },
    {
      "name": "Kurokawa",
      "url": "https://ghibli.fandom.com/wiki/Kurokawa",
      "description": "He is the leader of a group of airplane designers at Mitsubishi Aircraft Company .",
      "appears_in": [
        "The Wind Rises"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/b/bd/Kurokawa.jpg/revision/latest/scale-to-width-down/268?cb=20210220142414",
      "age": "Adult",
      "gender": "Male"
    },
    {
      "name": "Castorp",
      "url": "https://ghibli.fandom.com/wiki/Castorp",
      "description": "Castorp is a supporting character of The Wind Rises film. He is a German gentleman seen in a hotel located in Karuizawa.",
      "appears_in": [
        "The Wind Rises"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/b/b4/Castorp.jpg/revision/latest/scale-to-width-down/268?cb=20210214131228",
      "gender": "Male"
    },
    {
      "name": "Kayo Horikoshi",
      "url": "https://ghibli.fandom.com/wiki/Kayo_Horikoshi",
      "description": "Kayo Horikoshi Species Human Age 2 (prologue) later 10 end of the film 19 Gender Female First Appearance The Wind Rises Role Supporting character Voice actor (Japanese) Mirai Shida Maki Shinta (Child) Voice actor (Disney) Mae Whitman Eva Bella (Young)",
      "appears_in": [
        "The Wind Rises"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/9/91/Kayo_Horikoshi.jpg/revision/latest/scale-to-width-down/268?cb=20210214131318",
      "age": "2 (prologue) later 10 end of the film 19",
      "gender": "Female"
    },
    {
      "name": "Caproni",
      "url": "https://ghibli.fandom.com/wiki/Caproni",
      "description": "Caproni Japanese name カプローニ ( Kapurōni ) Species Human Age 45 Gender Male First Appearance The Wind Rises Role Supporting character Voice actor (Japanese) Nomura Mansai Voice actor (Disney) Stanley Tucci",
      "appears_in": [
        "The Wind Rises"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/6/66/Caproni.jpg/revision/latest/scale-to-width-down/268?cb=20210214131501",
      "age": "45",
      "gender": "Male"
    },
    {
      "name": "Junkers",
      "url": "https://ghibli.fandom.com/wiki/Junkers",
      "description": "Junkers Japanese name フーゴー・ユンカース ( Fūgō Yunkāsu ) Species Human Gender Male First Appearance The Wind Rises Role Supporting character",
      "appears_in": [
        "The Wind Rises"
      ],
      "image_url": "https://static.wikia.nocookie.net/studio-ghibli/images/6/6d/Mr_Junkers.jpg/revision/latest?cb=20171119194913",
      "gender": "Male"
    }
  ],
  "directors": [
    {
      "name": "Hayao Miyazaki",
      "url": "https://ghibli.fandom.com/wiki/Hayao_Miyazaki",
      "born": "January 5, 1941 (age 84) Bunkyō, Tokyo, Japan",
      "birth_year": 1941,
      "nationality": "Japanese",
      "description": "Hayao Miyazaki Hayao Miyazaki in 2024 Native name 宮崎 駿 Born January 5, 1941 (age 84) Bunkyō, Tokyo, Japan Nationality Japanese Alma mater Gakushuin University Occupation (s) Film director •  producer screenwriter •  animator •  author •  manga artist Years active 1963–present Employer Toei Animation (1963–71) A-Pro (1971–73) Zuiyō Eizō (1973–75) Nippon Animation (1975–79) Telecom Animation Film/TMS (1979–82) Studio Ghibli (1985–present) Spouse(s) Akemi Ōta (m. 1965) Children Gorō Miyazaki Keisuke Miyazaki Parent(s) Katsuji Miyazaki (father) Awards Academy Awards 2001 Spirited Away Golden Bear 2002 Spirited Away Golden Lion - Honorary Award 2005 Liftime Achievement Hayao Miyazaki (宮崎 駿, Miyazaki Hayao , born January 5, 1941, in Tokyo, Japan ) is a Japanese director, animator and cartoonist.",
      "history": "Miyazaki was born in Tokyo, and is the second son of four brothers. His father was Katsuji Miyazaki and their family owned Miyazaki Airplane Mfg. Co., Ltd (宮崎航空機製作所, Miyazaki Kōkūki Seisakusho ), and their factory was based in Tochigi Prefecture in Kanuma. When the Second World War began, their family was evacuated to Utsunomiya. It was here that Miyazaki stayed until his third grade of elementary school. He moved to Eifuku, Suginami, Tokyo where he studied until 4th grade of elementary school in 1950. When he was a child, he described himself as weak and was not good at exercising. Despite his physical deficiencies, he excelled at drawing. He was an avid reader and a big fan of mangakas like Osamu Tezuka and Shigeru Sugiura. He also loved the pictures books of Tetsuji Fukushima, particularly The Devil of the Savage . When he was in third year at Toyotama High School, he grew interested in animation and was greatly influenced by Toei Animation and their film Panda and the Magic Serpent (1958). He taught himself drawing at Fumio Sato's atelier and was influenced by Impressionist painters like Paul Cézanne. His direction as a filmmaker to produce child-friendly but logically-plotted content was also affected with his experiences as a child to watch child-friendly films. He cited Gamera vs. Viras as a bad example for the entire humanity to surrender to aliens for the sake of two children, while the Gamera has later associated with Studio Ghibli in productions and distributions . [ 2 ] He entered Gakushuin University and joined the Children's Literature Circle (Children's Culture Study Group). While helping plan several puppet shows, he continued drawing manga with the goal of becoming a professional manga artist, but decided to move into the world of animation. After graduating from Gakushuin University, he joined Toei Animation as an animator. He struggled with the workmanlike atmosphere of Toei Animation, and never stopped his dream of being a cartoonist. He was grea",
      "notable_works": [
        "Castle in the Sky",
        "Howl's Moving Castle",
        "Kiki's Delivery Service",
        "My Neighbor Totoro",
        "Nausicaä of the Valley of the Wind",
        "Ponyo",
        "Porco Rosso",
        "Princess Mononoke",
        "Spirited Away",
        "The Boy and the Heron",
        "The Castle of Cagliostro",
        "The Wind Rises"
      ]
    },
    {
      "name": "Goro Miyazaki",
      "url": "https://ghibli.fandom.com/wiki/Goro_Miyazaki",
      "born": "January 21, 1967 Tokyo, Japan",
      "birth_year": 1967,
      "nationality": "Japanese",
      "description": "Gorō Miyazaki Born January 21, 1967 Tokyo, Japan Nationality Japanese Alma mater Shinshu University, Faculty of Agriculture, Department of Forest Engineering Occupation (s) CEO •  director •  animator •  landscaper •  illustrator Parent(s) Hayao Miyazaki (father) Akemi Miyazaki (mother) Katsuji Miyazaki (grandfather) Awards Emmy Awards 2014 Ronja, the Robber's Daughter Japan Academy Prize 2012 From Up on Poppy Hill 2005 Newcomer Award for Art Selection",
      "history": "Gorō Miyazaki was born in 1967 and is the eldest son to animators Hayao Miyazaki and Akemi Ōta in Tokyo, Japan. His family then settled in Tokorozawa City, Saitama Prefecture in 1970. While growing up, Gorō and his younger brother Keisuke found sketches of their parents' work. He would also become a fan of artistic duo Fujiko Fujio's manga Doraemon . Since his father was rarely at home, Gorō  resorted to studying his parent's animation projects in order to understand and communicate with him. He would often speak with Mamoru Oshii , who is a close family friend. As a high school student, Gorō thought that he \"would never be able to reach the level [his father] has attained.\" Gorō instead decided to pursue landscape architecture [ 1 ] as he became interested in the nature conservation. His decision to study at Shinshu University was due to its proximity to the mountains, which reminded him of his time in high school. After graduating from Shinshu University's School of Agriculture, Gorō later worked at Mori Building Co., Japan's leading urban landscape developer, as a construction consultant in the planning and designing of children parks such as  Okaya Kohan Park and general parks and landscape design of industrial parks. Gorō was later invited by Toshio Suzuki to help design Ghibli Museum in Mitaka. [ 2 ] Inspired by his father's plan he answered, \"I'll do it\", and promptly retired from Mori. [ 3 ] In 1998, he became the representative director of Museo Darte Ghibli Co., the operating company behind the Ghibli Museum. He served as its director from 2001 to June 2005. [ 4 ] In October 2001, he became the first president of Mamma Auito Co., and received the Minister of Education, Culture, Sports, Science and Technology Newcomer Award in the Art Promotion Division at the 2004 Art Awards. [ 5 ] Miyazaki's first film was Tales from Earthsea , an adaptation of Ursula K. Le Guin's Earthsea book series. Written by Miyazaki and Keiko Niwa, the film stars Junichi Okada, Bunt",
      "notable_works": [
        "Earwig and the Witch",
        "From Up on Poppy Hill",
        "Tales from Earthsea"
      ]
    },
    {
      "name": "Isao Takahata",
      "url": "https://ghibli.fandom.com/wiki/Isao_Takahata",
      "born": "October 29, 1935 Ujiyamada, Japan",
      "birth_year": 1935,
      "nationality": "Japanese",
      "description": "Isao Takahata Native name 高畑 勲 Born October 29, 1935 Ujiyamada, Japan Died April 5, 2018 (aged 82) Tokyo, Japan Cause of death Lung cancer Nationality Japanese Education University of Tokyo Occupation (s) Film director •  screenwriter •  producer Years active 1961–2018",
      "history": "Takahata was originally intrigued by animation after having seen the French animated cartoon feature Le Roi et l'oiseau ( The King and the Mockingbird ) based on the fairy tale by Hans Christian Andersen. He was impressed by the film, asking \"Can these kind of things be done by animation?\". While he was job hunting at his university, Takahata was tempted to join Toei Animation by a friend who knew the company wanted an assistant director at the time. For fun he took the company's entrance examination as he had been originally interested in animation. When he was notified of the informal decision, he joined the company. The reason he decided to join the company was his thought that \"If it was animation, I can be something interesting, too.\" However, there were more than ten people joining the company that same year, two recruited by Toei Animation side recruited and the surplus workers sent by Toei head office. Because of the competition, he had a hard time achieving the status of director. Takahata finally directed his first film after he was recommended for the spot by Yasuo Ōtsuka , who was both his and Hayao Miyazaki's instructor. His directorial debut was Hols: Prince of the Sun . Hols was a failure in the commercial sense. He was among the production team deemed responsible for the failure, and was accordingly demoted. He also had difficulty making a new film as the remaining staff members who had not been demoted for Hols were working on a different Toei film. In 1971, in order to make the animated feature Pippi Longstocking , Takahata left Toei Animation with Yoichi Kotabe and Hayao Miyazaki and transferred to A production (present: SHIN-EI ANIMATION Co., Ltd. )”, an animation studio founded by his former superior, Daikichiro Kusube ( 楠部大吉郎 , くすべ だいきちろう ) They travelled to Sweden to acquire the animation rights and to hunt for locations, only to be turned away at the door by author Astrid Lindgren. Though their plan was frustrated, Miyazaki found inspiration ",
      "notable_works": [
        "Grave of the Fireflies",
        "My Neighbors the Yamadas",
        "Only Yesterday",
        "Panda! Go, Panda!",
        "Pom Poko",
        "The Tale of the Princess Kaguya"
      ]
    },
    {
      "name": "Hiromasa Yonebayashi",
      "url": "https://ghibli.fandom.com/wiki/Hiromasa_Yonebayashi",
      "born": "July 10, 1973 Nonoichi, Ishikawa, Japan",
      "birth_year": 1973,
      "nationality": "Japanese",
      "description": "Hiromasa Yonebayashi Native name 米林 宏昌 Born July 10, 1973 Nonoichi, Ishikawa, Japan Nationality Japanese Alma mater Kanazawa College of Art Occupation (s) Animator •  animation director •  director Years active 1996–present Hiromasa Yonebayashi (米林 宏昌, Yonebayashi Hiromasa , born July 10, 1973, in Nonoichi, Ishikawa, Japan), nicknamed Maro (麻呂), is director of The Secret World of Arrietty and When Marnie Was There , and animator for various Studio Ghibli .",
      "history": null,
      "notable_works": [
        "Mary and the Witch's Flower",
        "Modest Heroes",
        "The Secret World of Arrietty"
      ]
    },
    {
      "name": "Tomomi Mochizuki",
      "url": "https://ghibli.fandom.com/wiki/Tomomi_Mochizuki",
      "born": "December 31, 1958 Hokkaido, Japan",
      "birth_year": 1958,
      "nationality": "Japanese",
      "description": "Tomomi Mochizuki Native name 望月 智充 Born December 31, 1958 Hokkaido, Japan Nationality Japanese Occupation (s) Director Tomomi Mochizuki (望月 智充 , Mochizuki Tomomi, born December 31, 1958, in Hokkaido, Japan) is a Japanese anime director who directed Studio Ghibli 's movie Ocean Waves .",
      "history": null,
      "notable_works": [
        "Ocean Waves"
      ]
    },
    {
      "name": "Gorō Miyazaki",
      "url": "https://ghibli.fandom.com/wiki/Gorō_Miyazaki",
      "born": "January 21, 1967 Tokyo, Japan",
      "birth_year": 1967,
      "nationality": "Japanese",
      "description": "Gorō Miyazaki Born January 21, 1967 Tokyo, Japan Nationality Japanese Alma mater Shinshu University, Faculty of Agriculture, Department of Forest Engineering Occupation (s) CEO •  director •  animator •  landscaper •  illustrator Parent(s) Hayao Miyazaki (father) Akemi Miyazaki (mother) Katsuji Miyazaki (grandfather) Awards Emmy Awards 2014 Ronja, the Robber's Daughter Japan Academy Prize 2012 From Up on Poppy Hill 2005 Newcomer Award for Art Selection",
      "history": "Gorō Miyazaki was born in 1967 and is the eldest son to animators Hayao Miyazaki and Akemi Ōta in Tokyo, Japan. His family then settled in Tokorozawa City, Saitama Prefecture in 1970. While growing up, Gorō and his younger brother Keisuke found sketches of their parents' work. He would also become a fan of artistic duo Fujiko Fujio's manga Doraemon . Since his father was rarely at home, Gorō  resorted to studying his parent's animation projects in order to understand and communicate with him. He would often speak with Mamoru Oshii , who is a close family friend. As a high school student, Gorō thought that he \"would never be able to reach the level [his father] has attained.\" Gorō instead decided to pursue landscape architecture [ 1 ] as he became interested in the nature conservation. His decision to study at Shinshu University was due to its proximity to the mountains, which reminded him of his time in high school. After graduating from Shinshu University's School of Agriculture, Gorō later worked at Mori Building Co., Japan's leading urban landscape developer, as a construction consultant in the planning and designing of children parks such as  Okaya Kohan Park and general parks and landscape design of industrial parks. Gorō was later invited by Toshio Suzuki to help design Ghibli Museum in Mitaka. [ 2 ] Inspired by his father's plan he answered, \"I'll do it\", and promptly retired from Mori. [ 3 ] In 1998, he became the representative director of Museo Darte Ghibli Co., the operating company behind the Ghibli Museum. He served as its director from 2001 to June 2005. [ 4 ] In October 2001, he became the first president of Mamma Auito Co., and received the Minister of Education, Culture, Sports, Science and Technology Newcomer Award in the Art Promotion Division at the 2004 Art Awards. [ 5 ] Miyazaki's first film was Tales from Earthsea , an adaptation of Ursula K. Le Guin's Earthsea book series. Written by Miyazaki and Keiko Niwa, the film stars Junichi Okada, Bunt",
      "notable_works": [
        "Ronja, the Robber's Daughter"
      ]
    },
    {
      "name": "Hiroyuki Morita",
      "url": "https://ghibli.fandom.com/wiki/Hiroyuki_Morita",
      "born": "June 26, 1964 Fukuoka, Japan",
      "birth_year": 1964,
      "nationality": "Japanese",
      "description": "Morita Hiroyuki Native name 森田 宏幸 Born June 26, 1964 Fukuoka, Japan Nationality Japanese Occupation (s) Director •  animator Morita Hiroyuki (森田 宏幸, Morita Hiroyuki , born June 26, 1964, in Fukuoka, Japan) is a Japanese animator and director. He has worked as an animator on projects such as Akira and Lupin III . He is best known for working as director on the Studio Ghibli film The Cat Returns as well as doing key animation for the Studio Ghibli production My Neighbors the Yamadas and in-between animation for Kiki's Delivery Service . [ 1 ] He was also a sequence director and storyboard artist on Tenchi Forever! and Kabaneri of the Iron Fortress .",
      "history": "Born in Fukuoka Prefecture Japan. Morita graduated from Fukuoka Prefectural Chikushi High School. During high school, he won several awards for anime magazines contests and even produced his own independent animated short Garasu Wari Shōnen (ガラスわり少年 , Glass Water Boy ). His contemporary at the time was Katsuyuki Toda, currently a professional manga artist. After graduating from the Department of Mechanical Engineering, Faculty of Engineering at Fukuoka University, he joined the animation production company Shaft, where he worked as an animator on Hiatari Ryōkō! . Following that, he worked freelance and worked on Akira , Kiki's Delivery Service , Roujin Z , Hashire Melos , Memories , Perfect Blue , and Golden Boy . While working on Perfect Blue , he studied idol dance choreography. He also participated working in My Neighbors the Yamadas and the Ghibli Museum -exclusive animated short Koro's Big Day Out . This film led to his being chosen to direct The Cat Returns .",
      "notable_works": [
        "The Cat Returns"
      ]
    },
    {
      "name": "Yoshiyuki Momose",
      "url": "https://ghibli.fandom.com/wiki/Yoshiyuki_Momose",
      "born": "November 29, 1953 Tokyo, Japan",
      "birth_year": 1953,
      "nationality": "Japanese",
      "description": "Yoshiyuki Momose Native name 百瀬 義行 Born November 29, 1953 Tokyo, Japan Nationality Japanese Occupation (s) Director •  animation director •  animator Yoshiyuki Momose (百瀬 義行 , Momose Yoshiyuki , born in 1953 in Tokyo, Japan) is a Japanese animator, animation director and director. He was a regular collaborator of Hayao Miyazaki and the late Isao Takahata at Studio Ghibli .",
      "history": "Born on November 29, 1953, in Tokyo, Japan. During his subcontracting years at Studio Neo Media and A Pro, Momose worked on TV titles such as Tensai Bakabon (1971-1972), Dokonjo Gaeru (1972-1974), and Hajime Ningen Gyatorus (1974-1976) (scenes from which are featured in the NTV documentary A Ghibli Artisan - Kazuo Oga Exhibition . After Momose was recruited by Ghibli to do layout and other duties on Grave of the Fireflies , he continued with the studio as supervisor of key animation on Only Yesterday and Pom Poko . After doing key animation on Porco Rosso , Whisper of the Heart , and Spirited Away , and CG work on Princess Mononoke , Momose returned to working with Takahata on My Neighbors the Yamadas where he worked alongside Osamu Tanabe doing storyboards, setting scenes, and directing the animation (Momose handled these duties for the first half of that film, Tanabe did the honors for the second half). Animation scholar Ben Ettinger writes: \"I've long felt Yoshiyuki Momose to be the person doing the most interesting and creative work at Studio Ghibli for years now - both in his many lovely and original shorts of recent years and, prior to that, as one of the unsung heroes of Takahata's films. Without his technical mastery in the layouts and concept design, those films would not have half their impact. \"He is one of the few creators involved in the studio who seems to have it all: the ability to come up with interesting stories and engaging characters and bring them alive in a compelling and original visual concept. He has the technical knowhow of a 40 year career during which he has touched on just about every aspect of animation, from traditional animation to CG animation to directing to concept illustration. In my mind, he is the obvious and only candidate to helm a Ghibli feature post M&T. \"Momose has drawn just about everything that it's possible for someone to draw in the animation process, including key animation drawings, concept drawings, layouts, charact",
      "notable_works": [
        "The Imaginary"
      ]
    },
    {
      "name": "Michaël Dudok de Wit",
      "notable_works": [
        "The Red Turtle"
      ]
    }
  ]
}