{
  "shorts": [
    {
      "title": "3000 Leagues in Search of Mother",
      "url": "https://ghibli.fandom.com/wiki/3000_Leagues_in_Search_of_Mother",
      "director": "Isao Takahata",
      "release_date": "January 4, 1976 – December 26, 1976",
      "release_year": 1976,
      "duration": "52 episodes",
      "studio": "Nippon Animation",
      "description": "3000 Leagues in Search of Mother TV Movie 1 Movie 2 DVD Kanji 母をたずねて三千里 Rōmaji Haha o Tazunete Sanzenri Directed by Isao Takahata Produced by Kōichi Motohashi Screenplay by Kazuo Fukazawa Music by Kōichi Sakata Art Directed by Takamura Mukuo Takashi Mukuo Studio Nippon Animation Distributed by Fuji Television Tokyo Channel 12 Release date(s) January 4, 1976 – December 26, 1976 Running time 52 episodes 3000 Leagues in Search of Mother (母をたずねて三千里 , Haha o Tazunete Sanzenri ) is a 52-episode animated television series directed by Isao Takahata , produced by Nippon Animation and aired in January 4 to December 26, 1976.",
      "plot": "The plot of the series focuses on Marco, a boy who lives with his family in the harbor city of Genoa, Italy during a depression period in 1881. Marco's father, Pietro Rossi, is a manager of a hospital who dedicates his time to treating poor patients, and therefore the family has financial difficulties. His beloved mother, Anna Rossi, goes to Argentina to work as a Domestic worker|maid to earn money for Marco. When the letters from his mother stop coming after an indication that she is sick, Marco fears the worst for her fate. Since his father is too busy working in his clinic and his older brother Tonio was sent to train as a locomotive driver in Milano, he is the only one free to go search for her. Marco takes his older brother's pet monkey Amedeo and they sneak aboard the Andrea Dora, a ship bound for Brazil. In Brazil Marco boards an immigrant ship and arrives in Buenos Aires, where he meets a puppeteer called Peppino and his family, whom he knew from Genoa. They accompany him to Bahía Blanca to try to locate his mother. In Bahía Blanca, he discovers his uncle stole the letters which his mother had sent him. He returns to Buenos Aires and sails off on a ship to Rosario, Santa Fe|Rosario; there he tries to figure out how to get on a train to Córdoba, Argentina|Córdoba. Marco's Italian friends collect money and buy him a train ticket. Marco arrives in Córdoba, and successfully finds the agricultural engineer Mister Mequinez. He tells Marco that his mother works for his brother in San Miguel de Tucumán|Tucumán and gives him enough money for a train ticket. But Marco ends up giving the money to a doctor to save the life of a poor girl he meets. Marco sneaks on the train, but he gets caught and tossed off in the middle of nowhere. A group of traveling Romani people|Roma rescue him and give him an old donkey. After a few days, the donkey dies and Marco continues to walk to Tucumán. He eventually arrives to his destination hungry and tired, and finds his mother. His mot",
      "poster_url": "https://static.wikia.nocookie.net/studio-ghibli/images/5/53/3000_Leagues_in_Search_of_Mother.jpg/revision/latest/scale-to-width-down/268?cb=20201011232329"
    },
    {
      "title": "A Sumo Wrestler's Tail",
      "url": "https://ghibli.fandom.com/wiki/A_Sumo_Wrestler%27s_Tail",
      "director": "Akihiko Yamashita",
      "release_date": "January 3, 2002 (Limited release in Ghibli Museum only)",
      "release_year": 2002,
      "duration": "14 minutes",
      "studio": "Studio Ghibli",
      "description": "A Sumo Wrestler's Tail Kanji ねずみのすもう or ねずみの相撲 Rōmaji Nezumi no Sumō Directed by Akihiko Yamashita Produced by Toshio Suzuki Written by Hayao Miyazaki Based on \"Nezumi no Sumō\" Starring Sawako Agawa Music by Manto Watanobe Art Directed by Noboru Yoshida Studio Studio Ghibli Production Tamami Yamamoto Yasuyoshi Tokuma Release date(s) January 3, 2002 (Limited release in Ghibli Museum only) Running time 14 minutes A Sumo Wrestler's Tail (ねずみのすもう or ねずみの相撲 , Chû-zumô or Nezumi no Sumō ) is a 13-minute short film written by Hayao Miyazaki and directed by Akihiko Yamashita . It was released on 2010 and is one of the twelve short films screened exclusively for the Ghibli Museum in Mitaka, Tokyo and Cinema Orion in Ghibli Park .",
      "plot": "Once upon a time, an old man named Jil and his wife Baa lived on a mountain. One night, the old man found a bunch of mice heading off to somewhere. Thinking this is mysterious, the old man follows the chant through the thicket until he comes to the middle of the woods, where - in the middle of a clearing - a sumo ring has been set up. In this ring, a slender mouse and a much larger white mouse are locked in a sumo match. The old man, fascinated, watches the match intently, and he suddenly realises that the slender mouse is one which lives in his house, while the fatter mouse lives in the house of a local rich man. He cheers the slender mouse on, but due to its weakness and small stature it is quickly flung out of the ring by the larger mouse, much to the man's dismay. Returning home after the match, Jil tearfully tells his wife Baa of the sumo match, lamenting the fact that he has no delicious food to offer to the mouse in order to build its strength. His wife, touched by the story, decides that the two together would take the rice they had saved and make some rice cakes and miso dengaku for the mouse. They leave the rice cakes on a shelf for the mouse to find, and come morning find they have been taken. The old couple are satisfied by this, confident that the rice cakes and miso dengaku will have added to the mouse's power. Eventually, the slender mice win against the larger mouse in an exciting climatic fight.",
      "poster_url": "https://static.wikia.nocookie.net/studio-ghibli/images/2/28/A_Sumo_Wrestler%27s_Tail.jpg/revision/latest/scale-to-width-down/268?cb=20190707144102"
    },
    {
      "title": "Boro the Caterpillar",
      "url": "https://ghibli.fandom.com/wiki/Boro_the_Caterpillar",
      "director": "Hayao Miyazaki",
      "release_date": "March 21, 2018",
      "release_year": 2018,
      "duration": "14 min.",
      "studio": "Studio Ghibli",
      "description": "Boro the Caterpillar Directed by Hayao Miyazaki Written by Hayao Miyazaki Starring Tamori Music by Joe Hisaishi Cinematography Atsushi Okui Studio Studio Ghibli Distributed by Ghibli Museum Release date(s) March 21, 2018 Running time 14 min. Boro the Caterpillar ( 毛虫のボロ , Kemushi no Boro ) is a 14-minute animated short film written and directed by Hayao Miyazaki and produced by Studio Ghibli . It premiered on March 21, 2018, and is one of the twelve short films screened exclusively at Ghibli Museum in Mitaka, Tokyo and Cinema Orion in Ghibli Park .",
      "plot": "A tiny caterpillar named Boro hatches from an egg in the leaves of a plant. Initially fearful of the outside world, he becomes fascinated as he watches the leaves photosynthesize, producing cube-like structures. Venturing out onto the wider parts of the plant, he observes his fellow caterpillars consuming the leaves, eventually following suit. This existence is interrupted, however, by the arrival of a tank-like scorpion fly, which he narrowly avoids before it kills two of the other caterpillars and carries them off. The rest of the caterpillars hastily leave the plant, leaving it mostly dead. As Boro considers his next moves, he is unexpectedly flung into the air onto the dress of a girl biking through the field where his plant is. The girl returns home, where her mother notices Boro and gently places him on a leaf before escorting him outside. Boro, caught in unfamiliar surroundings, is initially fearful once again, but notices more photosynthesis and lowers himself onto the head of its source: a beautiful dandelion, which he gleefully claims as his new home.",
      "poster_url": "https://static.wikia.nocookie.net/studio-ghibli/images/5/5d/Boro_Logo.jpg/revision/latest/scale-to-width-down/268?cb=20200916083052"
    },
    {
      "title": "Film Guru Guru",
      "url": "https://ghibli.fandom.com/wiki/Film_Guru_Guru",
      "director": "Hayao Miyazaki",
      "release_date": "January 3, 2006",
      "release_year": 2006,
      "duration": "16 minutes",
      "studio": "Studio Ghibli",
      "description": "Film Guru Guru Kanji フィルムぐるぐる Rōmaji Firumu Guru Guru Directed by Hayao Miyazaki Hiromasa Yonebayashi Produced by Toshio Suzuki Studio Studio Ghibli Production Atsuko Tanaka Distributed by Ghibli Museum Release date(s) January 3, 2006 Running time 16 minutes Film Guru Guru (フィルムぐるぐる , Firumu Guru Guru ) is a series of animated short films shown at the Ghibli Museum in Mitaka from October 1, 2001, through November 17, 2008. The series was directed by Hayao Miyazaki with storyboards by Miyazaki and Hiromasa Yonebayashi (who also produced).",
      "plot": null,
      "poster_url": "https://static.wikia.nocookie.net/studio-ghibli/images/c/cf/FilmGuru.jpg/revision/latest/scale-to-width-down/268?cb=20201116013723"
    },
    {
      "title": "Ghiblies",
      "url": "https://ghibli.fandom.com/wiki/Ghiblies",
      "director": "Yoshiyuki Momose",
      "release_date": "April 8, 2000",
      "release_year": 2000,
      "duration": "12 minutes",
      "studio": "Studio Ghibli",
      "description": "Ghiblies Kanji ギブリーズ Rōmaji Giburīzu Directed by Yoshiyuki Momose Produced by Hiroyuki Watanabe Starring Masahiko Nishimura Arata Furuta Kyôka Suzuki Studio Studio Ghibli Release date(s) April 8, 2000 Running time 12 minutes Ghiblies (ギブリーズ, Giburīzu ) is an 18-minute comedic short film, aired on NTV on April 8, 2000, and was accompanied with a documentary about Studio Ghibli . It was directed by Yoshiyuki Momose , a regular collaborator of Isao Takahata , and produced by Hiroyuki Watanabe . It was followed-up by Ghiblies Episode 2 .",
      "plot": null,
      "poster_url": "https://static.wikia.nocookie.net/studio-ghibli/images/6/64/Ghiblies.jpg/revision/latest/scale-to-width-down/268?cb=20200915224604"
    },
    {
      "title": "Ghiblies Episode 2",
      "url": "https://ghibli.fandom.com/wiki/Ghiblies_Episode_2",
      "director": "Yoshiyuki Momose",
      "release_date": "July 19, 2002",
      "release_year": 2002,
      "duration": "25 minutes",
      "studio": "Studio Ghibli",
      "description": "Ghiblies Episode 2 Kanji ギブリーズ Rōmaji Giburīzu Directed by Yoshiyuki Momose Produced by Hiroyuki Watanabe Written by Yoshiyuki Momose Starring Masahiko nishimura Arata furuta Kyôka Suzuki Kaoru Kobayashi Music by Manto Watanobe Art Directed by Noboru Yoshida Studio Studio Ghibli Production Hiromasa Yonebayashi Osamu Tanabe Shinji Ôtsuka Release date(s) July 19, 2002 Running time 25 minutes Ghiblies Episode 2 is a 25-minute sequel to Ghiblies and released in theaters alongside The Cat Returns on July 19, 2002. It was written and directed by Yoshiyuki Momose with assistance directing from Eiichirō Tashiro and Chika Matsumura, and produced by Hiroyuki Watanabe.",
      "plot": null,
      "poster_url": "https://static.wikia.nocookie.net/studio-ghibli/images/1/1a/Ghiblies_Episode_2.jpg/revision/latest/scale-to-width-down/268?cb=20200915230149"
    },
    {
      "title": "Giant God Warrior Appears in Tokyo",
      "url": "https://ghibli.fandom.com/wiki/Giant_God_Warrior_Appears_in_Tokyo",
      "director": "Shinji Higuchi",
      "release_date": "July 10, 2012 (museum) November 17, 2012 (theater)",
      "release_year": 2012,
      "duration": "9 minutes",
      "studio": "Studio Ghibli",
      "description": "Giant God Warrior Appears in Tokyo Kanji 巨神兵東京に現わる Rōmaji Kyoshinhei Tôkyô ni Arawaru Directed by Shinji Higuchi Produced by Takeshi Kobayashi Toshio Suzuki Screenplay by Hideaki Anno Narrated by Megumi Hayashibara Music by Taisei Iwasaki Editing by Atsuki Sato Eimi Lee Production Studio Ghibli Release date(s) July 10, 2012 (museum) November 17, 2012 (theater) Running time 9 minutes Giant God Warrior Appears in Tokyo (巨神兵東京に現わる , Kyoshinhei Tôkyô ni Arawaru ) is an live-action kaiju short film that premiered during the exhibition Director Hideaki Anno’s \"TOKUSATSU\" Special Effects Museum-Craftsmanship Of Showa & Heisei Eras Seen Through Miniatures held on July 10, 2012, at the Museum of Contemporary Art Tokyo. The film was directed by Shinji Higuchi and produced by Studio Ghibli . It was s",
      "plot": "During an average day in Tokyo, the narrator is shocked by the arrival of her brother, who has been away at college. He tells her that a great disaster is coming and the city will be destroyed tomorrow. She exclaims that it is just a rumor being spread around the Internet, but her sibling insists. He explains that before every disaster there is an omen or warning that precedes it. The narrator becomes frightened and believes the person in front of her to be an imposter. He tells her that he is the omen and that she should carefully decide how to react to this event before vanishing before her. Meanwhile, glowing spores have descended upon Tokyo, eventually coalescing to form an enormous being that hovers above the city. The narrator explains that gods are not only creators, but also destroyers, which is why humans worship them. The giant being begins aimlessly walking through Tokyo as the city's inhabitants look on. Suddenly, it stops and its mouth opens to reveal a device that unleashes a horrifying beam that ravages Tokyo, destroying the entire city and leaving a mushroom cloud in its wake. The narrator explains that the world has a set life span and that, if it were up to humans, life would be prolonged indefinitely. Despite its inhabitants' objections, the Earth itself called upon the God Warrior to initiate the Seven Days of Fire which will end the planet's existence. She believes that if the Earth took seven days to create, it will take just as long to destroy it. As the entire legion of God Warriors descend upon the ruins of Tokyo, the narrator says that she will forego what the gods have planned and is awaiting what will remain after they have destroyed Earth. [ 2 ]",
      "poster_url": "https://static.wikia.nocookie.net/studio-ghibli/images/5/58/God_Warrior_Poster.png/revision/latest/scale-to-width-down/268?cb=20220512074347"
    },
    {
      "title": "Hoshi o Katta Hi",
      "url": "https://ghibli.fandom.com/wiki/Hoshi_o_Katta_Hi",
      "director": "Hayao Miyazaki",
      "release_date": "January 3, 2006",
      "release_year": 2006,
      "duration": "16 minutes",
      "studio": "Studio Ghibli",
      "description": "The Day I Bought a Star Promotional visual Kanji 星をかった Rōmaji Hoshi Wo Katta Hi Directed by Hayao Miyazaki Produced by Toshio Suzuki Screenplay by Hayao Miyazaki Based on The Day I Bought a Star by Naohisa Inoue Starring Ryunosuke Kamiki Kyoka Suzuki Genzo Wakayama Hiroshi Oizumi Music by Nobuhiro Tsuru Yuriko Nakamura Art Directed by Yohei Takamatsu Production Studio Ghibli Release date(s) January 3, 2006 Running time 16 minutes The Day I Bought a Star (星をかった日 , Hoshi wo Katta Hi ) is a 16-minute animated short film written and directed by Hayao Miyazaki , produced by Studio Ghibli and released on January 3, 2006. It is one of the twelve short films that can only be seen in the Saturn Theatre at Ghibli Museum in Mitaka, Tokyo and Cinema Orion in Ghibli Park .",
      "plot": "Nona , a disaffected young boy, flees the city to escape working at the \"Time Bureau\", a place that oversees time. He then wanders the desert until he meets Niinya , a witch, who offers him a new life working at her farm. One blustery Autumn day, on the way to the market to sell some vegetables he has grown, a boy named Nona meets two strange men, Scopello and Makinso , traveling together. They are next to a train that seems to have suddenly stopped in the middle of nowhere (there are no tracks). The men open some cases they are carrying and announce that they are selling planets. The cases contain a few pieces of what look like samples of clods of earth or rocks. The boy exchanges some vegetables for a seed of the smallest planet takes it home, and begins to raise it by the window in a shed. He puts some soil in a pot, plants the seed in it, and sprays some water on it with a spray bottle. The boy lives in a house in the middle of where that belongs to Niinya. Niinya usually leaves her house at dusk and returns in the morning, and never bothers Nona. He gets up early in the morning goes to his garden, and spends most of the day there. Nona may have parents and go to school, but we are never given any information on this. We can only assume that, on order to be able to return home, Nona has to uncover some sort of personal secret. When the light of the moon shines through the window, the planet starts to float out of the pot and to revolve. It is growing. And it reveals a type of genesis. The water vapor from Nona's spray bottle eventually generates clouds, and rain starts to fall on the little planet. Lightning flashes in the clouds, and the rain that falls eventually covers half the planets in the clouds. We see the birth of primitive seas on Earth recreated. The planet absorbs the soil in the pot and gradually gets bigger and bigger. Grass seeds in the soil in the pot and gradually gets bigger and bigger. Grass seeds in the soil put down roots on the continents, ",
      "poster_url": "https://static.wikia.nocookie.net/studio-ghibli/images/b/bb/Hoshi_wo_Katta_Hi.jpg/revision/latest/scale-to-width-down/267?cb=20181209053313"
    },
    {
      "title": "Iblard Jikan",
      "url": "https://ghibli.fandom.com/wiki/Iblard_Jikan",
      "director": null,
      "release_date": "July 4, 2007",
      "release_year": 2007,
      "duration": "16 minutes",
      "studio": "Studio Ghibli",
      "description": "Iblard Jikan Kanji イバラード時間 Rōmaji Ibarādo Jikan Based on \"Iblard\" by Naohisa Inoue Music by Kiyonori Matsuo Production Studio Ghibli Distributed by Ghibli Museum Release date(s) July 4, 2007 Running time 16 minutes Iblard Jikan (イバラード時間 , Ibarādo Jikan ), literally Iblard Time , is an experimental 30-minute anime OVA directed by Naohisa Inoue and produced by Studio Ghibli , released in Japan on DVD and Blu-ray disc on July 4, 2007, as part of the Ghibli ga Ippai Collection . [ 1 ]",
      "plot": null,
      "poster_url": "https://static.wikia.nocookie.net/studio-ghibli/images/c/c3/Iblard_Jikan.jpg/revision/latest/scale-to-width-down/268?cb=20190707121030"
    },
    {
      "title": "Imaginary Flying Machines",
      "url": "https://ghibli.fandom.com/wiki/Imaginary_Flying_Machines",
      "director": "Hayao Miyazaki",
      "release_date": "October 2, 2002",
      "release_year": 2002,
      "duration": "6 minutes",
      "studio": "Studio Ghibli",
      "description": "Imaginary Flying Machines Kanji 空想の空飛ぶ機械達 Rōmaji Kūsō no Sora Tobu Kikaitachi Directed by Hayao Miyazaki Produced by Toshio Suzuki Screenplay by Hayao Miyazaki Based on \"The Twentieth Century\" by Albert Robida Narrated by Hayao Miyazaki Music by Joe Hisashi Art Directed by Yoji Takeshige Production Studio Ghibli Distributed by Ghibli Museum Release date(s) October 2, 2002 Running time 6 minutes Imaginary Flying Machines (空想の空飛ぶ機械達 , Kūsō no Sora Tobu Kikaitachi ) is a 6-minute animated short film produced by Studio Ghibli for their exclusive use as one of the twelve short films in the Ghibli Museum in Mitaka, Tokyo. It was screened from October 2, 2002, to May 9, 2004, and featured director Hayao Miyazaki as the narrator, in the form of a humanoid pig, reminiscent of Porco from Porco Rosso",
      "plot": "The film is unique in that Hayao Miyazaki appears as an anthropomorphic pig character, introducing the flying machines that first appeared in Laputa: Castle in the Sky and various \"flying machines\" that were inspired by artists in 19th century science fiction. According to Miyazaki's avatar, flying freely in the sky has long been a longing for humankind, and before the advancement of science and technology, it relied on magic or human power. However, with the invention of various machines due to the development of science, people came to believe that they could fly anything by reducing the weight of engines and gears and increasing the number of propellers, and many unusual things in 19th century European scientific novels. Throughout the film, various flying machines make an appearance. Airships that fly through the air on oars, balloons that open and close parasols, airplanes in the shape of bats and fish, wooden flying boxes that take electricity from the air, propeller armored ships of aerial pirates, aerial taxis that fly freely in the city, etc. All manner of bizarre vehicles fill the sky, reminiscent to the opening to Laputa: Castle in the Sky . Many of these designs are reminiscent of works by Jules Verne and Albert Robida are seen. Eventually, these fantastical flying machines evolve steadily into the technology we see in the real world, and now anyone can travel by air. Time passes and passenger airships give way to futuristic space craft that can be all across the sky. Miyazaki's avatar steps into one such airships, and we see images of what it must be like being in one of them. The film then poses the question, has humanity's desire to fly in the sky been fulfilled? No, now and in the future, humanity's longing for the sky will never disappear. At the end of the story, a boy who who resembles Pazu from Laputa: Castle in the Sky takes off into the sky on the red and white ornithopter called \" Alcione \".",
      "poster_url": "https://static.wikia.nocookie.net/studio-ghibli/images/1/11/K%C5%ABs%C5%8D_no_Sora_Tobu_Kikaitachi.jpg/revision/latest?cb=20200919032327"
    },
    {
      "title": "Koro's Big Day Out",
      "url": "https://ghibli.fandom.com/wiki/Koro%27s_Big_Day_Out",
      "director": "Hayao Miyazaki",
      "release_date": "January 3, 2002 (Limited release in Ghibli Museum only)",
      "release_year": 2002,
      "duration": "15 minutes",
      "studio": "Studio Ghibli",
      "description": "Koro's Big Day Out Kanji コロの大さんぽ Rōmaji Koro no Daisanpo Directed by Hayao Miyazaki Produced by Toshio Suzuki Written by Hayao Miyazaki Music by Yuji Nomi Art Directed by Noboru Yoshida Studio Studio Ghibli Production Tamami Yamamoto Yasuyoshi Tokuma Release date(s) January 3, 2002 (Limited release in Ghibli Museum only) Running time 15 minutes Koro's Big Day Out ( コロの大さんぽ , Koro no Daisanpo ) is a 15-minute animated short film, written and directed by Hayao Miyazaki and produced by Studio Ghibli . It premiered on January 3, 2002, and is one of the twelve short films exclusively shown at the Ghibli Museum in Mitaka, Japan and Cinema Orion in Ghibli Park .",
      "plot": "The film is about Koro , a puppy who runs away from his mistress, a little girl named Sawako , after she forgets to close the front gate, when she leaves for school. Koro experiences some adventures around town as he is picked up by a girl riding a bicycle, but slips away at the level train crossing. He meets a friendly old dog and his kindly owners, while his mistress and her father ride around town putting up \"Lost\" signs on the power poles. Koro eventually falls asleep under a delivery van, whose driver gives him a ride. When he gets near home, Koro smells the familiar neighborhood and leaps out of the truck and into the arms of his delighted mistress.",
      "poster_url": "https://static.wikia.nocookie.net/studio-ghibli/images/9/96/Koro%27s_Big_Day_Out.jpg/revision/latest/scale-to-width-down/268?cb=20200915014221"
    },
    {
      "title": "Kujiratori",
      "url": "https://ghibli.fandom.com/wiki/Kujiratori",
      "director": "Hayao Miyazaki",
      "release_date": "2001",
      "release_year": 2001,
      "duration": "16 minutes",
      "studio": "Studio Ghibli",
      "description": "Whale Hunt Japanese release poster Kanji くじらとり Rōmaji Kujira-tori Directed by Hayao Miyazaki Produced by Toshio Suzuki Screenplay by Hayao Miyazaki Based on No No Nursery School by Rieko Nakagawa , Yuriko Yamawaki Kujiratori by Rieko Nakagawa , Yuriko Yamawaki Music by Yuji Nomi Art Directed by Sayaka Plain Production Studio Ghibli Release date(s) 2001 Running time 16 minutes Budget USD$24 million Kujiratori (くじらとり, Kujira-tori ), or Whale Hunt , is a 16-minute animated film written and directed by Hayao Miyazaki , shown only in the Ghibli Museum in Mitaka, Japan and Cinema Orion in Ghibli Park . It premiered in October 2001.",
      "plot": "Kujiratori tells the story of children at Tulip Nursery School pretending they are building a boat with blocks, calling it \"Elephant and Lion\". As imagination replaces reality, and a young boy named Shigeru and his schoolmates load fishing rods and ropes onto the Elephant and Lion, and set out on a whale hunt. The children struggle manning the ship as it floods, and they soon brave a big storm. Suddenly, a gentle whale appears, accompanies them back to land and plays with them. They land on the beach and the children, along with the whale, take pictures to commemorate the event. The whale returns to the ocean as the children wave goodbye. Then the fantasy ends and the children are back in their class room.",
      "poster_url": "https://static.wikia.nocookie.net/studio-ghibli/images/c/c4/Kujiratori.jpg/revision/latest/scale-to-width-down/268?cb=20230411094345"
    },
    {
      "title": "Looking for a Home",
      "url": "https://ghibli.fandom.com/wiki/Looking_for_a_Home",
      "director": "Hayao Miyazaki",
      "release_date": "January 3, 2006",
      "release_year": 2006,
      "duration": null,
      "studio": "Studio Ghibli",
      "description": "Looking for a Home Kanji やどさがし Rōmaji Yadosagashi Directed by Hayao Miyazaki Produced by Toshio Suzuki Written by Hayao Miyazaki Starring Tamori Akiko Yano Studio Studio Ghibli Release date(s) January 3, 2006 Looking for a Home (やどさがし , Yadosagashi ), also known as House-Hunting , is a 12-minute animated short film written and directed by Hayao Miyazaki and produced by Studio Ghibli . It was released on January 3, 2006, and premiered alongside with Water Spider Monmon , and is one of the twelve short films shown only in the Saturn Theater, located at the basement of the Ghibli Museum in Mitaka and Cinema Orion in Ghibli Park .",
      "plot": "Fuki sets out with a big rucksack in high spirits on a journey to look for a new house. Along her way, Fuki encounters and befriends numerous manifestations of the natural world, from fish to insects to a kami who resembled Totoro. Rain suddenly begins to pour and she rushes to find shelter. She stays the night at a seemingly abandoned home in an old forest populated by various kami. The following morning, she awakens and sees the god that owns the home. She leaves in haste, but not before offering an apple at the foot of the entrance of the home. As she strolls down a hill, a basket of mushrooms appear before her, a sign of gratitude from the gods for her respect.",
      "poster_url": "https://static.wikia.nocookie.net/studio-ghibli/images/c/c9/Looking_for_a_Home.jpg/revision/latest/scale-to-width-down/268?cb=20190704214124"
    },
    {
      "title": "Mei and the Kittenbus",
      "url": "https://ghibli.fandom.com/wiki/Mei_and_the_Kittenbus",
      "director": "Hayao Miyazaki",
      "release_date": "October 2002",
      "release_year": 2002,
      "duration": null,
      "studio": "Studio Ghibli",
      "description": "Mei and the Kittenbus Rōmaji Mei to Konekobasu Directed by Hayao Miyazaki Produced by Toshio Suzuki Written by Hayao Miyazaki Starring Chika Sakamoto Music by Joe Hisaishi Art Directed by Ryoko Ina Studio Studio Ghibli Production Makiko Niki Sugino Sachiko Hiromasa Yonebayashi Release date(s) October 2002 Mei and the Kittenbus (めいとこねこバス , Mei to Konekobasu ) is a 13-minute animated film written and directed by Hayao Miyazaki and produced by Studio Ghibli and premiered in October 2002. It is the sequel to the 1988 film My Neighbor Totoro and is one of the twelve short films shown exclusively at the Saturn Theater, located at the basement of the Ghibli Museum in Mitaka, Tokyo and Cinema Orion in Ghibli Park . It has been considered the museum's most popular short film.",
      "plot": "All is well at Mei's home . Two months have passed after her mother returned home from the hospital. Mei goes outside to a little stone hill and watches the skies. When she eats a Japanese caramel cube candy, a mini whirlwind suddenly comes spinning her dress. The whirlwind chases after Mei and she runs back into the house where she manages to trap the whirlwind. It turns out to be a Kittenbus . The Kittenbus is scared and tries to escape the room at first, but bonds with Mei after she gives him a caramel cube to eat with her. The Catbus shows up, and Mei opens a window to let the Kittenbus follow the catbus into the air. Later that night, the Kittenbus takes Mei for a ride. Along the way, they spot the catbus, the kittenbus' father, which is filled with spirits like Totoro . Another catbus pulls up beside them, and soon a variety of cat vehicles appear, such as a cat-train, all filled with Totoro-like spirits. The Catbuses drop their passengers off, and the Kittenbus drops Mei off with them. The spirits move apart to reveal Totoro, who is very happy to see her. Mei hops onto his chest and he takes her to a giant, ancient Granny Cat that is being boarded by the spirits. The Kittenbus appears on his head and Mei asks the Kittenbus, \"Is this your grandma?\" in which the Kittenbus meows back. Mei introduces herself as the Kittenbus' friend, and proceeds to feed her a caramel cube. A few minutes are taken to eat the caramel candy where she almost chokes, but is ultimately happy after swallowing. She gives Mei a lick and she licks her back. The giant cat liner leaves while Totoro stays behind. Mei and the Kittenbus follow them for a while, then return to Mei's house.",
      "poster_url": "https://static.wikia.nocookie.net/studio-ghibli/images/4/42/Mei_and_kittenbus.jpg/revision/latest/scale-to-width-down/268?cb=20200912082817"
    },
    {
      "title": "Mr. Dough and the Egg Princess",
      "url": "https://ghibli.fandom.com/wiki/Mr._Dough_and_the_Egg_Princess",
      "director": "Hayao Miyazaki",
      "release_date": "November 20, 2010 (Japan)",
      "release_year": 2010,
      "duration": "12 minutes",
      "studio": "Studio Ghibli",
      "description": "Mr. Dough and the Egg Princess Japanese release poster Kanji パン種とタマゴ姫 Rōmaji Pandane to Tamago Hime Directed by Hayao Miyazaki Produced by Toshio Suzuki Screenplay by Hayao Miyazaki Based on The Harvesters by Pieter Bruegel the Elder Music by Joe Hisaishi Cinematography Atsushi Okui Editing by Takeshi Seyama Production Studio Ghibli Distributed by Toho Release date(s) November 20, 2010 (Japan) Running time 12 minutes Mr. Dough and the Egg Princess (パン種とタマゴ姫 , Pandane to Tamago Hime ) is a 12-minute animated film written and directed by Hayao Miyazaki and premiered on November 20, 2010. It is the eighth in a series of twelve short films screened exclusively at the Saturn Theater in the basement of the Ghibli Museum in Mitaka, Japan and Cinema Orion in Ghibli Park .",
      "plot": "Once upon a time, a witch named Baba Yaga lived a life of isolation in a watermill at the back of a thorny forest. She returns home having collected a basket full of eggs, then cooks them in a massive pan. Try as she might, one egg could not be cracked. She takes one her ribbons and grants life to the unbroken egg, calling it \" Egg Princess \". Time passes, and the young egg princess is forced into indentured servitude working in the witch's mill and kitchen. She's kept under the watchful eye of the witch, whose grotesque appetite fuels her obsession with creating bonemeal. She even taunts the young Tamago with an apple with a worm. One night, the leaven that was kneaded by the captive Egg suddenly comes to life and begins to move. She grants Mr. Dough sight by offering it a few berries as eyes, and helps it escape the watermill. Baba Yaga awakens and senses something is amiss. Egg Princess and Mr. Dough flee the thorny forest and through the wheat fields as villagers in a nearby town toil. Mr. Dough gains the ability to run and enjoys his stroll through the countryside. Baba Yaga searches far and wide for her ward, wreaking havoc among the laborers. The pair disguise themselves as a spoke in a wheel in a caravan of harvested wheat returning to town's mills. The town is filled with activity as they mill their harvest. Mr. Dough disguises himself as a laborer, but they are soon spotted by the witch from up on high. Baba Yaga flies down and wears a hat as she searches for the two. She stumbles upon a tent where villagers make bread. She tears through the crowd and captures Mr. Dough, then takes him into a baker's home where she dissects him into pieces of bread. The Egg Princess quickly pieces Mr. Dough back together, whom the witch seemingly allows. Once completed, Baba Yaga shoves Mr. Dough into the oven where he bakes and is turned into a large humanoid bread man. They are soon interrupted by royal guards, and along come the Egg King and Queen. The now large Mr. Dou",
      "poster_url": "https://static.wikia.nocookie.net/studio-ghibli/images/4/44/Princess_Tamago.jpg/revision/latest/scale-to-width-down/268?cb=20200911010842"
    },
    {
      "title": "On Your Mark",
      "url": "https://ghibli.fandom.com/wiki/On_Your_Mark",
      "director": "Hayao Miyazaki",
      "release_date": "July 15, 1995",
      "release_year": 1995,
      "duration": "7 minutes",
      "studio": "Real Cast Inc. (Produced by Studio Ghibli )",
      "description": "On Your Mark Kanji ジブリ実験劇場 On Your Mark Rōmaji Jiburi Jikkengekijō On Yua Māku Directed by Hayao Miyazaki Produced by Toshio Suzuki Screenplay by Hayao Miyazaki Story by Hayao Miyazaki Based on Chage and Aska's \"On Your Mark\" Music by Chage and Aska Cinematography Atsushi Okui Editing by Takeshi Seyama Production Real Cast Inc. (Produced by Studio Ghibli ) Distributed by Toei Company Release date(s) July 15, 1995 Running time 7 minutes On Your Mark (ジブリ実験劇場 , Jiburi Jikkengekijō On Yua Māku ) is a song by the Japanese rock duo Chage & Aska. The music video was part of the Ghibli Experimental Theater project and debuted on July 5, 1995. It was screened in cinemas as an opening to Whisper of the Heart on July 15, 1995.",
      "plot": "In an indeterminate future where the earth's surface has been contaminated by radiation, the human population has taken refuge in large underground megalopolises. During a brutal raid on a cult building, two police officers discover a mysterious winged young woman. Unscrupulous scientists remove it in front of their eyes, already considering it as an experiment subject. Haunted by this memory, the two policemen decide to try everything to give the winged girl her freedom...",
      "poster_url": "https://static.wikia.nocookie.net/studio-ghibli/images/4/41/On_Your_Mark.jpg/revision/latest/scale-to-width-down/268?cb=20200915232820"
    },
    {
      "title": "Portable Airport",
      "url": "https://ghibli.fandom.com/wiki/Portable_Airport",
      "director": "Yoshiyuki Momose",
      "release_date": "May 19, 2004",
      "release_year": 2004,
      "duration": null,
      "studio": "Studio Kajino Contemode",
      "description": "Portable Airport Kanji ポータブル空港 Rōmaji Pōtaburu Kūkō Directed by Yoshiyuki Momose Music by CAPSULE Yasutaka Nakata Studio Studio Kajino Contemode Release date(s) May 19, 2004 Portable Airport (ポータブル空港 , Pōtaburu Kūkō ) is a single by CAPSULE whose music video was directed by Yoshiyuki Momose animated by Studio Kajino . The song was released on a vinyl record for ¥1,365 by the now-defunct Contemode label on May 19, 2004.",
      "plot": null,
      "poster_url": "https://static.wikia.nocookie.net/studio-ghibli/images/b/b6/Portable-kuukouP.jpg/revision/latest?cb=20200929085114"
    },
    {
      "title": "Red Crow and the Ghost Ship",
      "url": "https://ghibli.fandom.com/wiki/Red_Crow_and_the_Ghost_Ship",
      "director": "Kazuya Konaka",
      "release_date": "April 1989",
      "release_year": 1989,
      "duration": "35 minutes",
      "studio": "Jim Henson's Creature Shop",
      "description": "Red Crow and the Ghost Ship Kanji 赤いカラスと幽霊船 Rōmaji Akaikarasu to Yureisen Directed by Kazuya Konaka Produced by Yoshihiko Matsumoto Starring Joe Shishido Koji Yamamoto Eriko Togaki Koji Yamaguchi Taichiro Hirokawa Music by Keiichi Oku Editing by Tomoyo Oshima Production Jim Henson's Creature Shop Release date(s) April 1989 Running time 35 minutes Red Crow and the Ghost Ship (赤いカラスと幽霊船 , Akaikarasu to Yureisen ) is a Japanese short film produced by NHK Enterprises for the 1989 Yokohama Exotic Showcase .",
      "plot": null,
      "poster_url": "https://static.wikia.nocookie.net/studio-ghibli/images/0/0a/Ghost_Ship.jpg/revision/latest/scale-to-width-down/268?cb=20210406223544"
    },
    {
      "title": "Soratobu Toshikeikaku",
      "url": "https://ghibli.fandom.com/wiki/Soratobu_Toshikeikaku",
      "director": "Yoshiyuki Momose",
      "release_date": "September 10, 2005",
      "release_year": 2005,
      "duration": "4 minutes and 54 seconds",
      "studio": "Studio Kajino Contemode",
      "description": "Flying City Planning Kanji 空飛ぶ都市計画 Rōmaji Soratobu Toshi Keikaku Directed by Yoshiyuki Momose Music by CAPSULE Yasutaka Nakata Studio Studio Kajino Contemode Release date(s) September 10, 2005 Running time 4 minutes and 54 seconds Flying City Planning (空飛ぶ都市計画 , Soratobu Toshi Keikaku ) is a single by CAPSULE whose music video was directed by Yoshiyuki Momose , animated by Studio Kajino and produced by Yamaha Music Communications. It premiered alongside the 2005 film Touch (タッチ), based on a manga by Mitsuru Adachi. The song was released on the mini-album AEROPOLIS by the now-defunct Contemode label on September 10, 2005.",
      "plot": null,
      "poster_url": "https://static.wikia.nocookie.net/studio-ghibli/images/5/57/Flying_Plan.jpg/revision/latest/scale-to-width-down/268?cb=20210413005521"
    },
    {
      "title": "Space Station No. 9",
      "url": "https://ghibli.fandom.com/wiki/Space_Station_No._9",
      "director": "Yoshiyuki Momose",
      "release_date": "April 2005",
      "release_year": 2005,
      "duration": "4 minutes 43 seconds",
      "studio": "Studio Kajino Contemode",
      "description": "Space Station No. 9 Directed by Yoshiyuki Momose Music by CAPSULE Yasutaka Nakata Studio Studio Kajino Contemode Release date(s) April 2005 Running time 4 minutes 43 seconds Space Station No. 9 is a single by CAPSULE whose music video was directed by Yoshiyuki Momose , animated by Studio Kajino and produced by Yamaha Music Communications. The music video premiered in April 2005.",
      "plot": null,
      "poster_url": "https://static.wikia.nocookie.net/studio-ghibli/images/8/89/Space_Station.jpg/revision/latest/scale-to-width-down/268?cb=20210413012214"
    },
    {
      "title": "The Invention of Imaginary Machines of Destruction",
      "url": "https://ghibli.fandom.com/wiki/The_Invention_of_Imaginary_Machines_of_Destruction",
      "director": "Hideaki Anno",
      "release_date": "October 2, 2002",
      "release_year": 2002,
      "duration": "2 minutes, 47 seconds",
      "studio": "Studio Ghibli",
      "description": "The Invention of Imaginary Machines of Destruction Kanji 空想の機械達の中の破壊の発明 Rōmaji Kūsō no Kikaitachi no Naka no Hakai no Hatsumei Directed by Hideaki Anno Screenplay by Hideaki Anno Narrated by Yoshie Taira Music by Joe Hisaishi Production Studio Ghibli Distributed by Ghibli Museum Release date(s) October 2, 2002 Running time 2 minutes, 47 seconds The Invention of Imaginary Machines of Destruction (空想の機械達の中の破壊の発明 , Kūsō no Kikaitachi no Naka no Hakai no Hatsumei ) is a 2-minute and 47 seconds animated film written and directed by Hideaki Anno and produced by Studio Ghibli . It was screened in a \"Film Box\" during a special exhibition in the Ghibli Museum in Mitaka, Tokyo.",
      "plot": null,
      "poster_url": "https://static.wikia.nocookie.net/studio-ghibli/images/1/16/Imaginary_Destruction.jpg/revision/latest/scale-to-width-down/268?cb=20200926004210"
    },
    {
      "title": "The Night of Taneyamagahara",
      "url": "https://ghibli.fandom.com/wiki/The_Night_of_Taneyamagahara",
      "director": "Kazuo Oga",
      "release_date": "July 7, 2006",
      "release_year": 2006,
      "duration": "27 minutes",
      "studio": null,
      "description": "The Night of Taneyamagahara Kanji 種山ヶ原の夜 Rōmaji Taneyamagahara no Yoru Directed by Kazuo Oga Written by Kazuo Oga Distributed by Studio Ghibli Release date(s) July 7, 2006 Running time 27 minutes The Night of Taneyamagahara (種山ヶ原の夜 , Taneyamagahara no Yoru ) is a short anime film written and directed by Kazuo Oga and released by Studio Ghibli. It was released on DVD in Japan on July 7, 2006.",
      "plot": "The story takes place when the Tohoku region suffered greatly from famine poverty. In a small corner of the Taneyamagahara plateau in the Kitakami Mountains of Iwate Prefecture, Ito, spends the night with three farmers awaiting dawn so they can begin cutting the grass. Ito falls into a deep sleep and has a dream. In his dream, he spoke with the staff of the Yinglin Police Department about a place where he can earn a living cutting trees to burn charcoal. Suddenly, the spirits of the Taneyamagahara tree rose, the rose, and the rose appear. The spirits speak with Ito over whether or not to cut down the trees in the mountains. The mountain where the trees were \"komon\" is full of water, and akebi and mushrooms can be picked up for Ito. The land is rich and bountiful. However, if Ito doesn't cut down the tree and burns charcoal, he won't be able to make living. The spirits that objected to cutting the tree said, \"Then there is no way to cut down the tree. But burn me a nice charcoal.\" This is a mysterious story about Kenji Miyazawa telling people that they do are not the only thing who live in this world.",
      "poster_url": "https://static.wikia.nocookie.net/studio-ghibli/images/e/e5/The_Night_of_Taneyamagahara.jpg/revision/latest/scale-to-width-down/268?cb=20190704221707"
    },
    {
      "title": "Treasure Hunting",
      "url": "https://ghibli.fandom.com/wiki/Treasure_Hunting",
      "director": "Takeshi Inamura",
      "release_date": "June 4, 2011",
      "release_year": 2011,
      "duration": "9 min.",
      "studio": "Studio Ghibli",
      "description": "Takara-sagashi Directed by Takeshi Inamura Based on \"Treasure Hunting\" by Rieko Nakagawa , Yuriko Yamawaki Music by Michiru Studio Studio Ghibli Distributed by Ghibli Museum Release date(s) June 4, 2011 Running time 9 min. Treasure Hunting ( たからさがし , Takara-sagashi ) is a 9-minute animated short film by Takeshi Inamura , with planning and composition by Hayao Miyazaki , and produced by Studio Ghibli . It premiered at the Ghibli Museum on June 4, 2011. It is one of the twelve short films shown exclusively there and Cinema Orion in Ghibli Park .",
      "plot": null,
      "poster_url": "https://static.wikia.nocookie.net/studio-ghibli/images/6/6f/TreasureHunting.jpg/revision/latest/scale-to-width-down/268?cb=20200915085926"
    },
    {
      "title": "Water Spider Monmon",
      "url": "https://ghibli.fandom.com/wiki/Water_Spider_Monmon",
      "director": "Hayao Miyazaki",
      "release_date": "January 2006",
      "release_year": 2006,
      "duration": null,
      "studio": "Studio Ghibli",
      "description": "Water Spider Monmon Kanji 水グモもんもん Rōmaji Mizugumo Monmon Directed by Hayao Miyazaki Produced by Toshio Suzuki Written by Hayao Miyazaki Starring Akiko Yano Music by Rio Yamase Studio Studio Ghibli Release date(s) January 2006 Water Spider Monmon (水グモもんもん , Mizugumo Monmon ) is a 15-minute animated short film written and directed by Hayao Miyazaki and produced by Studio Ghibli . It premiered in January 2006 alongside another short, Looking for a Home , and one of the twelve short films that can only be seen at the Ghibli Museum in Mitaka, Tokyo and Cinema Orion in Ghibli Park .",
      "plot": "Monmon is a water spider just trying to survive his daily struggle. One day, he meets and falls in love with a wandering water strider. She approaches him cautiously, but Monmon's advances are rebuffed. Since then, Monmon, dejected, can only watch the water strider from afar. Suddenly, the water strider is attacked and nearly eaten by a fish. Monmon saves her by taking her underwater and protects her in a bubble of oxygen that he made. When the water strider awakens, she is startled at Monmon staring at her closely, and quickly leaves. As the clouds darken and rain begins to pour, Monmon swims sadly to the bottom of the lake, waiting for dawn to come. The next day, the water strider zips across the lake and spots Monmon as he surfaces from underwater. She stares at him intently, and slowly extends her appendage towards him. Monmon, reluctant at first, taps at her appendage until they held each other closely. The water strider happily then takes Monmon across the lake, but he struggles to keep up until finally are in sync in their movements. A fish suddenly appears and tries to eat them both, but thankfully, the water strider stretches her wings and flies the both of them to safety. Monmon is content, until the water strider finally lets go and he swims away. The water strider waves goodbye, perhaps signaling they will see each other soon. We then see that life goes on in the lake.",
      "poster_url": "https://static.wikia.nocookie.net/studio-ghibli/images/5/53/Water_Spider_Monmon.png/revision/latest/scale-to-width-down/268?cb=20200902155238"
    },
    {
      "title": "Zen - Grogu and Dust Bunnies",
      "url": "https://ghibli.fandom.com/wiki/Zen_-_Grogu_and_Dust_Bunnies",
      "director": "Katsuya Kondō",
      "release_date": "November 2022",
      "release_year": 2022,
      "duration": "3 minutes",
      "studio": null,
      "description": "Zen — Grogu and Dust Bunnies Kanji 禅 グローグーとマックロクロスケ Rōmaji Zen gurōgū to makkurokurosuke Directed by Katsuya Kondō Produced by Tomohiki Ishii Based on Star Wars Music by Ludwig Göransson Release date(s) November 2022 Running time 3 minutes Zen — Grogu and Dust Bunnies (禅 グローグーとマックロクロスケ, Zen gurōgū to makkurokurosuke ) is an animated short directed by Katsuya Kondō to promote the Star Wars anthology series Visions . It focuses on the character Grogu practising Zen amidst Susuwatari .",
      "plot": null,
      "poster_url": "https://static.wikia.nocookie.net/studio-ghibli/images/e/eb/Zen_-_Grogu_and_the_Dust_Bunnies.jpg/revision/latest/scale-to-width-down/267?cb=20221112154606"
    }
  ]
}